// 节点
const nodes_data = {
  kg_medical:[
      {
        "n": {
          "identity": 0,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、避免感染分支杆菌病，卡氏肺囊肿肺炎，巨细胞病毒等。2、注意锻炼身体，提高免疫力。",
            "cure_way": "支气管肺泡灌洗",
            "name": "肺泡蛋白质沉积症",
            "cured_prob": "约40%",
            "cause": "病因未明，推测与几方面因素有关：如大量粉尘吸入（铝，二氧化硅等），机体免疫功能下降（尤其婴幼儿），遗传因素，酗酒，微生物感染等，而对于感染，有时很难确认是原发致病因素还是继发于肺泡蛋白沉着症，例如巨细胞病毒，卡氏肺孢子虫，组织胞浆菌感染等均发现有肺泡内高蛋白沉着。虽然启动因素尚不明确，但基本上同意发病过程为脂质代谢障碍所致，即由于机体内，外因素作用引起肺泡表面活性物质的代谢异常，到目前为止，研究较多的有肺泡巨噬细胞活力，动物实验证明巨噬细胞吞噬粉尘后其活力明显下降，而病员灌洗液中的巨噬细胞内颗粒可使正常细胞活力下降，经支气管肺泡灌洗治疗后，其肺泡巨噬细胞活力可上升，而研究未发现Ⅱ型细胞生成蛋白增加，全身脂代谢也无异常，因此目前一般认为本病与清除能力下降有关。",
            "cure_lasttime": "约3个月",
            "cure_department": "内科,呼吸内科",
            "easy_get": NaN,
            "desc": "肺泡蛋白质沉积症(简称PAP)，又称Rosen-Castle-man-Liebow综合征，是一种罕见疾病。该病以肺泡和细支气管腔内充满PAS染色阳性，来自肺的富磷脂蛋白质物质为其特征，好发于青中年，男性发病约3倍于女性。"
          },
          "elementId": "0"
        }
      },
      {
        "n": {
          "identity": 1,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、控制传染源：在流行季节，若有前驱症状应及早抗生素治疗。2、切断传播途径：由于百日咳杆菌对外界抵抗力较弱，无需消毒处理，但应保持室内通风，衣物在阳光下曝晒，对痰液及口鼻分泌物则应进行消毒处理。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "百日咳",
            "cause": "(一)发病原因病原菌是鲍特菌属(Bordetella)中的百日咳鲍特菌(B.pertussis)，常称百日咳杆菌，已知鲍特菌属有四种杆菌，除百日咳鲍特菌外还有副百日咳鲍特菌(B.parapertussis)，支气管败血鲍特菌(B.bronchiseptica)和鸟型鲍特菌(B.avium)，鸟型鲍特菌一般不引起人类致病，仅引起鸟类感染，百日咳杆菌长约1.0～1.5μm，宽约0.3～0.5μm，有荚膜，不能运动，革兰染色阴性，需氧，无芽孢，无鞭毛，用甲苯胺蓝染色两端着色较深，细菌培养需要大量(15%～25%)鲜血才能繁殖良好，故常以鲍-金(Border-Gengous)培养基(即血液，甘油，马铃薯)分离菌落，百日咳杆菌生长缓慢，在35～37℃潮湿的环境中3～7天后，一种细小的，不透明的菌落生长，初次菌落隆起而光滑，为光滑(S)型，又称I相细菌，形态高低一致，有荚膜和较强的毒力及抗原性，致病力强，如将分离菌落在普通培养基中继续培养，菌落由光滑型变为粗糙(R)型，称Ⅳ相细菌，无荚膜，毒力及抗原性丢失，并失去致病力，Ⅱ相，Ⅲ相为中间过渡型，百日咳杆菌能产生许多毒性因子，已知有五种毒素：1、百日咳外毒素(PT)：是存在百日咳杆菌细胞壁中一种蛋白质，过去称作为白细胞或淋巴细胞增多促进因子(leukocytosis or lymphocyte promoting factor，LPE)，组胺致敏因子(histamin sensitizing factor，HSF)，胰岛素分泌活性蛋白(insulin activating protein，IAP)，百日咳外毒素由五种非共价链亚单位(S1～S5)所组成，亚单位(S2～S5)为无毒性单位，能与宿主细胞膜结合，通过具有酶活力的亚单位S1介导毒性作用，S1能通过腺苷二磷酸(ADP)-核糖转移酶的活力，催化部分ADP-核糖从烟酰胺腺嘌呤二核苷酸(NAD)中分离出来，转移至细胞膜抑制鸟苷三磷酸(CTP)结合即G蛋白合成，导致细胞变生，同时还能促使淋巴细胞增高，活化胰岛细胞及增强免疫应答。2、耐热的内毒素(endotoxin，ET)，100℃60min只能部分破坏，180℃才能灭活，此毒素能引起机体发热及痉咳。3、不耐热毒素(HLT)这种毒素加热55℃30min后能破坏其毒性作用，此毒素抗体对百日咳杆菌感染无保护作用。4、气管细胞毒素(TCT)：能损害宿主呼吸道纤毛上皮细胞，使之变性，坏死。5、腺苷环化酶毒素(ACT)：存在百日咳杆菌细胞表面的一种酶，此酶进入吞噬细胞后被调钙蛋白所激活，催化cAMP的生成，干扰吞噬作用，并抑制中性粒细胞的趋化和吞噬细胞杀菌能力，使其能持续感染，ACT也是一种溶血素，能起溶血作用，百日咳的重要抗原是百日咳菌的两种血凝活性抗原，一种为丝状血凝素(filamentous hemagglutinin，FHA)，因来自菌体表面菌毛故又称菌毛抗原，FHA在百日咳杆菌黏附于呼吸道上皮细胞的过程中起决定作用，为致病的主要原因。实验发现，FHA免疫小鼠能对抗百日咳杆菌致死性攻击，因此FHA为保护性抗原，另一种凝集原(aggluginogens，AGG)为百日咳杆菌外膜及菌毛中的一种蛋白质成分，主要含1，2，3三种血清型凝血因子，AGG-1具有种特异性；AGG-2，3具有型特异性，通过检测凝集原的型别来了解当地流行情况，目前认为这两种血凝素抗原相应抗体是保护性抗体，百日咳杆菌根据不耐热凝集原抗原性不同分为七型凝集原，1型凝集原为所有百日咳杆菌均具备，7型凝集原为鲍特菌属(包括副百日咳杆菌，支气管败血性杆菌)所共有，2～6型以不同的配合将百日咳杆菌分为不同血清型，测定血清型主要是研究流行时菌株的血清型和选择特殊血清型菌株生产菌苗，此外，副百日咳杆菌与百日咳杆菌无交叉免疫，亦可引起流行，百日咳杆菌对外界理化因素抵抗力弱，55℃经30min即被破坏，干燥数小时即可杀灭，对一般消毒剂敏感，对紫外线抵抗力弱，但在0～10℃存活较长。(二)发病机制1、发病机制：百日咳发病机制不甚清楚，很可能是百日咳毒素对机体综合作用的结果，当细菌随空气飞沫浸入易感者的呼吸道后，细菌的丝状血凝素黏附于咽喉至细支气管黏膜的纤毛上皮细胞表面；继之，细菌在局部繁殖并产生多种毒素如百日咳外毒素，腺苷环化酶等引起上皮细胞纤毛麻痹和细胞变性，使其蛋白合成降低，上皮细胞坏死脱落，以及全身反应，由于上皮细胞的病变发生和纤毛麻痹使小支气管中黏液及坏死上皮堆聚潴留，分泌物排出受阻，不断刺激呼吸道的周围神经，传入大脑皮质及延髓咳嗽中枢，反射性引起痉挛性咳嗽，由于长期刺激使咳嗽中枢形成兴奋灶，以致非特异性刺激，如进食，咽部检查，冷风，烟雾以及注射疼痛等，均可引起反射性的痉咳，恢复期间亦可因哭泣及其他感染，诱发百日咳样痉咳，近来研究表明百日咳发生机制与百日咳杆菌毒素类物质损害宿主细胞免疫功能有关，CD4+T细胞和Th1细胞分泌的细胞因子所介导的免疫反应，在百日咳杆菌感染中起重要作用。2、病理解剖：百日咳杆菌侵犯鼻咽，喉，气管，支气管黏膜，可见黏膜充血，上皮细胞的基底部有多核白细胞，单核细胞浸润及部分细胞坏死。支气管及肺泡周围间质除炎症浸润外，可见上皮细胞胞质空泡形成，甚至核膜破裂溶解，坏死，脱落，但极少波及肺泡。若分泌物阻塞可引起肺不张，支气管扩张，有继发感染者，易发生支气管肺炎，有时可有间质性肺炎；若发生百日咳脑病，镜检或肉眼可见脑组织充血水肿，点状出血，皮质萎缩，神经细胞变性，脑水肿等改变，此时常可见到肝脏脂肪浸润等变化。",
            "cure_lasttime": "1-2个月",
            "cured_prob": "98%",
            "cure_department": "儿科,小儿内科",
            "easy_get": "多见于小儿",
            "desc": "百日咳(pertussis，whoopingcough)是由百日咳杆菌所致的急性呼吸道传染病。其特征为阵发性痉挛性咳嗽，咳嗽末伴有特殊的鸡鸣样吸气吼声。病程较长，可达数周甚至3个月左右，故有百日咳之称。多见于5岁以下的小儿，幼婴患本病时易有窒息、肺炎，脑病等并发症，病死率高。百日咳患者，阴性感染者及带菌者为传染源。潜伏期末到病后2-3周传染性最强。百日咳经呼吸道飞沫传播。典型患者病程6-8周，临床病程可分3期：1.卡他期，从发病到开始出现咳嗽，一般1-2周。2,痉咳期，一般2-4周或更长，阵发性痉挛性咳嗽为本期特点。3，恢复期，一般1-2周，咳嗽发作的次数减少，程度减轻，不再出现阵发性痉咳。一般外周血白细胞计数明显增高，分类以淋巴细胞为主。在诊断本病时要注意与支气管异物及肺门淋巴结结核鉴别。近年来幼婴及成人发病有增多趋势。"
          },
          "elementId": "1"
        }
      },
      {
        "n": {
          "identity": 2,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "对于急性中毒患者，可以立即脱离现场至空气新鲜处，脱去污染的衣着，并用肥皂水或清水冲洗污染的皮肤。口服中毒者，要给患者洗胃，中毒者应卧床静息，并接受对症、支持治疗，可给予葡萄糖醛酸。要注意防止患者出现脑水肿，切记勿给心搏未停者使用肾上腺素，对由于苯中毒引起的再生障碍性贫血症患者，可给予小量多次输血及糖皮质激素治疗。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "苯中毒",
            "cause": "吸入苯蒸气或皮肤接触苯而引起的中毒，有急性、慢性之分。急性苯中毒主要对中枢神经系统产生麻醉作用，出现昏迷和肌肉抽搐；高浓度的苯对皮肤有刺激作用。长期接角低浓度的苯可引起慢性苯中毒，出现造血障碍，早期常见血白细胞数减低，进而出现血小板数减少和贫血。患者可有鼻出血、牙龈出血、皮下出血、月经过多等临床表现。急性苯中毒多为误服或急性吸入含苯的有机溶剂所致。这些有机溶剂包括油漆、稀料、工业胶水等。慢性苯中毒是长期吸入低浓度苯及代谢产物酚类所致。",
            "cure_lasttime": "根据不同病情一般为2-4周",
            "cured_prob": "75%",
            "cure_department": "急诊科",
            "easy_get": "多见于制鞋工人及接触化工染料的工人",
            "desc": "苯(benzene)是从煤焦油分馏及石油裂解所得的一种芳香烃化合物，系无色有芳香气味的油状液体。挥发甚速，易燃易爆。工业上用作溶剂、稀释剂和化工原料。苯属中等毒类，可引起急性或慢性中毒。急性苯中毒是指口服含苯的有机溶剂或吸入高浓度苯蒸气后，出现以中枢神经系统麻醉作用为主要表现的病理生理过程，主要症状轻者为醉酒状，步态不稳，哭笑失常，重者意识丧失，抽搐，可因呼吸中枢麻痹或循环衰竭死亡。慢性苯中毒是指苯及其代谢产物酚类影响了骨髓的造血功能，临床表现为白细胞计数和血小板立秋持续减少，最终发展为再生障碍性贫血或白血病。也可影响神经系统，表现为神经衰弱和自主神经功能紊乱。"
          },
          "elementId": "2"
        }
      },
      {
        "n": {
          "identity": 3,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "根据上节所述，对喘息样支气管炎病儿，要注意家族与患儿自身过敏史，嗜酸性粒细胞检查，血清IgE水平等进行分析。如有支气管哮喘可疑时，应及早给予哮喘的防治措施。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "喘息样支气管炎",
            "cure_lasttime": "6-12个月",
            "cause": "因为多种病毒和细菌感染均可引起，较常见的有合胞病毒、副流感病毒、流感病毒、腺病毒、鼻病毒及肺炎支原体等，大多数病例可在病毒感染基础上并发细菌感染。婴幼儿的气管和支气管都比较狭小，其周围弹力纤维发育完善，故其粘膜易受感染或其他刺激而肿胀充血，引起管道狭窄，分泌物粘稠不易咳出，从而产生喘鸣音。因为婴幼儿患病毒感染者甚多，仅一小部分患儿呈喘息样支气管炎表现，提示同一病毒在不同个别中所产生的不同病理生理改变和临床表现，与机体内在因素密切相关。如近年发现合胞病毒引起的喘息样支气管炎患儿出现特异性IgE抗体，其鼻咽分泌物中组织胺浓度明显高于同样感染而无喘息表现的患儿，其亲属往往有过敏性鼻炎、荨麻疹、哮喘等变态反应性疾病史。约30%左右的患儿曾患湿疹，测血清SIgE含量常见增高。",
            "cured_prob": "95%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特定的人群",
            "desc": "喘息样支气管炎(asthmatoidbronchitis)又称哮喘性支气管炎，泛指一组喘息表现的婴幼儿急性支气管炎，是一种过敏性质的、常与呼吸道感染有关的疾病。患者常有湿疹及其他过敏史，尤以肥胖者多发，病程较长有反复发作史。急性喘息样支气管炎的主要病理基础是支气管平滑肌痉挛、微血管渗漏、粘膜水肿、炎性细胞浸润、分泌物增多滞留所致的气道可逆性阻塞。婴幼儿的气管和支气管都比较狭小，其周围弹力纤维发育完善，故其粘膜易受感染或其他刺激而肿胀充血，引起管道狭窄，分泌物粘稠不易咳出，从而产生喘鸣音。喘息伴呼气性呼吸困难以夜间为重，可有刺激性咳嗽。喘息可自行缓解或经治疗后缓解，发作间隙可无任何症状和体征，部分可发展为支气管哮喘。"
          },
          "elementId": "3"
        }
      },
      {
        "n": {
          "identity": 4,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "对高危的患者应严密观察，加强监护，当发现呼吸频速，PaO2降低等肺损伤表现，应早期给予呼吸支持和其它有效的预防及干预措施，防止ARDS进一步发展和重要脏器损伤。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "成人呼吸窘迫综合征",
            "cure_lasttime": "2-4月",
            "cause": "化脓性感染可使细菌毒素或细胞破溃产物进入肺循环。在内毒素作用下，体内释放出血管活性物质，能使毛细血管通透性增加。感染还可以转移至肺部，从而并发肺功能衰竭。休克、创伤者由于大量失血造成的低血容量，可致心输出量降低，同时也造成肺血流量减少。由于肺血容量的减少和源源不断地接受体循环而来的微型栓子，可堵塞肺血管床，致阻碍气体交换的进行。这是因为脑创伤可以激发强烈的交感神经冲动，导致显著的末梢血管收缩，随即迅速发生急性心力衰竭和肺水肿。ARDS是由许多原因引起的急性肺泡-毛细血管膜损伤，有些原因可直接损伤肺：如①吸入烟雾，毒气，胃内容物及溺水；②服用过量海洛因或水杨酸盐；③细菌，病毒及真菌等所致肺部感染；④脂肪，羊水及血栓等引起肺栓塞；以及⑤肺挫伤，放射线损伤与氧中毒等。有些全身性病理过程可引起肺损伤，如败血症、休克、弥散性血管内凝血、过敏反应、创伤及烧伤等，烧伤面积超过40%就可能导致Pao2明显降低，有些治疗措施也可能引起ARDS，如血液透析，体外循环，用尼龙丝去除白细胞等。根据病因的不同及病变特点，ARDS曾有20多个名称，如创伤后湿肺，败血症肺，休克肺，输血后肺，微血管漏出综合征，充血性肺不张，透明膜病，出现性肺综合征，僵肺综合症，进行性肺实变等。成人呼吸窘迫综合征的病理变化各种原因所致急性肺泡-毛细血管膜损害的病理变化均类似，可分为急性阶段与慢性阶段病变：(一)急性阶段病变主要为广泛肺泡血管内皮和肺泡上皮损伤所致肺水肿，首先是肺间质水肿，后出现肺泡水肿，肺重可达正常值之三倍，肺泡腔内液体蛋白质含量高，甚而是血性液体，并有血细胞，巨噬细胞，细胞碎片，无定形物质，纤维蛋白条和表面活性物质的残存物，偶而可见细胞碎片和蛋白等物质在纤维蛋白网眼中形成透明膜。",
            "cured_prob": "85%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特定人群",
            "desc": "成人呼吸窘迫综合征简称ARDS，是一种继发的，以急性呼吸窘迫和低氧血症为特征的综合征。又称休克肺、创伤肺等。为成人急性呼吸衰竭的一种类型。病因包括：休克、严重感染、颅脑损伤、严重创伤、骨折时脂肪栓塞、输血输液过量、DIC、吸入刺激性气体、氧中毒、长期使用呼吸器、体外循环、昏迷或全身麻醉后误吸、烧伤等。尽管原发损害不同，但在肺脏所引起的病理生理改变却相似，其主要特点为：①肺微血管壁通透性增加，间质水肿；②肺表面活性物质缺失，肺泡群萎陷。"
          },
          "elementId": "4"
        }
      },
      {
        "n": {
          "identity": 5,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "预防的关键是预防胎儿宫内或产时缺氧，母亲定期做产前检查是非常必要的，发现胎儿有宫内窒息的征象时，应尽快结束分娩，缺氧时间越长，吸入羊水的可能和吸入羊水的量将越大，并且长时间宫内缺氧还可造成胎儿脑损伤，在孩子娩出时的瞬间应尽快插管吸出孩子口鼻，咽腔和大气管内的羊水，避免在孩子产生啼哭时将这些部位的羊水吸入更深的肺部，使病情进一步加重。产前产时妥善处理胎儿窘迫 尽量避免和减少发生吸入，胎头娩出在未出现第一次呼吸前即于挤除或用一次性吸管清除口咽，鼻粘液极为重要也是降低发病的关键，围生医，护人员通过窒息复苏处理训练合格再上岗是必要的羊水吸入性肺炎经过治疗，预后较好，绝大多数孩子都能痊愈，并且不留任何后遗症。",
            "cure_way": "对症治疗,药物治疗,支持性治疗",
            "name": "大量羊水吸入",
            "cure_lasttime": "1-3周",
            "cause": "任何因素导致胎儿宫内或产时缺氧。由于低氧血症刺激胎儿呼吸中枢，出现喘息样呼吸，致羊水被吸入呼吸道，羊水吸入后很快被肺泡毛细血管吸收胎儿宫内窘迫是由于胎儿缺氧所引起，多数发生在临产后，但也可发生在妊娠期。胎儿宫内窘迫是胎儿围产期死亡及新生儿神经系统后遗症的常见原因，占围产儿死亡原因的首位。可分为急性胎儿窘迫和慢性胎儿窘迫。胎儿体重≥4000g称为巨大胎儿。通过正常产道常发生困难，发生肩性难产机会多，需手术助产，处理不当可发生软产道损伤或子宫破裂。",
            "cured_prob": "85%",
            "cure_department": "儿科,小儿内科",
            "easy_get": "好发于新生儿",
            "desc": "胎儿在宫内或分娩过程中吸入较大量羊水称大量羊水吸入(massiveaminoticfluidaspiration)，又称羊水吸入综合征(aminoticfluidaspirationsydrom)。一般指羊水未被污染，常有一过性的呼吸困难或青紫，症状轻，预后好。如肺部发生炎性反应，称为羊水吸入性肺炎。"
          },
          "elementId": "5"
        }
      },
      {
        "n": {
          "identity": 6,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "注意饮食卫生，防止感染蛔虫、钩虫、丝虫、绦虫、姜片虫、旋毛虫和阿米巴原虫等。",
            "cure_way": "药物治疗",
            "name": "单纯性肺嗜酸粒细胞浸润症",
            "cured_prob": "100%",
            "cause": "实验证明，进食蛔虫卵后，幼虫移行至肺可发生本症典型的肺部表现和嗜酸性粒细胞升高。引起本病的其他寄生虫还有钩虫、丝虫、绦虫、姜片虫、旋毛虫和阿米巴原虫等。药物有对氨水杨酸、阿司匹林、青霉素、硝基呋喃妥因、保泰松、氯磺丙脲、肼苯达嗪、美卡拉明(美加明)、磺胺药和甲氨蝶呤等，引起的肺泡一过性变态反应。本病在某些地区呈季节性流行，故推测环境抗原因素在某些地区亦为可能的病因。有时吸入花粉也可发生本病。病理变化主要位于肺间质，肺泡壁及终末细支气管壁，有不规则的嗜酸粒细胞浸润灶，有时肺泡内可见成堆的嗜酸粒细胞，极少累及血管。",
            "cure_lasttime": "3-6周",
            "cure_department": "内科,呼吸内科",
            "desc": "单纯性肺嗜酸粒细胞浸润症，又名吕弗琉综合征，是吕弗琉于1932年首先描述本病。单纯性肺嗜酸粒细胞浸润症特点为游走性肺部浸润伴外周血嗜酸粒细胞计数增高，肺部症状轻微，多数仅有轻咳，病程呈自限性，常于3～4周内自行痊愈。",
            "easy_get": "无特定的人群"
          },
          "elementId": "6"
        }
      },
      {
        "n": {
          "identity": 7,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、注意预防上呼吸道感染，加强耐寒锻炼。2、避免淋雨受寒，醉酒，过劳等诱因。3、积极治疗原发病，如慢性心肺疾病，慢性肝炎，糖尿病和口腔疾病等，可以预防大叶性肺炎。",
            "cure_way": "青霉素等抗生素药物治疗,对症支持性治疗,并发症治疗",
            "name": "大叶性肺炎",
            "cure_lasttime": "7--10天",
            "cured_prob": "90%以上",
            "cause": "多种细菌均可引起大叶性肺炎，但绝大多数为肺炎链球菌。肺炎链球菌为革兰阳性球菌，有荚膜，其致病力是由于高分子多糖体的荚膜对组织的侵袭作用。少数为肺炎杆菌、金黄色葡萄球菌、溶血性链球菌、流感嗜血杆菌等。当机体受寒、过度疲劳、醉酒、感冒、糖尿病、免疫功能低下等使呼吸道防御功能被削弱，细菌侵入肺泡通过变态反应使肺泡壁毛细血管通透性增强，浆液及纤维素渗出，富含蛋白的渗出物中细菌迅速繁殖，并通过肺泡间孔或呼吸细支气管向邻近肺组织蔓延，波及一个肺段或整个肺叶。大叶间的蔓延系带菌的渗出液经叶支气管播散所致。大叶肺炎病变起始于局部肺泡，并迅速蔓延至一个肺段或整个大叶。临床上起病急骤，病程大约一周。常以高热、恶寒开始，继而出现胸痛、咳嗽、咳铁锈色痰、呼吸困难、并有肺实变体征及外周血白细胞计数增高等。",
            "cure_department": "内科,呼吸内科",
            "easy_get": "多发生于青壮年男性",
            "desc": "大叶性肺炎(lobarpneumonia)，又名肺炎球菌肺炎，是由肺炎双球菌等细菌感染引起的呈大叶性分布的急性肺实质炎症。好发于青壮年男性和冬春季节，常见诱因有受凉、淋雨、醉酒或全身麻醉手术后、镇静剂过量等，当这些诱因使呼吸道防御功能被削弱时，细菌侵入肺泡通过变态反应使肺泡壁毛细血管通透性增强，浆液及纤维素渗出，富含蛋白的渗出物中细菌迅速繁殖，并向邻近肺组织蔓延，波及一个肺段或整个肺叶。近年来由于大量强有力抗生素的使用，典型的大叶性肺炎已较少见到。临床症状有突然寒战、高热、胸痛、咳嗽、咳铁锈色痰，部分患者有恶心、呕吐及烦躁不安、谵妄等消化系统和神经系统症状。体征有急性病容，呼吸急促，鼻翼扇动，早期肺部体征不明显或仅有呼吸音减低和胸膜摩擦音;实变期可有典型体征，如患侧呼吸运动减弱，语颤增强，叩诊浊音，听诊呼吸音减低，有湿罗音或病理性支气管呼吸音。血白细胞计数及中性粒细胞增高;典型的X线表现为肺段、叶实变。该病病程短，及时应用青霉素等抗生素治疗可痊愈。"
          },
          "elementId": "7"
        }
      },
      {
        "n": {
          "identity": 8,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "大楼病综合征日常预防新楼建成后不宜立即搬入办公或居住，平时应注意利用自然通风，排出楼内污浊有毒气体，保持室内空气清新干净。建议长期在室内工作的人员每两小时起身活动一次，既能活动身体，又能清脑提神，增强心肺功能，同时要多喝水，还可在室内放一些绿色植物，既美化环境，调节空气湿度，还能避免干燥刺激皮肤和呼吸系统。大楼病综合征健康教育健康的室内空气质量必须由建筑师，室内设计师，大楼经营者和使用者共同来创造。大楼拥有者和公司经营者的态度尤其重要，因为员工很难从个人层面做出具体改善，所以当老板发现员工接二连三出现身体不适的情形，可别以为他们夸张了感冒病情，当有一天他们不再抱怨时，可能都已经生病在家无法继续工作了。欧洲目前的建筑概念是让摩天大楼的每个窗子都能打开，每个房间都有独立空调，每个员工都能接近一个窗子，得到充分的阳光和空气。",
            "cure_way": "支持性治疗,康复治疗",
            "name": "大楼病综合征",
            "cure_lasttime": "10天",
            "cause": "高层建筑的大楼里，空气中含有危险的尘埃。这是因为吸烟或使用天然气、煤气、清洁剂、油漆、粘合剂等，不断地释放出许多种有机化学物。由于高楼人们在室内逗留时间较长，加上通风不好，就会使空气“稠化”。它们都在向空间发射不同能量、不同频率的电磁波，由于大楼混凝土板块的作用，电磁波便像幽灵一样，在大楼里荡来荡去，这些电磁波会影响人体固有的电流和磁波，导致心律不齐和神经衰弱。各种新型材料及室内塑料地板、壁纸、家具、涂料等装饰用品，常含有不同程度的有毒成分。这些物质可以通过人体呼吸道和皮肤的吸收，进入血液循环系统，影响机体的免疫力，从而导致病症发生。",
            "cured_prob": "90%",
            "cure_department": "其他科室,其他综合",
            "easy_get": "无特定人群",
            "desc": "大楼病综合征有多种表现，均因接触各种有害物质所致。好发于办公室内工作的人群，或人员密集的大楼内工作的人群。最常发生于新的密闭大楼内，这种大楼为了减少散热而不开窗，大楼内安装有加热及降温管道，这些管道由同一处发出。CO2升高是这些大楼最常见现象，是大楼病综合征的一个常见原因。患者变得焦虑，过度通气，进而发展成手足抽搐和严重的呼吸困难。"
          },
          "elementId": "8"
        }
      },
      {
        "n": {
          "identity": 9,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "我国现用的车间空气中CS2最高容许浓度为10mg/m3，已有一些研究结果提示，这一卫生标准需要修订，以确保作业者的健康。对CS2作业者应给予就业体检和上岗后的定期查体，包括内科，神经科和眼科检查，必要时进行神经肌电图，血脂，心电图等检查。具有器质性神经系统疾病，各种精神病，视网膜病变，冠心病或糖尿病者，不宜从事CS2作业。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "二硫化碳中毒",
            "cure_lasttime": "1-2个月",
            "cured_prob": "80-85%",
            "cause": "发病原因：二硫化碳的工业生产：常见用二硫化碳制粘胶纤维的化纤厂拉丝车间，以及制造玻璃纸、硫氰酸盐等化工生产中。由于二硫化碳对金属、木质及橡胶等都有较强的腐蚀作用，故生产设备、管道极易受腐蚀而发生跑、冒滴、漏或突然破裂等意外事故，导致急性中毒发生。无防护地使用二硫化碳：在用二硫化碳为羊毛去脂的羊毛加工业，用作衣服去渍剂的干洗业，以及用作熏蒸剂为粮食消毒、灭虫的种库、粮仓，也可因疏于防护，在通风不良环境中作业过久而吸入大量高浓度二硫化碳气体，引起急性中毒。制造二硫化碳的生产过程：在用硫蒸气通入燃烧的炭火以制造二硫化碳的生产过程中，如设备简陋或防护措施不周，可因吸入大量溢出的二硫化碳浓蒸气而发生急性中毒。二硫化碳经呼吸道进入人体，也可经皮肤和胃肠道吸收，进入体内后，10～30％仍经肺排出，70％～90％经代谢从尿排出，CS2中毒机理尚未阐明，主要有以下几种可能：1、CS2代谢物二硫代氨基甲酸酯与维生素B6结合，致使以吡哆醛为辅酶的一些酶，如转氨酶等受抑制。2、二硫代氨基甲酸酯与微量元素结合，如与一些脱氢酶中锌和细胞色素氧化酶，多巴胺β-羟化酶中铜结合，使酶失去活性，干扰能量及儿茶酚胺代谢，损害神经系统，特别是锥体外系。3、CS2抑制单胺氧化酶活性，使脑中5-羟色胺积蓄，与中毒性精神病可能有关。4、CS2抑制血浆中脂蛋白酶和脂质清除因子活性，致脂蛋白和脂类代谢紊乱，β-脂蛋白可渗入动脉壁内，导致玻璃样变，动脉硬化。",
            "cure_department": "急诊科",
            "easy_get": "接触化学染料及粘胶纤维的工人",
            "desc": "二硫化碳(carbondisulfide，CS2)是工业上应用广泛的化学溶剂，也用于粘胶纤维、四氯化碳，农药生产等。为无色易挥发的液体，带有芳香味，工业品有烂萝卜气味。二硫化碳中毒是指因生产中发生事故而吸入二硫化碳高浓度蒸气所致中枢神经系统损害，急性中毒时轻者酒醉状态，步态不稳，感觉异常，重者可出现兴奋，谵妄，严重时发生昏迷、抽搐，甚至呼吸中枢麻痹导致死亡。"
          },
          "elementId": "9"
        }
      },
      {
        "n": {
          "identity": 10,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "肺-胸膜阿米巴病日常预防本病流行于全世界，多流行于热带和亚热带地区，但较寒冷的地区，甚至北极圈内也有阿米巴感染和流行，其感染率高低与各地环境卫生，经济状况和饮食习惯等密切相关，据估计全世界约有10%的人受染，有的地方感染率可高达50%，在我国的分布一般农村高于城市，近年来由于我国卫生状况和生活水平的提高，急性阿米巴痢疾和脓肿病例，除个别地区外，已较为少见，大多为散在分布的慢性迁延型或典型病例及带虫者。㈠传染源：慢性病人，恢复期病人及健康的带虫者为本病的传染源，包囊抵抗力很强，在潮湿低温的环境中，可存活12天以上，在水内可活9～30天，但包囊对干燥，高温和化学药物的抵抗力较弱，如50℃时，短时即死亡，干燥环境中的生存时间仅数分钟，在0.2%盐酸，10%～20%食盐水以及酱油，醋等调味品中均不能长时间存活，50%酒精能迅速杀死之。㈢流行特点：溶组织内阿米巴病发布广泛，在温带地区，该病可时有流行，而在热带及亚热带地区，其流行情况则尤为严重，在我国解放以来，各地阿米巴的感染率明显降低，如北京首都医院1973～1978年共检查了38 075例，阳性率为0.52%;福建医大1976年惠安检查216例儿童，阳性率4.63%;东北佳木期医学院报告(1980)，检查市郊中学生487例，阳性率仅为0.4%;1979年在浙江乐清普查一个大除农民557例，阳性率为3.2%，其发病情况因时而异，以秋季为多，夏季次之，发病率男多于女，成年多于儿童，这可能与吞食含包囊的食物或年龄免疫有关。",
            "cure_way": "药物治疗,支持性治疗,手术治疗",
            "name": "肺-胸膜阿米巴病",
            "cure_lasttime": "2周--2月",
            "cause": "发病原因：寄生于人体的阿米巴原虫有10余种，仅溶组织阿米巴原虫对人体有致病力，滋养体是原虫的寄生形式，体内以大小滋养体和包囊形式存在，大滋养体是致病型，小滋养体是滋养体与包囊的中间过渡类型，成熟包囊具有感染性，有较强的抵抗外界能力，在粪便中存活2周以上，在水中存活5周以上，是传播疾病的惟一形态，致病性阿米巴特有的编码蛋白水解酶基因，对侵犯组织能力有重要影响。发病机制：阿米巴原虫感染中，90%为隐性感染，10%发生侵袭性阿米巴病。这主要取决于感染虫株的特性，也与宿主机体免疫状态，营养状况和抵抗力有关，当人吞入被包囊污染的食物或水后，因包囊有抗胃酸作用，故顺利到达小肠下段，借助于胰蛋白酶的催化作用，囊内虫体脱囊而出，分裂成小滋养体，在肠腔内定居，在结肠功能正常情况下，小滋养体停止活动，分泌囊壁形成包囊，随粪便排出，当宿主机体抵抗力下降或肠功能紊乱时，小滋养体侵入肠壁，大量增殖，转变为大滋养体，病原虫直接接触并黏附到靶细胞，吞噬，溶解组织细胞，滋养体释放水解蛋白酶引起组织溶解坏死，同时对补体有抵抗作用，黏附参与机体应答的中性粒细胞，释放更多的酶，加重组织炎症和破坏，形成脓肿。肺，胸腹阿米巴病90%为肝源性，可由肝脓肿穿破到胸膜和肺;经肝，膈，肺粘连处组织间隙，血管侵入肺;经肝静脉入下腔静脉至肺和胸膜，肠源性则滋养体从肠壁病灶经肠道淋巴管，胸导管入上腔静脉或直肠下静脉入下腔静脉侵入肺。",
            "cured_prob": "80%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特殊人群",
            "desc": "肺-胸膜阿米巴病是溶组织阿米巴原虫感染所致的肺及胸膜化脓性炎症，肝原性病变多发生在右下肺，血源性则多为两肺多发病变。肠外阿米巴病中，肺和胸膜阿米巴病发生率仅次于肝脏，胸部阿米巴病右侧多发且大多继发于靠近膈肌的肝阿米巴脓肿，而肝阿米巴脓肿是肠阿米巴病的晚期并发症。"
          },
          "elementId": "10"
        }
      },
      {
        "n": {
          "identity": 11,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "肺出血-肾炎综合征可迅速致死。死亡原因常为肺出血和呼吸衰竭，在急性期常需气管插管，辅助通气和血透。随后的处理依赖于大剂量皮质类固醇的使用(甲基强的松龙每日7~15mg/kg，分次静脉注射)，免疫抑制剂环磷酰胺及反复血透排除循环中抗肾小球基膜抗体。免疫抑制治疗的疗程变动较大。",
            "cure_way": "药物治疗,康复治疗,支持治疗",
            "name": "肺出血－肾炎综合征",
            "cure_lasttime": "10-30天",
            "cause": "呼吸道感染特别与流感病毒感染是本病最常见的诱因，最近研究发现获得性免疫缺陷病患者感染卡氏肺囊虫肺炎(Pneumocystis Carinii Pneumonia)后，机体易产生抗GBM抗体，Calderon等报道4例HIV感染者中3例抗Ⅳ型胶原α3链抗体(抗GBM抗体)阳性，提示卡氏肺囊虫肺炎时肺泡损害可以诱发肺出血-肾炎综合征。硬皮病是以局限性或弥漫性皮肤及内脏器官结缔组织纤维化、硬化及萎缩为特点的结缔组织病，其主要特点为皮肤、滑膜、骨骼肌、血管和食道出现纤维化或硬化硬皮病(scleroderma)，是以局限性或弥漫性皮肤及内脏器官结缔组织纤维化、硬化及萎缩为特点的结缔组织病，其主要特点为皮肤、滑膜、骨骼肌、血管和食道出现纤维化或硬化。吸入可卡因 Perez等报道1例长期吸烟的患者在吸用可卡因3周以后发生了肺出血-肾炎综合征。接触汽油蒸汽羟化物，松节油及吸入各种碳氢化合物。",
            "cured_prob": "70%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特殊人群",
            "desc": "肺出血-肾炎综合征，又称抗基膜性肾小球肾炎，Goodpasture综合征或Goodpasture病，可能系病毒感染和/或吸入某些化学性物质引起。它是由抗基膜抗体导致的肾小球和肺泡壁基膜的严重损伤，临床表现为肺出血，急进性肾小球肾炎和血清抗肾小球基膜(GBM)抗体阳性三联征。多数患者病情进展迅速，预后凶险。"
          },
          "elementId": "11"
        }
      },
      {
        "n": {
          "identity": 12,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、注意饮食卫生，不吃变质食品。2、注意口腔卫生,防止感染，如拔牙后应及时用抗生素等。3、对病牙及扁桃体等病灶应早期治疗，以清除放线菌的发源地。",
            "cure_way": "大剂量青霉素治疗、手术治疗",
            "name": "肺放线菌病",
            "cure_lasttime": "2-12月",
            "cause": "放线菌常寄生于人体口腔黏膜，牙龈，扁桃体，结肠等处，当机体抵抗力下降，可因口腔分泌物吸入而侵入呼吸道，首先在支气管内引起病变，再侵入肺实质，亦可由于食管病变向纵隔蔓延，或腹部感染穿过膈肌波及胸膜和肺，在肺部引起化脓性肺炎，并经叶间隙，胸膜侵犯胸壁，肋骨，形成窦道，也可侵入血循环，引起全身播散。",
            "cured_prob": "96%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特殊人群",
            "desc": "肺放线菌病(pulmonaryactinomycosis)是由厌氧的以色列放线菌感染肺部引起的慢性化脓性肉芽肿性疾病，病变以多发性脓肿和窦道形成，分泌物含有硫黄色颗粒脓液为特征，易形成纤维化。本菌为正常人口腔、龋齿，扁桃体隐窝中的常存菌,多数由于口腔卫生不良，吸入含有放线菌颗粒的分泌物而发病，也可来自血行播散或腹部病灶的直接蔓延，颈面部和胸腹部病变约占1/3。肺脏罹患放线菌感染，称为肺放线菌病。"
          },
          "elementId": "12"
        }
      },
      {
        "n": {
          "identity": 13,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、避免感染分支杆菌病，卡氏肺囊肿肺炎，巨细胞病毒等。2、注意锻炼身体，提高免疫力。",
            "cure_way": "药物治疗,支持性治疗，对症治疗",
            "name": "肺泡蛋白沉着症",
            "cure_lasttime": "10-30天或更长",
            "cause": "所谓免疫功能低下是一种病理特征，通俗一点讲，人体免疫力就是我们的身体在面对外来的侵害时所能抵御侵害的能力。比如无处不在的细菌、顽固不化的病毒向你进攻时，你身体抵抗能力的好与坏直接决定了你是否会染病。饮酒超出适量饮酒或一般社交性饮酒的标准。重度饮酒往往根据超出一定的日饮酒量(如每天3标准杯)或每次饮酒量(如一次5标准杯，每周至少一次)加以确定。遗传一般是指亲代的性状又在下代表现的现象，但在遗传学上指遗传物质从上代传给后代的现象。微生物感染是指，感染了细菌、霉菌、滴虫、支原体等。大量粉尘吸入是指吸入铝，二氧化硅等尘埃。",
            "cured_prob": "1-3%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特殊人群",
            "desc": "肺泡蛋白沉着症(Pulmonaryalveolarproteinosis，PAP)是一种原因未明的少见疾病。其特点是肺泡内或细支气管腔内有不可溶性富磷脂蛋白沉积。好发于青中年，男性发病约为女性的3倍。病因未明，推测与几方面因素有关：如大量粉尘吸入(铝，二氧化硅等)，机体免疫功能下降(尤其婴幼儿)，遗传因素，酗酒，微生物感染等。虽然启动因素尚不明确，但基本上同意发病过程为脂质代谢障碍所致。即由于机体内、外因素作用引起肺泡表面活性物质的代谢异常。病理学检查以肺泡内充满有过碘酸雪夫(PAS)染色阳性的蛋白样物质为特征，该病由Rosen于1958年首次报道。肺泡蛋白沉着症根据病因可有原发性、继发性和先天性之分。临床症状主要表现为气短、咳嗽和咳痰，典型的症状为活动后气急，以后进展为休息时也感到气急。胸部X线呈双肺弥漫性肺部浸润阴影。诊断主要根据支气管肺泡灌洗物检查或经纤支镜或剖胸活检作出病理诊断。咳出的痰经80%乙醇固定，PAS染色有15%阳性的脂质。试用蛋白溶解酶雾化吸入或间歇正压呼吸器吸入。行支气管肺灌洗术是迄今惟一被证明有效的治疗方法。支气管肺泡灌洗通过BAIL，将沉积在肺泡的表面活性物质排出，从而改善肺通气和换气功能，很多情况下仅能暂时缓解症状，需定期反复进行。"
          },
          "elementId": "13"
        }
      },
      {
        "n": {
          "identity": 14,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "在疑有曲菌感染的环境工作时，应作好防护工作，如戴防护口罩以免吸入大量病菌，在真菌实验室进行烟曲菌，黄曲菌，黑曲菌等菌的操作时，更要注意防止将这些病菌吸入肺部。",
            "cure_way": "抗曲霉菌药物治疗,对症支持治疗,部分慢性感染如曲霉球需要手术切除治疗",
            "name": "肺曲菌病",
            "cure_lasttime": "3-6月",
            "cured_prob": "70-80%",
            "cause": "肺曲菌病(pulmonary aspergillosis)主要由烟曲菌(aspergillus fumigatus)引起。该菌寄生在上呼吸道，只有在慢性病患者机体免疫力降低时才能致病。空气中到处有曲菌孢子，在秋冬和阴雨季节，当储藏的谷草发热霉烂时更多。吸入曲菌孢子不一定致病，大量吸入才能引起急性气管-支气管炎或肺炎。本病常继发于肺部已有疾病，如支气管囊肿、支气管扩张、肺炎、肺脓肿等。曲菌的内毒素使组织坏死，病灶为浸润性、实变、支气管周围炎或粟粒状弥慢性病变。",
            "cure_department": "内科,呼吸内科",
            "easy_get": "免疫低下或免疫缺陷人群",
            "desc": "肺曲菌病(pulmonaryaspergillosis)致病菌主要为烟曲菌，少数为黄曲菌、土曲菌、黑曲菌，棒状曲菌、构巢曲菌及花斑曲菌等。我国从1949年到1988年底陆续报告的呼吸道曲菌感染约300多例，然而近年随着广谱抗生素广泛使用，激素长期使用、肿瘤放化疗等曲霉菌感染发病率明显上升。肺部曲菌病绝大多数为继发感染，原发者较少见，也可见于少数免疫正常者。临床上一般将本病分为曲菌球、变态反应性支气管肺曲菌病(ABPA)和侵入性肺曲菌病(IPA)等三种类型。"
          },
          "elementId": "14"
        }
      },
      {
        "n": {
          "identity": 15,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "放射性肺炎的防治关键，在于“防”，“防”的关键在于以下三点：(1)严格掌握放射剂量：一般在5周内放射量为2500rad的常规剂量较为安全。(2)控制放射野，放射野越大，发生率越高。(3)选择适当的照射速度，以每周剂量800-1000rad为宜，一旦发现本病，应尽早开始治疗，阻断病程的进展，如已发生广泛肺纤维化，则预后不良。",
            "cure_way": "药物对症治疗为主，早期可能需要激素治疗",
            "name": "放射性肺炎",
            "cure_lasttime": "3个月",
            "cause": "(一)发病原因放射性肺炎的发生，肺部损伤的严重程度与放射面积，放射量，放射速度和放射的方法均有密切关系，一般在5周内放射量阈值在25Gy的常规照射量较为安全，放射剂量在6周内20Gy极少产生放射性肺炎，在相同时间内，剂量超过40Gy，放射性肺炎发生率达100%，放射量超过60Gy，可引起严重肺损伤，放射量越大，发生率越高，肺的损伤越严重，以同样大的剂量作大面积照射治疗引起的肺组织损伤远较肺局部照射为严重，照射速度越快，越易产生肺损伤，其他影响因素如个体对放射线的敏感性，肺部的原有疾病如肺炎，慢性支气管炎，肺气肿，肺间质性疾病等或第2次放射性照射均易促进放射性肺炎的发生，甲状腺癌，咽喉部肿瘤放射性治疗，包括频繁的CT检查也可以引起肺损伤，产生放射性肺炎，老人和小孩对放射性治疗的耐受性差，化学疗法所用药物(如博来霉素)引起的肺毒性可能加重放射性肺的损害。(二)发病机制放射性肺炎的病理变化可分为急性放射性炎症改变和慢性纤维化病变，急性炎症改变多发生在放射治疗后1～2个月，亦可发生在放射治疗结束后6个月，主要表现为肺毛细血管，小动脉充血，扩张和栓塞，血管通透性增高，肺泡细胞肿胀，Ⅱ型肺泡细胞和肺泡巨噬细胞增加，淋巴管扩张和肺泡内透明膜形成，肺泡壁有淋巴细胞浸润，急性可自行消散，也可有结缔组织增生和纤维化，慢性阶段的肺组织变化为广泛肺泡纤维化，肺泡间隔增厚，肺泡萎缩，血管内壁增厚，玻璃样变和硬化，管腔狭窄或阻塞致使气体交换功能降低和肺动脉压力增高，若继发肺部感染可促进放射性肺纤维化，也是导致死亡的重要诱因。",
            "cured_prob": "70%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "射线敏感人群",
            "desc": "放射性肺炎(radiationpneumonitis)系由于肺癌，乳腺癌，食管癌，恶性淋巴瘤或胸部其他恶性肿瘤经放射治疗后，在放射野内的正常肺组织受到射线损伤而引起的炎症反应。轻者无症状，炎症可自行消散，部分患者留有索条样陈旧病灶;重者肺脏发生广泛纤维化，导致呼吸功能损害，甚致呼吸衰竭。"
          },
          "elementId": "15"
        }
      },
      {
        "n": {
          "identity": 16,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1.勿滥用广谱抗生素。2.长期应用抗生素、糖皮质激素及免疫抑制药者，应定期查粪、尿、痰等，并仔细作体格检查，必要时定期作胸部X线检查。3.对必须长期应用抗生素及糖皮质激素者，可间歇预防性地给予抗真菌药物，如制霉菌素、酮康唑、氟康唑。4.医护人员接触病人前后应洗手，避免交叉感染。",
            "cure_way": "抗真菌治疗，对症治疗，,支持性治疗",
            "name": "肺念珠菌病",
            "cure_lasttime": "2-6周",
            "cause": "正常人皮肤，口腔，胃肠道等均有念珠菌寄生，正常情况下不致病，当人体免疫防御功能下降，寄殖于口腔，上呼吸道的念珠菌可侵入呼吸道引起内源性感染。院内交叉感染可致外源性感染，留置导管，黏膜溃疡等破坏黏膜完整性，也可使念珠菌侵入体内，肺可为原发性感染，也可为血源播散性念珠菌的一部分。饮食不洁肺也是会引发肺念珠菌病的。发病机制支气管肺念珠菌病的感染途径主要为吸入(原发)，即定植于口腔和上呼吸道的念珠菌在机体防御机制削弱时吸至下呼吸道和肺泡所致，念珠菌入侵组织后转为菌丝型，大量繁殖，菌丝念珠菌有抗吞噬能力，引起白细胞浸润为主的急性炎症反应，形成溃疡，多发性微小脓肿和组织坏死，慢性感染则以肉芽肿病变和纤维组织增生为主，血源播散型则是菌丝和酵母向血管内侵入，引起双肺弥漫性损害，典型表现为坏死的肺组织和大量繁殖的念珠菌组成的出血性结节。",
            "cured_prob": "80%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "免疫力低下病人",
            "desc": "肺念珠菌病是一种常见的肺真菌病，由念球菌属(主要是白念珠菌)感染所致。本病多为继发性感染，在人体抵抗力降低的情况下发病。临床上可分为三型：(1)支气管炎型。(2)肺炎型。(3)过敏型。病原主要为白色念珠菌，其次为热带念珠菌、高里氏念珠菌和星状念珠菌。据报道，念珠菌感染占真菌感染的79%，尤其在重症监护室、灼伤和肿瘤科发病率较高。"
          },
          "elementId": "16"
        }
      },
      {
        "n": {
          "identity": 17,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "由于肺大疱形成的原因不明确，因此任何可以预防细小支气管炎症活瓣形成的措施均可采取。如戒烟，避免受凉感冒，增强体质，预防支气管肺部感染。",
            "cure_way": "康复治疗,手术治疗",
            "name": "肺大疱",
            "cure_lasttime": "2-4周",
            "cured_prob": "85%",
            "cause": "(一)发病原因肺大疱是由于肺泡高度膨胀，肺泡壁破裂并相互融合而形成，一般是由小支气管的活瓣性阻塞所引起，与肺气肿的形成机制相同，但程度较重，气肿的肺泡直径超过1cm，发生在肺实质内，常伴有不同的肺部疾病，如慢性支气管炎和支气管哮喘，晚期矽肺或结节病，也有些肺大疱见于肺和支气管无疾病的患者，肺大疱继发于肺炎或肺脓肿者多见于婴幼儿，有单发的也有多发的，因有炎性病变，小支气管粘膜有水肿，造成管腔部分阻塞，产生活门作用，空气能进入肺泡而不易排出，肺泡内压力增高，肺泡间隔逐渐因泡内压力增加而破裂，乃形成巨大的含气囊腔，临床上称之为肺大疱。继发于肺结核的则多为单发，亦无明显之肺气肿同时存在。继发于肺气肿者，常为多发，除大疱之外，常伴有多数小疱。",
            "cure_department": "内科,呼吸内科",
            "easy_get": "多见于吸烟人群",
            "desc": "肺大疱是指由于各种原因导致肺泡腔内压力升高，肺泡壁破裂，互相融合，在肺组织形成的含气囊腔。直径超过1厘米，常发生在肺气肿基础上，一般继发于细小支气管的炎性病变，如肺炎，肺气肿和肺结核，临床上最常与肺气肿并存。发生机制与肺气肿相似但程度较重。肺大疱有先天性和后天性两种。先天性多见于小儿，因先天性支气管发育异常，黏膜皱襞呈瓣膜状，软骨发育不良，引起活瓣作用所致。后天性多见于成人、老年患者，常伴慢性支气管炎和肺气肿。目前绝大多数的肺大疱手术均可在电视胸腔镜下完成，2/3的患者术后症状明显改善。"
          },
          "elementId": "17"
        }
      },
      {
        "n": {
          "identity": 18,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、适度锻炼，增强免疫力。避免引起免疫力减退的情况，如：醉酒、过劳、淋雨等。2、接种疫苗。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "肺炎球菌肺炎",
            "cure_lasttime": "1个月",
            "cause": "当呼吸道防御功能削弱，呼吸道受病毒感染，破坏支气管粘膜的完整性，易诱发细菌感染。常见于受寒、疲劳、饥饿、酒醉、麻醉、昏迷、免疫缺陷病、充血性心衰等情况。入侵细菌数量多、毒力强。细菌入侵后必然会遭到机体免疫力的抵抗，只有当入侵的细菌数量多、毒力强，超过机体的抵抗能力才致病。",
            "cured_prob": "80%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "无特殊人群",
            "desc": "肺炎球菌肺炎是由肺炎链球菌所引起，占社区获得性肺炎中的半数以上。起病急，有寒战、高热、胸痛、咳嗽和血痰等症状。近年来由于抗菌药物的广泛应用，临床上症状轻或不典型病较为多见。肺炎球菌一般通过吸入，经上呼吸道到达肺部。它们停留在细支气管内增殖并引起炎症过程，开始在肺泡腔内产生大量蛋白质的液体，这种液体起着病菌培养介质的作用，并可帮助病菌向邻近肺泡扩散，典型的结果是导致大叶性肺炎。"
          },
          "elementId": "18"
        }
      },
      {
        "n": {
          "identity": 19,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、首先是戒烟。2、注意保暖，避免受凉，预防感冒。3、改善环境卫生，做好个人劳动保护，消除及避免烟雾，粉尘和刺激性气体对呼吸道的影响。",
            "cure_way": "药物治疗,支持性治疗,手术治疗",
            "name": "肺气肿",
            "cause": "引起慢支的各种因素如感染，吸烟，大气污染，职业性粉尘和有害气体的长期吸入，过敏等，均可引起阻塞性肺气肿。弹性蛋白酶及其抑制因子失衡学说。α1-抗胰蛋白酶缺乏和肺气肿关系的研究提示，肺气肿是由肺内的蛋白酶和抗蛋白酶含量的不平衡，使肺泡间隔破坏，大量肺气肿的动物模型支持这一假说，人类肺气肿的研究证明，弹性多肽的浓度在肺气肿的病人中增加，吸烟可增加弹性蛋白溶解活性，抑制肺的成纤维细胞的浸润，造成对弹性蛋白酶的组织敏感性增加，抑制了抗弹性蛋白酶的活性，这些发现支持吸烟使弹性蛋白酶和抗弹性蛋白酶的平衡被打破，从而造成肺的微细结构的破坏，引起肺气肿。",
            "cure_lasttime": "120天",
            "cured_prob": "0.5%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "长期接触有机或无机粉尘，有害气体者，吸烟者",
            "desc": "肺气肿是指终末细支气管远端(呼吸细支气管，肺泡管、肺泡囊和肺泡)的气道弹性减退，过度膨胀，充气和肺容积增大或同时伴有气道壁破坏的病理状态。按其发病原因肺气肿有如下几种类型：老年性肺气肿，代偿性肺气肿，间质性肺气肿，灶性肺气肿，旁间隔性肺气肿，阻塞性肺气肿。"
          },
          "elementId": "19"
        }
      },
      {
        "n": {
          "identity": 20,
          "labels": [
            "Disease"
          ],
          "properties": {
            "prevent": "1、严格执行消毒与隔离制度这主要是针对医务人员及院内环境、器械而言，接触病人前后严格洗手、戴手套操作，定期环境及室内消毒通风，按照要求定期清洗、消毒呼吸治疗装置，定期更换机械通气及雾化器管路等，采取一整套严格的院内感染监测和预防计划。据报道，采取这一计划的医院与未采取的医院比较，院内感染率低20%。2、胃肠道去污治疗是欧洲常用的一种预防措施，主要是针对院内感染的易感人群，目的是去除胃肠内的菌落寄殖与生长。方法有全胃肠去污和选择性胃肠去污法，常用的为后者，它通过鼻饲或口服胃肠不吸收的多粘菌素B、妥布霉素(庆大霉素或新霉素等)及二性霉素B，连用5天，并每天系统应用头孢菌素，从口咽部及胃肠道中去除需氧菌而不降低厌氧菌的数量，其预防作用在革兰阴性杆菌方面尤为明显，据作者统计有关文献，去污组几乎无继发性肺炎克雷白杆菌的肺炎与呼吸道感染(个别为耐药株感染)。3、保护胃部酸性屏障主要是在预防应激性溃疡时，应用硫糖铝(ulcerlmin)类药物，它既可以防止应激性溃疡出血，又因它具有吸附胃黏膜、改变胃黏液、增加胃腔中前列腺素E2(PGE2)含量、吸收胃蛋白酶的作用，并不改变胃内酸性环境，从而有效地起到了防止溃疡及防止感染的作用。而且据文献介绍，硫糖铝尚具有内在的杀菌活性，一系列研究表明应用抗酸剂组的肺炎发生率为23%～35%，而应用硫糖铝组肺炎的发生率为10%～19%。4、生物预防肺炎克雷白杆菌肺炎的生物预防方法尚处于实验阶段。Held等利用自肺炎克雷白杆菌荚膜多糖(CPS)诱导产生的IgM单克隆抗体(MAb) 注射给实验动物以预防肺炎克雷白杆菌肺炎，与对照组比较，无论器官受累率、感染组织的细菌数量、肺内组织学改变等诸方面，预防组远优于对照组 (P<0.01)，但这种MAb尚无阻止肺炎克雷白杆菌进入肺内的作用，而是加速感染吸收，增强肺的排菌能力。另外尚有一些类似的实验报告，但成熟的疫苗及抗体尚未应用于临床，需进一步研究。肺炎克雷白杆菌肺炎危害人类已一个多世纪，随着科学的发展，检查及治疗手段的不断完善，人类对其了解的逐步深入，相信可以进一步降低它的发病率及病死率，取得更大的进步。",
            "cure_way": "药物治疗,支持性治疗",
            "name": "肺炎杆菌肺炎",
            "cure_lasttime": "7-21天",
            "cause": "本病的致病菌为克雷白杆菌。肺炎克雷白杆菌对人致病性较强，是重要的条件致病菌和医源性感染菌之一。",
            "cured_prob": "68%",
            "cure_department": "内科,呼吸内科",
            "easy_get": "多见于老年人",
            "desc": "肺炎杆菌肺炎(克雷白杆菌肺炎)，克雷白杆菌肺炎是由肺炎克雷白杆菌引起的急性肺部炎症，多见于老年、营养不良、慢性酒精中毒，已有慢性支气管-肺疾病和全身衰竭的患者。起病急剧，有高热，咳嗽，痰量多和胸痛。可有紫绀，气急，心悸，约半数患者有畏寒，可早期出现休克。"
          },
          "elementId": "20"
        }
      },
      {
        "n": {
          "identity": 21,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "二羟丙茶碱片"
          },
          "elementId": "21"
        }
      },
      {
        "n": {
          "identity": 22,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "氯霉素片"
          },
          "elementId": "22"
        }
      },
      {
        "n": {
          "identity": 23,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "小青龙合剂"
          },
          "elementId": "23"
        }
      },
      {
        "n": {
          "identity": 24,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "大月晶丸"
          },
          "elementId": "24"
        }
      },
      {
        "n": {
          "identity": 25,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "琥乙红霉素颗粒"
          },
          "elementId": "25"
        }
      },
      {
        "n": {
          "identity": 26,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "奥硝唑片"
          },
          "elementId": "26"
        }
      },
      {
        "n": {
          "identity": 27,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "乳酸左氧氟沙星片"
          },
          "elementId": "27"
        }
      },
      {
        "n": {
          "identity": 28,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸氨溴索葡萄糖注射液"
          },
          "elementId": "28"
        }
      },
      {
        "n": {
          "identity": 29,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸特比萘芬凝胶"
          },
          "elementId": "29"
        }
      },
      {
        "n": {
          "identity": 30,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "托西酸舒他西林胶囊"
          },
          "elementId": "30"
        }
      },
      {
        "n": {
          "identity": 31,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "雷公藤多苷片"
          },
          "elementId": "31"
        }
      },
      {
        "n": {
          "identity": 32,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "伊曲康唑胶囊"
          },
          "elementId": "32"
        }
      },
      {
        "n": {
          "identity": 33,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢泊肟酯胶囊"
          },
          "elementId": "33"
        }
      },
      {
        "n": {
          "identity": 34,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用磺苄西林钠"
          },
          "elementId": "34"
        }
      },
      {
        "n": {
          "identity": 35,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "替硝唑片"
          },
          "elementId": "35"
        }
      },
      {
        "n": {
          "identity": 36,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硫酸沙丁胺醇片"
          },
          "elementId": "36"
        }
      },
      {
        "n": {
          "identity": 37,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用硫代硫酸钠"
          },
          "elementId": "37"
        }
      },
      {
        "n": {
          "identity": 38,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硝酸咪康唑乳膏"
          },
          "elementId": "38"
        }
      },
      {
        "n": {
          "identity": 39,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "化痰平喘片"
          },
          "elementId": "39"
        }
      },
      {
        "n": {
          "identity": 40,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硝酸益康唑溶液"
          },
          "elementId": "40"
        }
      },
      {
        "n": {
          "identity": 41,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用呋塞米"
          },
          "elementId": "41"
        }
      },
      {
        "n": {
          "identity": 42,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "穿心莲内酯片"
          },
          "elementId": "42"
        }
      },
      {
        "n": {
          "identity": 43,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用盐酸溴己新"
          },
          "elementId": "43"
        }
      },
      {
        "n": {
          "identity": 44,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用鼠神经生长因子"
          },
          "elementId": "44"
        }
      },
      {
        "n": {
          "identity": 45,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸利多卡因注射液"
          },
          "elementId": "45"
        }
      },
      {
        "n": {
          "identity": 46,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "阿莫西林颗粒"
          },
          "elementId": "46"
        }
      },
      {
        "n": {
          "identity": 47,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "布美他尼片"
          },
          "elementId": "47"
        }
      },
      {
        "n": {
          "identity": 48,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用甲泼尼龙琥珀酸钠"
          },
          "elementId": "48"
        }
      },
      {
        "n": {
          "identity": 49,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "克霉唑阴道片"
          },
          "elementId": "49"
        }
      },
      {
        "n": {
          "identity": 50,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸克林霉素胶囊"
          },
          "elementId": "50"
        }
      },
      {
        "n": {
          "identity": 51,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "环吡酮胺乳膏"
          },
          "elementId": "51"
        }
      },
      {
        "n": {
          "identity": 52,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢拉定分散片"
          },
          "elementId": "52"
        }
      },
      {
        "n": {
          "identity": 53,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "胸腺肽肠溶片"
          },
          "elementId": "53"
        }
      },
      {
        "n": {
          "identity": 54,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢氨苄甲氧苄啶片"
          },
          "elementId": "54"
        }
      },
      {
        "n": {
          "identity": 55,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用还原型谷胱甘肽钠"
          },
          "elementId": "55"
        }
      },
      {
        "n": {
          "identity": 56,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "祛痰止咳胶囊"
          },
          "elementId": "56"
        }
      },
      {
        "n": {
          "identity": 57,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "氨苄西林胶囊"
          },
          "elementId": "57"
        }
      },
      {
        "n": {
          "identity": 58,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "十一味金色丸"
          },
          "elementId": "58"
        }
      },
      {
        "n": {
          "identity": 59,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "枸橼酸喷托维林片"
          },
          "elementId": "59"
        }
      },
      {
        "n": {
          "identity": 60,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "仁青芒觉"
          },
          "elementId": "60"
        }
      },
      {
        "n": {
          "identity": 61,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "布地奈德气雾剂"
          },
          "elementId": "61"
        }
      },
      {
        "n": {
          "identity": 62,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸班布特罗胶囊"
          },
          "elementId": "62"
        }
      },
      {
        "n": {
          "identity": 63,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "喘嗽宁片"
          },
          "elementId": "63"
        }
      },
      {
        "n": {
          "identity": 64,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "氨茶碱片"
          },
          "elementId": "64"
        }
      },
      {
        "n": {
          "identity": 65,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "阿奇霉素颗粒"
          },
          "elementId": "65"
        }
      },
      {
        "n": {
          "identity": 66,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "甲泼尼龙片"
          },
          "elementId": "66"
        }
      },
      {
        "n": {
          "identity": 67,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢克肟颗粒"
          },
          "elementId": "67"
        }
      },
      {
        "n": {
          "identity": 68,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸特比萘芬溶液"
          },
          "elementId": "68"
        }
      },
      {
        "n": {
          "identity": 69,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸特比萘芬片"
          },
          "elementId": "69"
        }
      },
      {
        "n": {
          "identity": 70,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "环酯红霉素片"
          },
          "elementId": "70"
        }
      },
      {
        "n": {
          "identity": 71,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "氟康唑胶囊"
          },
          "elementId": "71"
        }
      },
      {
        "n": {
          "identity": 72,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "氨溴特罗口服溶液"
          },
          "elementId": "72"
        }
      },
      {
        "n": {
          "identity": 73,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "噻托溴铵粉吸入剂"
          },
          "elementId": "73"
        }
      },
      {
        "n": {
          "identity": 74,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "蒺藜药酒"
          },
          "elementId": "74"
        }
      },
      {
        "n": {
          "identity": 75,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢氨苄胶囊"
          },
          "elementId": "75"
        }
      },
      {
        "n": {
          "identity": 76,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "地塞米松磷酸钠注射液"
          },
          "elementId": "76"
        }
      },
      {
        "n": {
          "identity": 77,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "阿奇霉素分散片"
          },
          "elementId": "77"
        }
      },
      {
        "n": {
          "identity": 78,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "琥乙红霉素片"
          },
          "elementId": "78"
        }
      },
      {
        "n": {
          "identity": 79,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "人血白蛋白"
          },
          "elementId": "79"
        }
      },
      {
        "n": {
          "identity": 80,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢丙烯分散片"
          },
          "elementId": "80"
        }
      },
      {
        "n": {
          "identity": 81,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "甲硝唑片"
          },
          "elementId": "81"
        }
      },
      {
        "n": {
          "identity": 82,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "百咳静糖浆"
          },
          "elementId": "82"
        }
      },
      {
        "n": {
          "identity": 83,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "肺气肿片"
          },
          "elementId": "83"
        }
      },
      {
        "n": {
          "identity": 84,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用头孢唑林钠"
          },
          "elementId": "84"
        }
      },
      {
        "n": {
          "identity": 85,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "阿奇霉素片"
          },
          "elementId": "85"
        }
      },
      {
        "n": {
          "identity": 86,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硫酸特布他林片"
          },
          "elementId": "86"
        }
      },
      {
        "n": {
          "identity": 87,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸班布特罗片"
          },
          "elementId": "87"
        }
      },
      {
        "n": {
          "identity": 88,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢拉定胶囊"
          },
          "elementId": "88"
        }
      },
      {
        "n": {
          "identity": 89,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "白及颗粒"
          },
          "elementId": "89"
        }
      },
      {
        "n": {
          "identity": 90,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用盐酸头孢替安"
          },
          "elementId": "90"
        }
      },
      {
        "n": {
          "identity": 91,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硫酸特布他林雾化液"
          },
          "elementId": "91"
        }
      },
      {
        "n": {
          "identity": 92,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "蛤蚧定喘丸"
          },
          "elementId": "92"
        }
      },
      {
        "n": {
          "identity": 93,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "司帕沙星分散片"
          },
          "elementId": "93"
        }
      },
      {
        "n": {
          "identity": 94,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "喷托维林氯化铵糖浆"
          },
          "elementId": "94"
        }
      },
      {
        "n": {
          "identity": 95,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢克洛颗粒"
          },
          "elementId": "95"
        }
      },
      {
        "n": {
          "identity": 96,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硝酸益康唑乳膏"
          },
          "elementId": "96"
        }
      },
      {
        "n": {
          "identity": 97,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "转移因子口服溶液"
          },
          "elementId": "97"
        }
      },
      {
        "n": {
          "identity": 98,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用美洛西林钠舒巴坦钠"
          },
          "elementId": "98"
        }
      },
      {
        "n": {
          "identity": 99,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸左氧氟沙星胶囊"
          },
          "elementId": "99"
        }
      },
      {
        "n": {
          "identity": 100,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸克林霉素棕榈酸酯颗粒"
          },
          "elementId": "100"
        }
      },
      {
        "n": {
          "identity": 101,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硝酸咪康唑栓"
          },
          "elementId": "101"
        }
      },
      {
        "n": {
          "identity": 102,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "茶碱缓释胶囊"
          },
          "elementId": "102"
        }
      },
      {
        "n": {
          "identity": 103,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "甲硝唑维B6片"
          },
          "elementId": "103"
        }
      },
      {
        "n": {
          "identity": 104,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "联苯苄唑乳膏"
          },
          "elementId": "104"
        }
      },
      {
        "n": {
          "identity": 105,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "噻托溴铵粉雾剂"
          },
          "elementId": "105"
        }
      },
      {
        "n": {
          "identity": 106,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "茶碱缓释片"
          },
          "elementId": "106"
        }
      },
      {
        "n": {
          "identity": 107,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "头孢克肟分散片"
          },
          "elementId": "107"
        }
      },
      {
        "n": {
          "identity": 108,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸克林霉素棕榈酸酯分散片"
          },
          "elementId": "108"
        }
      },
      {
        "n": {
          "identity": 109,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "红霉素肠溶片"
          },
          "elementId": "109"
        }
      },
      {
        "n": {
          "identity": 110,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用盐酸氨溴索"
          },
          "elementId": "110"
        }
      },
      {
        "n": {
          "identity": 111,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "蛇胆川贝液"
          },
          "elementId": "111"
        }
      },
      {
        "n": {
          "identity": 112,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "云南花粉片"
          },
          "elementId": "112"
        }
      },
      {
        "n": {
          "identity": 113,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "依托红霉素片"
          },
          "elementId": "113"
        }
      },
      {
        "n": {
          "identity": 114,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "乙酰螺旋霉素片"
          },
          "elementId": "114"
        }
      },
      {
        "n": {
          "identity": 115,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "盐酸妥洛特罗片"
          },
          "elementId": "115"
        }
      },
      {
        "n": {
          "identity": 116,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "硫酸沙丁胺醇气雾剂"
          },
          "elementId": "116"
        }
      },
      {
        "n": {
          "identity": 117,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "诺氟沙星胶囊"
          },
          "elementId": "117"
        }
      },
      {
        "n": {
          "identity": 118,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "酮康唑乳膏"
          },
          "elementId": "118"
        }
      },
      {
        "n": {
          "identity": 119,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "通宣理肺丸"
          },
          "elementId": "119"
        }
      },
      {
        "n": {
          "identity": 120,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "注射用布美他尼"
          },
          "elementId": "120"
        }
      },
      {
        "n": {
          "identity": 121,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "阿奇霉素胶囊"
          },
          "elementId": "121"
        }
      },
      {
        "n": {
          "identity": 122,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "如意定喘丸"
          },
          "elementId": "122"
        }
      },
      {
        "n": {
          "identity": 123,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "麦迪霉素片"
          },
          "elementId": "123"
        }
      },
      {
        "n": {
          "identity": 124,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "复方蛤青胶囊"
          },
          "elementId": "124"
        }
      },
      {
        "n": {
          "identity": 125,
          "labels": [
            "Drug"
          ],
          "properties": {
            "name": "小青龙颗粒"
          },
          "elementId": "125"
        }
      },
      {
        "n": {
          "identity": 126,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鹿肉"
          },
          "elementId": "126"
        }
      },
      {
        "n": {
          "identity": 127,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "香菜"
          },
          "elementId": "127"
        }
      },
      {
        "n": {
          "identity": 128,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "肉松"
          },
          "elementId": "128"
        }
      },
      {
        "n": {
          "identity": 129,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄芹菜汁"
          },
          "elementId": "129"
        }
      },
      {
        "n": {
          "identity": 130,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合双耳鸡蛋羹"
          },
          "elementId": "130"
        }
      },
      {
        "n": {
          "identity": 131,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合粥"
          },
          "elementId": "131"
        }
      },
      {
        "n": {
          "identity": 132,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "糖醋草鱼"
          },
          "elementId": "132"
        }
      },
      {
        "n": {
          "identity": 133,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "银耳粥"
          },
          "elementId": "133"
        }
      },
      {
        "n": {
          "identity": 134,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "带鱼"
          },
          "elementId": "134"
        }
      },
      {
        "n": {
          "identity": 135,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "海虾"
          },
          "elementId": "135"
        }
      },
      {
        "n": {
          "identity": 136,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "奶油"
          },
          "elementId": "136"
        }
      },
      {
        "n": {
          "identity": 137,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "羊腩萝卜丝粥"
          },
          "elementId": "137"
        }
      },
      {
        "n": {
          "identity": 138,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "冬菇烧白菜"
          },
          "elementId": "138"
        }
      },
      {
        "n": {
          "identity": 139,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "大豆"
          },
          "elementId": "139"
        }
      },
      {
        "n": {
          "identity": 140,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "花生杏仁粥"
          },
          "elementId": "140"
        }
      },
      {
        "n": {
          "identity": 141,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "竹笋"
          },
          "elementId": "141"
        }
      },
      {
        "n": {
          "identity": 142,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄汁"
          },
          "elementId": "142"
        }
      },
      {
        "n": {
          "identity": 143,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "杏仁"
          },
          "elementId": "143"
        }
      },
      {
        "n": {
          "identity": 144,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "蔬菜杂烩粥"
          },
          "elementId": "144"
        }
      },
      {
        "n": {
          "identity": 145,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "川贝酿梨"
          },
          "elementId": "145"
        }
      },
      {
        "n": {
          "identity": 146,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "小黄瓜西瓜汁"
          },
          "elementId": "146"
        }
      },
      {
        "n": {
          "identity": 147,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "山楂桑椹粥"
          },
          "elementId": "147"
        }
      },
      {
        "n": {
          "identity": 148,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "瓜粒杂锦汤"
          },
          "elementId": "148"
        }
      },
      {
        "n": {
          "identity": 149,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "啤酒"
          },
          "elementId": "149"
        }
      },
      {
        "n": {
          "identity": 150,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "辣椒(红、尖、干)"
          },
          "elementId": "150"
        }
      },
      {
        "n": {
          "identity": 151,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "五丝白菜卷"
          },
          "elementId": "151"
        }
      },
      {
        "n": {
          "identity": 152,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "豆腐干炒韭菜"
          },
          "elementId": "152"
        }
      },
      {
        "n": {
          "identity": 153,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "山楂乌梅饮"
          },
          "elementId": "153"
        }
      },
      {
        "n": {
          "identity": 154,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "辣椒(青、尖)"
          },
          "elementId": "154"
        }
      },
      {
        "n": {
          "identity": 155,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "豆浆"
          },
          "elementId": "155"
        }
      },
      {
        "n": {
          "identity": 156,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "黄瓜拌豆腐丝"
          },
          "elementId": "156"
        }
      },
      {
        "n": {
          "identity": 157,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "生姜乌梅饮"
          },
          "elementId": "157"
        }
      },
      {
        "n": {
          "identity": 158,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "炖白鲢鱼"
          },
          "elementId": "158"
        }
      },
      {
        "n": {
          "identity": 159,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "凉拌莲藕"
          },
          "elementId": "159"
        }
      },
      {
        "n": {
          "identity": 160,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "薏米莲子粥"
          },
          "elementId": "160"
        }
      },
      {
        "n": {
          "identity": 161,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "狗肉"
          },
          "elementId": "161"
        }
      },
      {
        "n": {
          "identity": 162,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "海螺"
          },
          "elementId": "162"
        }
      },
      {
        "n": {
          "identity": 163,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "北杏炖雪梨"
          },
          "elementId": "163"
        }
      },
      {
        "n": {
          "identity": 164,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "锅塌番茄"
          },
          "elementId": "164"
        }
      },
      {
        "n": {
          "identity": 165,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鲫鱼"
          },
          "elementId": "165"
        }
      },
      {
        "n": {
          "identity": 166,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "绿豆南瓜汤"
          },
          "elementId": "166"
        }
      },
      {
        "n": {
          "identity": 167,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合汁"
          },
          "elementId": "167"
        }
      },
      {
        "n": {
          "identity": 168,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "排骨汤"
          },
          "elementId": "168"
        }
      },
      {
        "n": {
          "identity": 169,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄牛肉"
          },
          "elementId": "169"
        }
      },
      {
        "n": {
          "identity": 170,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "泡莲藕"
          },
          "elementId": "170"
        }
      },
      {
        "n": {
          "identity": 171,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "白酒"
          },
          "elementId": "171"
        }
      },
      {
        "n": {
          "identity": 172,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "猪肉(肥瘦)"
          },
          "elementId": "172"
        }
      },
      {
        "n": {
          "identity": 173,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鸭梨粥"
          },
          "elementId": "173"
        }
      },
      {
        "n": {
          "identity": 174,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "肉末冬瓜"
          },
          "elementId": "174"
        }
      },
      {
        "n": {
          "identity": 175,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "生芦根粥"
          },
          "elementId": "175"
        }
      },
      {
        "n": {
          "identity": 176,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "猪肉(瘦)"
          },
          "elementId": "176"
        }
      },
      {
        "n": {
          "identity": 177,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "空心菜"
          },
          "elementId": "177"
        }
      },
      {
        "n": {
          "identity": 178,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "樱桃番茄"
          },
          "elementId": "178"
        }
      },
      {
        "n": {
          "identity": 179,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "首乌百合粥"
          },
          "elementId": "179"
        }
      },
      {
        "n": {
          "identity": 180,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鲜百合烧肉"
          },
          "elementId": "180"
        }
      },
      {
        "n": {
          "identity": 181,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "海蚌"
          },
          "elementId": "181"
        }
      },
      {
        "n": {
          "identity": 182,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "凉拌番茄"
          },
          "elementId": "182"
        }
      },
      {
        "n": {
          "identity": 183,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鲤鱼"
          },
          "elementId": "183"
        }
      },
      {
        "n": {
          "identity": 184,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "咖啡"
          },
          "elementId": "184"
        }
      },
      {
        "n": {
          "identity": 185,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鲈鱼"
          },
          "elementId": "185"
        }
      },
      {
        "n": {
          "identity": 186,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "素炒小白菜"
          },
          "elementId": "186"
        }
      },
      {
        "n": {
          "identity": 187,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "豆薯小米粥"
          },
          "elementId": "187"
        }
      },
      {
        "n": {
          "identity": 188,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄羊肉蛋花汤"
          },
          "elementId": "188"
        }
      },
      {
        "n": {
          "identity": 189,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "生菜"
          },
          "elementId": "189"
        }
      },
      {
        "n": {
          "identity": 190,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "椰子银耳煲鸽汤"
          },
          "elementId": "190"
        }
      },
      {
        "n": {
          "identity": 191,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "油麦菜"
          },
          "elementId": "191"
        }
      },
      {
        "n": {
          "identity": 192,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "核桃"
          },
          "elementId": "192"
        }
      },
      {
        "n": {
          "identity": 193,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "紫苏粥"
          },
          "elementId": "193"
        }
      },
      {
        "n": {
          "identity": 194,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄牛肉片"
          },
          "elementId": "194"
        }
      },
      {
        "n": {
          "identity": 195,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "乌梅粥"
          },
          "elementId": "195"
        }
      },
      {
        "n": {
          "identity": 196,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "红枣银耳粥"
          },
          "elementId": "196"
        }
      },
      {
        "n": {
          "identity": 197,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合汤"
          },
          "elementId": "197"
        }
      },
      {
        "n": {
          "identity": 198,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "苦瓜"
          },
          "elementId": "198"
        }
      },
      {
        "n": {
          "identity": 199,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鲢鱼"
          },
          "elementId": "199"
        }
      },
      {
        "n": {
          "identity": 200,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "山楂百合汤"
          },
          "elementId": "200"
        }
      },
      {
        "n": {
          "identity": 201,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "圆白菜"
          },
          "elementId": "201"
        }
      },
      {
        "n": {
          "identity": 202,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "山药"
          },
          "elementId": "202"
        }
      },
      {
        "n": {
          "identity": 203,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鸡蛋木耳粥"
          },
          "elementId": "203"
        }
      },
      {
        "n": {
          "identity": 204,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "水萝卜丝拌白菜"
          },
          "elementId": "204"
        }
      },
      {
        "n": {
          "identity": 205,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄苹果芝麻蜜"
          },
          "elementId": "205"
        }
      },
      {
        "n": {
          "identity": 206,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "韭菜"
          },
          "elementId": "206"
        }
      },
      {
        "n": {
          "identity": 207,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "栗子（熟）"
          },
          "elementId": "207"
        }
      },
      {
        "n": {
          "identity": 208,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鸡"
          },
          "elementId": "208"
        }
      },
      {
        "n": {
          "identity": 209,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "小白菜"
          },
          "elementId": "209"
        }
      },
      {
        "n": {
          "identity": 210,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄西米粥"
          },
          "elementId": "210"
        }
      },
      {
        "n": {
          "identity": 211,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鱼腥草"
          },
          "elementId": "211"
        }
      },
      {
        "n": {
          "identity": 212,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "山楂糕"
          },
          "elementId": "212"
        }
      },
      {
        "n": {
          "identity": 213,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "小黄瓜凉拌面"
          },
          "elementId": "213"
        }
      },
      {
        "n": {
          "identity": 214,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄"
          },
          "elementId": "214"
        }
      },
      {
        "n": {
          "identity": 215,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄三素"
          },
          "elementId": "215"
        }
      },
      {
        "n": {
          "identity": 216,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合炖猪蹄"
          },
          "elementId": "216"
        }
      },
      {
        "n": {
          "identity": 217,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "茭白"
          },
          "elementId": "217"
        }
      },
      {
        "n": {
          "identity": 218,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "白菜蛋花粥"
          },
          "elementId": "218"
        }
      },
      {
        "n": {
          "identity": 219,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "赤贝"
          },
          "elementId": "219"
        }
      },
      {
        "n": {
          "identity": 220,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "小麦粥"
          },
          "elementId": "220"
        }
      },
      {
        "n": {
          "identity": 221,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合糖粥"
          },
          "elementId": "221"
        }
      },
      {
        "n": {
          "identity": 222,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "杂粮粥"
          },
          "elementId": "222"
        }
      },
      {
        "n": {
          "identity": 223,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "水萝卜拌黄瓜"
          },
          "elementId": "223"
        }
      },
      {
        "n": {
          "identity": 224,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄皮蛋汤"
          },
          "elementId": "224"
        }
      },
      {
        "n": {
          "identity": 225,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "油菜"
          },
          "elementId": "225"
        }
      },
      {
        "n": {
          "identity": 226,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "清蒸鸡蛋羹"
          },
          "elementId": "226"
        }
      },
      {
        "n": {
          "identity": 227,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "玉竹白菜"
          },
          "elementId": "227"
        }
      },
      {
        "n": {
          "identity": 228,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄羊肉汤"
          },
          "elementId": "228"
        }
      },
      {
        "n": {
          "identity": 229,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "黄瓜三丝汤"
          },
          "elementId": "229"
        }
      },
      {
        "n": {
          "identity": 230,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "大蒜"
          },
          "elementId": "230"
        }
      },
      {
        "n": {
          "identity": 231,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "莲子"
          },
          "elementId": "231"
        }
      },
      {
        "n": {
          "identity": 232,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "荞麦粥"
          },
          "elementId": "232"
        }
      },
      {
        "n": {
          "identity": 233,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "南瓜"
          },
          "elementId": "233"
        }
      },
      {
        "n": {
          "identity": 234,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "羊肉(瘦)"
          },
          "elementId": "234"
        }
      },
      {
        "n": {
          "identity": 235,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鲜芦根粥"
          },
          "elementId": "235"
        }
      },
      {
        "n": {
          "identity": 236,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "山楂红糖粥"
          },
          "elementId": "236"
        }
      },
      {
        "n": {
          "identity": 237,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "冬瓜草鱼汤"
          },
          "elementId": "237"
        }
      },
      {
        "n": {
          "identity": 238,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "珊瑚白菜墩"
          },
          "elementId": "238"
        }
      },
      {
        "n": {
          "identity": 239,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "松子仁"
          },
          "elementId": "239"
        }
      },
      {
        "n": {
          "identity": 240,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "黄芪粥"
          },
          "elementId": "240"
        }
      },
      {
        "n": {
          "identity": 241,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "黄瓜拌兔丝"
          },
          "elementId": "241"
        }
      },
      {
        "n": {
          "identity": 242,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄鸡蛋煎饼"
          },
          "elementId": "242"
        }
      },
      {
        "n": {
          "identity": 243,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "黄瓜拌香菜"
          },
          "elementId": "243"
        }
      },
      {
        "n": {
          "identity": 244,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "红烧鲢鱼"
          },
          "elementId": "244"
        }
      },
      {
        "n": {
          "identity": 245,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "拌肚丝白菜"
          },
          "elementId": "245"
        }
      },
      {
        "n": {
          "identity": 246,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "虾皮香芹燕麦粥"
          },
          "elementId": "246"
        }
      },
      {
        "n": {
          "identity": 247,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "萝卜豆腐汤"
          },
          "elementId": "247"
        }
      },
      {
        "n": {
          "identity": 248,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "番茄猪肝瘦肉汤"
          },
          "elementId": "248"
        }
      },
      {
        "n": {
          "identity": 249,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合炒芦笋"
          },
          "elementId": "249"
        }
      },
      {
        "n": {
          "identity": 250,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "南瓜子仁"
          },
          "elementId": "250"
        }
      },
      {
        "n": {
          "identity": 251,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "牛奶玉米汤"
          },
          "elementId": "251"
        }
      },
      {
        "n": {
          "identity": 252,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "螃蟹"
          },
          "elementId": "252"
        }
      },
      {
        "n": {
          "identity": 253,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "黄瓜拌皮丝"
          },
          "elementId": "253"
        }
      },
      {
        "n": {
          "identity": 254,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "海蟹"
          },
          "elementId": "254"
        }
      },
      {
        "n": {
          "identity": 255,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鸡蛋"
          },
          "elementId": "255"
        }
      },
      {
        "n": {
          "identity": 256,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鸡肝"
          },
          "elementId": "256"
        }
      },
      {
        "n": {
          "identity": 257,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "酱豆腐汁烧猪肉"
          },
          "elementId": "257"
        }
      },
      {
        "n": {
          "identity": 258,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "薏仁党参粥"
          },
          "elementId": "258"
        }
      },
      {
        "n": {
          "identity": 259,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "茄子"
          },
          "elementId": "259"
        }
      },
      {
        "n": {
          "identity": 260,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "鸡蛋清"
          },
          "elementId": "260"
        }
      },
      {
        "n": {
          "identity": 261,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "三鲜冬瓜汤"
          },
          "elementId": "261"
        }
      },
      {
        "n": {
          "identity": 262,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "雪梨饮"
          },
          "elementId": "262"
        }
      },
      {
        "n": {
          "identity": 263,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "百合花生汤"
          },
          "elementId": "263"
        }
      },
      {
        "n": {
          "identity": 264,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "菊花芦根茶"
          },
          "elementId": "264"
        }
      },
      {
        "n": {
          "identity": 265,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "党参粥"
          },
          "elementId": "265"
        }
      },
      {
        "n": {
          "identity": 266,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "海参（水浸）"
          },
          "elementId": "266"
        }
      },
      {
        "n": {
          "identity": 267,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "洋葱"
          },
          "elementId": "267"
        }
      },
      {
        "n": {
          "identity": 268,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "罗汉果雪耳鸡汤"
          },
          "elementId": "268"
        }
      },
      {
        "n": {
          "identity": 269,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "冰糖银耳羹"
          },
          "elementId": "269"
        }
      },
      {
        "n": {
          "identity": 270,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "奶汤锅子鱼"
          },
          "elementId": "270"
        }
      },
      {
        "n": {
          "identity": 271,
          "labels": [
            "Food"
          ],
          "properties": {
            "name": "意式番茄牛肉凉面"
          },
          "elementId": "271"
        }
      },
      {
        "n": {
          "identity": 272,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "支气管镜检查"
          },
          "elementId": "272"
        }
      },
      {
        "n": {
          "identity": 273,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "抗链球菌型M蛋白抗体"
          },
          "elementId": "273"
        }
      },
      {
        "n": {
          "identity": 274,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "耳、鼻、咽拭子细菌培养"
          },
          "elementId": "274"
        }
      },
      {
        "n": {
          "identity": 275,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "心电图"
          },
          "elementId": "275"
        }
      },
      {
        "n": {
          "identity": 276,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "胸部CT检查"
          },
          "elementId": "276"
        }
      },
      {
        "n": {
          "identity": 277,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "脑电图检查"
          },
          "elementId": "277"
        }
      },
      {
        "n": {
          "identity": 278,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "心肺功能运动试验（CPET）"
          },
          "elementId": "278"
        }
      },
      {
        "n": {
          "identity": 279,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "眼底荧光血管造影"
          },
          "elementId": "279"
        }
      },
      {
        "n": {
          "identity": 280,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "残气量／肺总量比值（RV/TLC）"
          },
          "elementId": "280"
        }
      },
      {
        "n": {
          "identity": 281,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺活量体重指数"
          },
          "elementId": "281"
        }
      },
      {
        "n": {
          "identity": 282,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺活检"
          },
          "elementId": "282"
        }
      },
      {
        "n": {
          "identity": 283,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "周围血白细胞计数及分类检验"
          },
          "elementId": "283"
        }
      },
      {
        "n": {
          "identity": 284,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "骨髓象分析"
          },
          "elementId": "284"
        }
      },
      {
        "n": {
          "identity": 285,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "先令氏指数"
          },
          "elementId": "285"
        }
      },
      {
        "n": {
          "identity": 286,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "血浆蛋白C抗原"
          },
          "elementId": "286"
        }
      },
      {
        "n": {
          "identity": 287,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "小白鼠毒力试验"
          },
          "elementId": "287"
        }
      },
      {
        "n": {
          "identity": 288,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰液细菌涂片检查"
          },
          "elementId": "288"
        }
      },
      {
        "n": {
          "identity": 289,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰液病原体检查"
          },
          "elementId": "289"
        }
      },
      {
        "n": {
          "identity": 290,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "纤维支气管镜检查"
          },
          "elementId": "290"
        }
      },
      {
        "n": {
          "identity": 291,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺和胸膜听诊"
          },
          "elementId": "291"
        }
      },
      {
        "n": {
          "identity": 292,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "血常规"
          },
          "elementId": "292"
        }
      },
      {
        "n": {
          "identity": 293,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "通气与血流灌注比值（V/Q）"
          },
          "elementId": "293"
        }
      },
      {
        "n": {
          "identity": 294,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "最大呼气流量-容积曲线（MEFV）"
          },
          "elementId": "294"
        }
      },
      {
        "n": {
          "identity": 295,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "酶联免疫吸附试验"
          },
          "elementId": "295"
        }
      },
      {
        "n": {
          "identity": 296,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "支气管造影"
          },
          "elementId": "296"
        }
      },
      {
        "n": {
          "identity": 297,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺容量测定"
          },
          "elementId": "297"
        }
      },
      {
        "n": {
          "identity": 298,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺泡气-动脉血氧分压差"
          },
          "elementId": "298"
        }
      },
      {
        "n": {
          "identity": 299,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺量计检测"
          },
          "elementId": "299"
        }
      },
      {
        "n": {
          "identity": 300,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺活量（VC）"
          },
          "elementId": "300"
        }
      },
      {
        "n": {
          "identity": 301,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰液细菌培养"
          },
          "elementId": "301"
        }
      },
      {
        "n": {
          "identity": 302,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "抗链球菌壁多糖抗体"
          },
          "elementId": "302"
        }
      },
      {
        "n": {
          "identity": 303,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰培养"
          },
          "elementId": "303"
        }
      },
      {
        "n": {
          "identity": 304,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺功能检查"
          },
          "elementId": "304"
        }
      },
      {
        "n": {
          "identity": 305,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "呼吸肌功能测定"
          },
          "elementId": "305"
        }
      },
      {
        "n": {
          "identity": 306,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰液中寄生虫和虫卵"
          },
          "elementId": "306"
        }
      },
      {
        "n": {
          "identity": 307,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "尿常规"
          },
          "elementId": "307"
        }
      },
      {
        "n": {
          "identity": 308,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肾功能检查"
          },
          "elementId": "308"
        }
      },
      {
        "n": {
          "identity": 309,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "隐血试验与含铁血黄素检查"
          },
          "elementId": "309"
        }
      },
      {
        "n": {
          "identity": 310,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺部检查"
          },
          "elementId": "310"
        }
      },
      {
        "n": {
          "identity": 311,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "免疫电泳"
          },
          "elementId": "311"
        }
      },
      {
        "n": {
          "identity": 312,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "深吸气量（IC）"
          },
          "elementId": "312"
        }
      },
      {
        "n": {
          "identity": 313,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "一秒用力呼出量／用力肺活量比值"
          },
          "elementId": "313"
        }
      },
      {
        "n": {
          "identity": 314,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "CT检查"
          },
          "elementId": "314"
        }
      },
      {
        "n": {
          "identity": 315,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "胸部透视"
          },
          "elementId": "315"
        }
      },
      {
        "n": {
          "identity": 316,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "尿液镜检法"
          },
          "elementId": "316"
        }
      },
      {
        "n": {
          "identity": 317,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰液中细胞分类"
          },
          "elementId": "317"
        }
      },
      {
        "n": {
          "identity": 318,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "无效腔气量／潮气量比值"
          },
          "elementId": "318"
        }
      },
      {
        "n": {
          "identity": 319,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "胸部平片"
          },
          "elementId": "319"
        }
      },
      {
        "n": {
          "identity": 320,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肌电图"
          },
          "elementId": "320"
        }
      },
      {
        "n": {
          "identity": 321,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "神经系统检查"
          },
          "elementId": "321"
        }
      },
      {
        "n": {
          "identity": 322,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "白细胞分类计数"
          },
          "elementId": "322"
        }
      },
      {
        "n": {
          "identity": 323,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "Optochin敏感试验"
          },
          "elementId": "323"
        }
      },
      {
        "n": {
          "identity": 324,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "肺毛细血管楔压"
          },
          "elementId": "324"
        }
      },
      {
        "n": {
          "identity": 325,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "钼靶X线检查"
          },
          "elementId": "325"
        }
      },
      {
        "n": {
          "identity": 326,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "抗肾小球基底膜抗体测定（AGBM）"
          },
          "elementId": "326"
        }
      },
      {
        "n": {
          "identity": 327,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "痰液常规检查"
          },
          "elementId": "327"
        }
      },
      {
        "n": {
          "identity": 328,
          "labels": [
            "Check"
          ],
          "properties": {
            "name": "每分钟最大通气量（MVV）"
          },
          "elementId": "328"
        }
      },
      {
        "n": {
          "identity": 329,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "急诊科"
          },
          "elementId": "329"
        }
      },
      {
        "n": {
          "identity": 330,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "内科"
          },
          "elementId": "330"
        }
      },
      {
        "n": {
          "identity": 331,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "呼吸内科"
          },
          "elementId": "331"
        }
      },
      {
        "n": {
          "identity": 332,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "小儿内科"
          },
          "elementId": "332"
        }
      },
      {
        "n": {
          "identity": 333,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "儿科"
          },
          "elementId": "333"
        }
      },
      {
        "n": {
          "identity": 334,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "其他科室"
          },
          "elementId": "334"
        }
      },
      {
        "n": {
          "identity": 335,
          "labels": [
            "Department"
          ],
          "properties": {
            "name": "其他综合"
          },
          "elementId": "335"
        }
      },
      {
        "n": {
          "identity": 336,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海斯制药盐酸利多卡因注射液"
          },
          "elementId": "336"
        }
      },
      {
        "n": {
          "identity": 337,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "西藏甘露仁青芒觉"
          },
          "elementId": "337"
        }
      },
      {
        "n": {
          "identity": 338,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康良头孢拉定胶囊"
          },
          "elementId": "338"
        }
      },
      {
        "n": {
          "identity": 339,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "山西康宝人血白蛋白"
          },
          "elementId": "339"
        }
      },
      {
        "n": {
          "identity": 340,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "亚太药业盐酸克林霉素胶囊"
          },
          "elementId": "340"
        }
      },
      {
        "n": {
          "identity": 341,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东药替硝唑片"
          },
          "elementId": "341"
        }
      },
      {
        "n": {
          "identity": 342,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "鲁抗麦迪霉素片"
          },
          "elementId": "342"
        }
      },
      {
        "n": {
          "identity": 343,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "复旦复华雷公藤多苷片"
          },
          "elementId": "343"
        }
      },
      {
        "n": {
          "identity": 344,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "桂林南药布美他尼片"
          },
          "elementId": "344"
        }
      },
      {
        "n": {
          "identity": 345,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "苏肽生"
          },
          "elementId": "345"
        }
      },
      {
        "n": {
          "identity": 346,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "白敬宇制药氨茶碱片"
          },
          "elementId": "346"
        }
      },
      {
        "n": {
          "identity": 347,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "中国大冢盐酸利多卡因注射液"
          },
          "elementId": "347"
        }
      },
      {
        "n": {
          "identity": 348,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "宜昌人福盐酸克林霉素胶囊"
          },
          "elementId": "348"
        }
      },
      {
        "n": {
          "identity": 349,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "俞氏阿奇霉素颗粒"
          },
          "elementId": "349"
        }
      },
      {
        "n": {
          "identity": 350,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "利君沙"
          },
          "elementId": "350"
        }
      },
      {
        "n": {
          "identity": 351,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "圣大（张家口）头孢氨苄甲氧"
          },
          "elementId": "351"
        }
      },
      {
        "n": {
          "identity": 352,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "首儿药厂小青龙颗粒"
          },
          "elementId": "352"
        }
      },
      {
        "n": {
          "identity": 353,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "汇仁药业阿奇霉素片"
          },
          "elementId": "353"
        }
      },
      {
        "n": {
          "identity": 354,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "得恩德制药雷公藤多苷片"
          },
          "elementId": "354"
        }
      },
      {
        "n": {
          "identity": 355,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "比利时辉瑞注射用甲泼尼龙琥"
          },
          "elementId": "355"
        }
      },
      {
        "n": {
          "identity": 356,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "仁和药业盐酸克林霉素胶囊"
          },
          "elementId": "356"
        }
      },
      {
        "n": {
          "identity": 357,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "一品红盐酸克林霉素棕榈酸酯"
          },
          "elementId": "357"
        }
      },
      {
        "n": {
          "identity": 358,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "广东卫伦人血白蛋白"
          },
          "elementId": "358"
        }
      },
      {
        "n": {
          "identity": 359,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "广西灵峰药业蛇胆川贝液"
          },
          "elementId": "359"
        }
      },
      {
        "n": {
          "identity": 360,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康正药业硝酸咪康唑乳膏"
          },
          "elementId": "360"
        }
      },
      {
        "n": {
          "identity": 361,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "湘江药业阿奇霉素颗粒"
          },
          "elementId": "361"
        }
      },
      {
        "n": {
          "identity": 362,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "邦琪药业百咳静糖浆"
          },
          "elementId": "362"
        }
      },
      {
        "n": {
          "identity": 363,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "黄河药业盐酸克林霉素胶囊"
          },
          "elementId": "363"
        }
      },
      {
        "n": {
          "identity": 364,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "博康健制药盐酸氨溴索葡萄糖"
          },
          "elementId": "364"
        }
      },
      {
        "n": {
          "identity": 365,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "吉春制药祛痰止咳胶囊"
          },
          "elementId": "365"
        }
      },
      {
        "n": {
          "identity": 366,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "安必君氨苄西林胶囊"
          },
          "elementId": "366"
        }
      },
      {
        "n": {
          "identity": 367,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "石药欧意诺氟沙星胶囊"
          },
          "elementId": "367"
        }
      },
      {
        "n": {
          "identity": 368,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康美药业诺氟沙星胶囊"
          },
          "elementId": "368"
        }
      },
      {
        "n": {
          "identity": 369,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北京中新制药琥乙红霉素片"
          },
          "elementId": "369"
        }
      },
      {
        "n": {
          "identity": 370,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "蓉生药业人血白蛋白"
          },
          "elementId": "370"
        }
      },
      {
        "n": {
          "identity": 371,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "天津力生制药硫酸沙丁胺醇片"
          },
          "elementId": "371"
        }
      },
      {
        "n": {
          "identity": 372,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "哈药总厂注射用磺苄西林钠"
          },
          "elementId": "372"
        }
      },
      {
        "n": {
          "identity": 373,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "金路捷"
          },
          "elementId": "373"
        }
      },
      {
        "n": {
          "identity": 374,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "锦华药业盐酸克林霉素胶囊"
          },
          "elementId": "374"
        }
      },
      {
        "n": {
          "identity": 375,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "希舒美"
          },
          "elementId": "375"
        }
      },
      {
        "n": {
          "identity": 376,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "鲁抗注射用头孢唑林钠"
          },
          "elementId": "376"
        }
      },
      {
        "n": {
          "identity": 377,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "白云山天心地塞米松磷酸钠注"
          },
          "elementId": "377"
        }
      },
      {
        "n": {
          "identity": 378,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "济安堂蛇胆川贝液"
          },
          "elementId": "378"
        }
      },
      {
        "n": {
          "identity": 379,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "运佳黄浦硝酸咪康唑乳膏"
          },
          "elementId": "379"
        }
      },
      {
        "n": {
          "identity": 380,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "山西云鹏制药氨茶碱片"
          },
          "elementId": "380"
        }
      },
      {
        "n": {
          "identity": 381,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "丽珠奇乐"
          },
          "elementId": "381"
        }
      },
      {
        "n": {
          "identity": 382,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "美扶"
          },
          "elementId": "382"
        }
      },
      {
        "n": {
          "identity": 383,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "江苏长江阿奇霉素胶囊"
          },
          "elementId": "383"
        }
      },
      {
        "n": {
          "identity": 384,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "锦华药业诺氟沙星胶囊"
          },
          "elementId": "384"
        }
      },
      {
        "n": {
          "identity": 385,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "河南羚锐制药盐酸克林霉素胶"
          },
          "elementId": "385"
        }
      },
      {
        "n": {
          "identity": 386,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "鲁抗赛特替硝唑片"
          },
          "elementId": "386"
        }
      },
      {
        "n": {
          "identity": 387,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "鲁抗阿莫西林颗粒"
          },
          "elementId": "387"
        }
      },
      {
        "n": {
          "identity": 388,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "辽宁海思科注射用甲泼尼龙琥"
          },
          "elementId": "388"
        }
      },
      {
        "n": {
          "identity": 389,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "银力舒"
          },
          "elementId": "389"
        }
      },
      {
        "n": {
          "identity": 390,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "搏沃欣"
          },
          "elementId": "390"
        }
      },
      {
        "n": {
          "identity": 391,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "莱士人血白蛋白"
          },
          "elementId": "391"
        }
      },
      {
        "n": {
          "identity": 392,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "广春药业盐酸氨溴索葡萄糖注"
          },
          "elementId": "392"
        }
      },
      {
        "n": {
          "identity": 393,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "国医堂制药如意定喘丸"
          },
          "elementId": "393"
        }
      },
      {
        "n": {
          "identity": 394,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "平光制药红霉素肠溶片"
          },
          "elementId": "394"
        }
      },
      {
        "n": {
          "identity": 395,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "安诺药业阿奇霉素分散片"
          },
          "elementId": "395"
        }
      },
      {
        "n": {
          "identity": 396,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "旺龙药业琥乙红霉素颗粒"
          },
          "elementId": "396"
        }
      },
      {
        "n": {
          "identity": 397,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "金耀药业地塞米松磷酸钠注射"
          },
          "elementId": "397"
        }
      },
      {
        "n": {
          "identity": 398,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "环科药业甲硝唑片"
          },
          "elementId": "398"
        }
      },
      {
        "n": {
          "identity": 399,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "埃斯玛隆"
          },
          "elementId": "399"
        }
      },
      {
        "n": {
          "identity": 400,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "六安华源制药盐酸氨溴索葡萄"
          },
          "elementId": "400"
        }
      },
      {
        "n": {
          "identity": 401,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "注射用磺苄西林钠"
          },
          "elementId": "401"
        }
      },
      {
        "n": {
          "identity": 402,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "雄巴拉曲神水十一味金色丸"
          },
          "elementId": "402"
        }
      },
      {
        "n": {
          "identity": 403,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "达发新"
          },
          "elementId": "403"
        }
      },
      {
        "n": {
          "identity": 404,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "利君制药阿奇霉素分散片"
          },
          "elementId": "404"
        }
      },
      {
        "n": {
          "identity": 405,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "智同生物注射用盐酸溴己新"
          },
          "elementId": "405"
        }
      },
      {
        "n": {
          "identity": 406,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "亚宝药业甲硝唑片"
          },
          "elementId": "406"
        }
      },
      {
        "n": {
          "identity": 407,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "黑龙江天龙药业联苯苄唑乳膏"
          },
          "elementId": "407"
        }
      },
      {
        "n": {
          "identity": 408,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "龙泰制药化痰平喘片"
          },
          "elementId": "408"
        }
      },
      {
        "n": {
          "identity": 409,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北京京丰制药集团诺氟沙星胶"
          },
          "elementId": "409"
        }
      },
      {
        "n": {
          "identity": 410,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "泰邦生物人血白蛋白"
          },
          "elementId": "410"
        }
      },
      {
        "n": {
          "identity": 411,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "吉春制药硝酸咪康唑乳膏"
          },
          "elementId": "411"
        }
      },
      {
        "n": {
          "identity": 412,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "华中药业甲硝唑片"
          },
          "elementId": "412"
        }
      },
      {
        "n": {
          "identity": 413,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北京曙光药业红霉素肠溶片"
          },
          "elementId": "413"
        }
      },
      {
        "n": {
          "identity": 414,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "台城制药盐酸克林霉素胶囊"
          },
          "elementId": "414"
        }
      },
      {
        "n": {
          "identity": 415,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "复仙安"
          },
          "elementId": "415"
        }
      },
      {
        "n": {
          "identity": 416,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "博利康尼"
          },
          "elementId": "416"
        }
      },
      {
        "n": {
          "identity": 417,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "彼迪药业阿奇霉素分散片"
          },
          "elementId": "417"
        }
      },
      {
        "n": {
          "identity": 418,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北京益民药业盐酸利多卡因注"
          },
          "elementId": "418"
        }
      },
      {
        "n": {
          "identity": 419,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "伏枝"
          },
          "elementId": "419"
        }
      },
      {
        "n": {
          "identity": 420,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "金诃藏药大月晶丸"
          },
          "elementId": "420"
        }
      },
      {
        "n": {
          "identity": 421,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "丰原制药注射用盐酸溴己新"
          },
          "elementId": "421"
        }
      },
      {
        "n": {
          "identity": 422,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "亨瑞达制药甲硝唑片"
          },
          "elementId": "422"
        }
      },
      {
        "n": {
          "identity": 423,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "科伦药业盐酸克林霉素胶囊"
          },
          "elementId": "423"
        }
      },
      {
        "n": {
          "identity": 424,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "潜江制药阿奇霉素颗粒"
          },
          "elementId": "424"
        }
      },
      {
        "n": {
          "identity": 425,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "帮备"
          },
          "elementId": "425"
        }
      },
      {
        "n": {
          "identity": 426,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "汉森制药甲硝唑片"
          },
          "elementId": "426"
        }
      },
      {
        "n": {
          "identity": 427,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "甲强龙"
          },
          "elementId": "427"
        }
      },
      {
        "n": {
          "identity": 428,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "石药欧意红霉素肠溶片"
          },
          "elementId": "428"
        }
      },
      {
        "n": {
          "identity": 429,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "盐酸利多卡因注射液"
          },
          "elementId": "429"
        }
      },
      {
        "n": {
          "identity": 430,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "纽兰药业小青龙颗粒"
          },
          "elementId": "430"
        }
      },
      {
        "n": {
          "identity": 431,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "德源生物人血白蛋白"
          },
          "elementId": "431"
        }
      },
      {
        "n": {
          "identity": 432,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "亮博"
          },
          "elementId": "432"
        }
      },
      {
        "n": {
          "identity": 433,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "彼迪药业替硝唑片"
          },
          "elementId": "433"
        }
      },
      {
        "n": {
          "identity": 434,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "尤金"
          },
          "elementId": "434"
        }
      },
      {
        "n": {
          "identity": 435,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东药盐酸克林霉素胶囊"
          },
          "elementId": "435"
        }
      },
      {
        "n": {
          "identity": 436,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "二天堂联苯苄唑乳膏"
          },
          "elementId": "436"
        }
      },
      {
        "n": {
          "identity": 437,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "迪沙药业克霉唑阴道片"
          },
          "elementId": "437"
        }
      },
      {
        "n": {
          "identity": 438,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "申优"
          },
          "elementId": "438"
        }
      },
      {
        "n": {
          "identity": 439,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "斯皮仁诺"
          },
          "elementId": "439"
        }
      },
      {
        "n": {
          "identity": 440,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "同济堂制药盐酸克林霉素胶囊"
          },
          "elementId": "440"
        }
      },
      {
        "n": {
          "identity": 441,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "大连天宇制药阿奇霉素胶囊"
          },
          "elementId": "441"
        }
      },
      {
        "n": {
          "identity": 442,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "辅仁药业阿奇霉素片"
          },
          "elementId": "442"
        }
      },
      {
        "n": {
          "identity": 443,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "白云山医药诺氟沙星胶囊"
          },
          "elementId": "443"
        }
      },
      {
        "n": {
          "identity": 444,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "远大医药黄石飞云制药雷公藤"
          },
          "elementId": "444"
        }
      },
      {
        "n": {
          "identity": 445,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "盐酸克林霉素胶囊"
          },
          "elementId": "445"
        }
      },
      {
        "n": {
          "identity": 446,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "衡阳紫光古汉硝酸益康唑乳膏"
          },
          "elementId": "446"
        }
      },
      {
        "n": {
          "identity": 447,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "潇然"
          },
          "elementId": "447"
        }
      },
      {
        "n": {
          "identity": 448,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "锋替新"
          },
          "elementId": "448"
        }
      },
      {
        "n": {
          "identity": 449,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "天方药业盐酸克林霉素胶囊"
          },
          "elementId": "449"
        }
      },
      {
        "n": {
          "identity": 450,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "江西诚志永丰蛇胆川贝液"
          },
          "elementId": "450"
        }
      },
      {
        "n": {
          "identity": 451,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "艾富西药业盐酸氨溴索葡萄糖"
          },
          "elementId": "451"
        }
      },
      {
        "n": {
          "identity": 452,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "傲群"
          },
          "elementId": "452"
        }
      },
      {
        "n": {
          "identity": 453,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "齐迈星"
          },
          "elementId": "453"
        }
      },
      {
        "n": {
          "identity": 454,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "万方制药肺气肿片"
          },
          "elementId": "454"
        }
      },
      {
        "n": {
          "identity": 455,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "头孢氨苄甲氧苄啶片"
          },
          "elementId": "455"
        }
      },
      {
        "n": {
          "identity": 456,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "兰花药业诺氟沙星胶囊"
          },
          "elementId": "456"
        }
      },
      {
        "n": {
          "identity": 457,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "达仁堂通宣理肺丸"
          },
          "elementId": "457"
        }
      },
      {
        "n": {
          "identity": 458,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "盛翔制药蛇胆川贝液"
          },
          "elementId": "458"
        }
      },
      {
        "n": {
          "identity": 459,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东信药业琥乙红霉素片"
          },
          "elementId": "459"
        }
      },
      {
        "n": {
          "identity": 460,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "润阳药业盐酸氨溴索葡萄糖注"
          },
          "elementId": "460"
        }
      },
      {
        "n": {
          "identity": 461,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海力制药替硝唑片"
          },
          "elementId": "461"
        }
      },
      {
        "n": {
          "identity": 462,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "央宗药业蒺藜药酒"
          },
          "elementId": "462"
        }
      },
      {
        "n": {
          "identity": 463,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "津华晖星甲硝唑片"
          },
          "elementId": "463"
        }
      },
      {
        "n": {
          "identity": 464,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "利君制药红霉素肠溶片"
          },
          "elementId": "464"
        }
      },
      {
        "n": {
          "identity": 465,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "赛乐欣"
          },
          "elementId": "465"
        }
      },
      {
        "n": {
          "identity": 466,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "新陇海药业雷公藤多苷片"
          },
          "elementId": "466"
        }
      },
      {
        "n": {
          "identity": 467,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "莎普爱思盐酸氨溴索葡萄糖注"
          },
          "elementId": "467"
        }
      },
      {
        "n": {
          "identity": 468,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "唐山红星硝酸咪康唑乳膏"
          },
          "elementId": "468"
        }
      },
      {
        "n": {
          "identity": 469,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "锦华药业氯霉素片"
          },
          "elementId": "469"
        }
      },
      {
        "n": {
          "identity": 470,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海王阿奇霉素片"
          },
          "elementId": "470"
        }
      },
      {
        "n": {
          "identity": 471,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "健生制药阿奇霉素分散片"
          },
          "elementId": "471"
        }
      },
      {
        "n": {
          "identity": 472,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康普药业盐酸克林霉素胶囊"
          },
          "elementId": "472"
        }
      },
      {
        "n": {
          "identity": 473,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "百利药业阿奇霉素颗粒"
          },
          "elementId": "473"
        }
      },
      {
        "n": {
          "identity": 474,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "诺健"
          },
          "elementId": "474"
        }
      },
      {
        "n": {
          "identity": 475,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "利民制药阿奇霉素胶囊"
          },
          "elementId": "475"
        }
      },
      {
        "n": {
          "identity": 476,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "惠普森穿心莲内酯片"
          },
          "elementId": "476"
        }
      },
      {
        "n": {
          "identity": 477,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "利君制药琥乙红霉素片"
          },
          "elementId": "477"
        }
      },
      {
        "n": {
          "identity": 478,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "福邦药业阿奇霉素胶囊"
          },
          "elementId": "478"
        }
      },
      {
        "n": {
          "identity": 479,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "新亚闵行盐酸克林霉素胶囊"
          },
          "elementId": "479"
        }
      },
      {
        "n": {
          "identity": 480,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "五洲通药业硝酸咪康唑乳膏"
          },
          "elementId": "480"
        }
      },
      {
        "n": {
          "identity": 481,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "曲靖药业白及颗粒"
          },
          "elementId": "481"
        }
      },
      {
        "n": {
          "identity": 482,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "达力芬"
          },
          "elementId": "482"
        }
      },
      {
        "n": {
          "identity": 483,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "国瑞琥乙红霉素片"
          },
          "elementId": "483"
        }
      },
      {
        "n": {
          "identity": 484,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "蜀阳药业人血白蛋白"
          },
          "elementId": "484"
        }
      },
      {
        "n": {
          "identity": 485,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "圣泰转移因子口服溶液"
          },
          "elementId": "485"
        }
      },
      {
        "n": {
          "identity": 486,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东新药业百咳静糖浆"
          },
          "elementId": "486"
        }
      },
      {
        "n": {
          "identity": 487,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "新亚注射用硫代硫酸钠"
          },
          "elementId": "487"
        }
      },
      {
        "n": {
          "identity": 488,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "万托林"
          },
          "elementId": "488"
        }
      },
      {
        "n": {
          "identity": 489,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "罗欣药业注射用盐酸氨溴索"
          },
          "elementId": "489"
        }
      },
      {
        "n": {
          "identity": 490,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "仙琚制药克霉唑阴道片"
          },
          "elementId": "490"
        }
      },
      {
        "n": {
          "identity": 491,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "浙江南洋药业阿奇霉素胶囊"
          },
          "elementId": "491"
        }
      },
      {
        "n": {
          "identity": 492,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "纽兰药业硝酸咪康唑栓"
          },
          "elementId": "492"
        }
      },
      {
        "n": {
          "identity": 493,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "仁和堂硫酸沙丁胺醇片"
          },
          "elementId": "493"
        }
      },
      {
        "n": {
          "identity": 494,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "白云山光华盐酸克林霉素胶囊"
          },
          "elementId": "494"
        }
      },
      {
        "n": {
          "identity": 495,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "倍佳"
          },
          "elementId": "495"
        }
      },
      {
        "n": {
          "identity": 496,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "诚信制药盐酸妥洛特罗片"
          },
          "elementId": "496"
        }
      },
      {
        "n": {
          "identity": 497,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "吉尔吉药业喘嗽宁片"
          },
          "elementId": "497"
        }
      },
      {
        "n": {
          "identity": 498,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "上海新亚头孢克肟分散片"
          },
          "elementId": "498"
        }
      },
      {
        "n": {
          "identity": 499,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "衡博来"
          },
          "elementId": "499"
        }
      },
      {
        "n": {
          "identity": 500,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "丽珠制药替硝唑片"
          },
          "elementId": "500"
        }
      },
      {
        "n": {
          "identity": 501,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "葵花药业得菲尔公司阿奇霉素"
          },
          "elementId": "501"
        }
      },
      {
        "n": {
          "identity": 502,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "广东环球制药茶碱缓释片"
          },
          "elementId": "502"
        }
      },
      {
        "n": {
          "identity": 503,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "安诺药业盐酸克林霉素胶囊"
          },
          "elementId": "503"
        }
      },
      {
        "n": {
          "identity": 504,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "太原药业甲硝唑片"
          },
          "elementId": "504"
        }
      },
      {
        "n": {
          "identity": 505,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "益佳清"
          },
          "elementId": "505"
        }
      },
      {
        "n": {
          "identity": 506,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "易坦静"
          },
          "elementId": "506"
        }
      },
      {
        "n": {
          "identity": 507,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东信药业蛇胆川贝液"
          },
          "elementId": "507"
        }
      },
      {
        "n": {
          "identity": 508,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "天津太平洋二羟丙茶碱片"
          },
          "elementId": "508"
        }
      },
      {
        "n": {
          "identity": 509,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "瑞阳制药注射用磺苄西林钠"
          },
          "elementId": "509"
        }
      },
      {
        "n": {
          "identity": 510,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "绿十字"
          },
          "elementId": "510"
        }
      },
      {
        "n": {
          "identity": 511,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "奇莫欣"
          },
          "elementId": "511"
        }
      },
      {
        "n": {
          "identity": 512,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "米乐松"
          },
          "elementId": "512"
        }
      },
      {
        "n": {
          "identity": 513,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "石药欧意枸橼酸喷托维林片"
          },
          "elementId": "513"
        }
      },
      {
        "n": {
          "identity": 514,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "罗欣药业注射用盐酸头孢替安"
          },
          "elementId": "514"
        }
      },
      {
        "n": {
          "identity": 515,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "华瑞联合制药头孢氨苄甲氧苄"
          },
          "elementId": "515"
        }
      },
      {
        "n": {
          "identity": 516,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "哈药总厂托西酸舒他西林胶囊"
          },
          "elementId": "516"
        }
      },
      {
        "n": {
          "identity": 517,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康美药业甲硝唑片"
          },
          "elementId": "517"
        }
      },
      {
        "n": {
          "identity": 518,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "新峰药业盐酸利多卡因注射液"
          },
          "elementId": "518"
        }
      },
      {
        "n": {
          "identity": 519,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "一品红注射用盐酸溴己新"
          },
          "elementId": "519"
        }
      },
      {
        "n": {
          "identity": 520,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "三维康"
          },
          "elementId": "520"
        }
      },
      {
        "n": {
          "identity": 521,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "晶珠藏药蛇胆川贝液"
          },
          "elementId": "521"
        }
      },
      {
        "n": {
          "identity": 522,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "普洛康裕天然药物雷公藤多苷"
          },
          "elementId": "522"
        }
      },
      {
        "n": {
          "identity": 523,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海力制药阿奇霉素颗粒"
          },
          "elementId": "523"
        }
      },
      {
        "n": {
          "identity": 524,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "永定制药百咳静糖浆"
          },
          "elementId": "524"
        }
      },
      {
        "n": {
          "identity": 525,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "佐今明百咳静糖浆"
          },
          "elementId": "525"
        }
      },
      {
        "n": {
          "identity": 526,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "武汉生物人血白蛋白"
          },
          "elementId": "526"
        }
      },
      {
        "n": {
          "identity": 527,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "西藏甘露十一味金色丸"
          },
          "elementId": "527"
        }
      },
      {
        "n": {
          "identity": 528,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "人血白蛋白"
          },
          "elementId": "528"
        }
      },
      {
        "n": {
          "identity": 529,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "欣得生"
          },
          "elementId": "529"
        }
      },
      {
        "n": {
          "identity": 530,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "欣匹特"
          },
          "elementId": "530"
        }
      },
      {
        "n": {
          "identity": 531,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "杭州民生药业盐酸克林霉素胶"
          },
          "elementId": "531"
        }
      },
      {
        "n": {
          "identity": 532,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海斯制药注射用盐酸溴己新"
          },
          "elementId": "532"
        }
      },
      {
        "n": {
          "identity": 533,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "鲁神乙酰螺旋霉素片"
          },
          "elementId": "533"
        }
      },
      {
        "n": {
          "identity": 534,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "广东华南依托红霉素片"
          },
          "elementId": "534"
        }
      },
      {
        "n": {
          "identity": 535,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "宜昌长江阿奇霉素分散片"
          },
          "elementId": "535"
        }
      },
      {
        "n": {
          "identity": 536,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东药阿奇霉素胶囊"
          },
          "elementId": "536"
        }
      },
      {
        "n": {
          "identity": 537,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "思力华"
          },
          "elementId": "537"
        }
      },
      {
        "n": {
          "identity": 538,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "白云山医药琥乙红霉素片"
          },
          "elementId": "538"
        }
      },
      {
        "n": {
          "identity": 539,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "全星制药注射用布美他尼"
          },
          "elementId": "539"
        }
      },
      {
        "n": {
          "identity": 540,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海鲸药业注射用盐酸溴己新"
          },
          "elementId": "540"
        }
      },
      {
        "n": {
          "identity": 541,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "赣南海欣转移因子口服溶液"
          },
          "elementId": "541"
        }
      },
      {
        "n": {
          "identity": 542,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "甲硝唑片"
          },
          "elementId": "542"
        }
      },
      {
        "n": {
          "identity": 543,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "开林"
          },
          "elementId": "543"
        }
      },
      {
        "n": {
          "identity": 544,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "恒安药业盐酸特比萘芬片"
          },
          "elementId": "544"
        }
      },
      {
        "n": {
          "identity": 545,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "天天乐药业蛇胆川贝液"
          },
          "elementId": "545"
        }
      },
      {
        "n": {
          "identity": 546,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "全星制药注射用盐酸头孢替安"
          },
          "elementId": "546"
        }
      },
      {
        "n": {
          "identity": 547,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "星斗药业盐酸克林霉素胶囊"
          },
          "elementId": "547"
        }
      },
      {
        "n": {
          "identity": 548,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北海阳光药业阿奇霉素颗粒"
          },
          "elementId": "548"
        }
      },
      {
        "n": {
          "identity": 549,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "珠海联邦头孢拉定胶囊"
          },
          "elementId": "549"
        }
      },
      {
        "n": {
          "identity": 550,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "金峰制药盐酸氨溴索葡萄糖注"
          },
          "elementId": "550"
        }
      },
      {
        "n": {
          "identity": 551,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "涟水制药地塞米松磷酸钠注射"
          },
          "elementId": "551"
        }
      },
      {
        "n": {
          "identity": 552,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "南光注射用甲泼尼龙琥珀酸钠"
          },
          "elementId": "552"
        }
      },
      {
        "n": {
          "identity": 553,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "七星山药业化痰平喘片"
          },
          "elementId": "553"
        }
      },
      {
        "n": {
          "identity": 554,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "萨兰欣"
          },
          "elementId": "554"
        }
      },
      {
        "n": {
          "identity": 555,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "注射用盐酸头孢替安"
          },
          "elementId": "555"
        }
      },
      {
        "n": {
          "identity": 556,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "云门药业头孢氨苄甲氧苄啶片"
          },
          "elementId": "556"
        }
      },
      {
        "n": {
          "identity": 557,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "恒益药业琥乙红霉素颗粒"
          },
          "elementId": "557"
        }
      },
      {
        "n": {
          "identity": 558,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "白云山光华头孢氨苄甲氧苄啶"
          },
          "elementId": "558"
        }
      },
      {
        "n": {
          "identity": 559,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "遂成药业地塞米松磷酸钠注射"
          },
          "elementId": "559"
        }
      },
      {
        "n": {
          "identity": 560,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "云南白药云南花粉片"
          },
          "elementId": "560"
        }
      },
      {
        "n": {
          "identity": 561,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "湖南九典制药盐酸班布特罗胶"
          },
          "elementId": "561"
        }
      },
      {
        "n": {
          "identity": 562,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "皇隆制药注射用呋塞米"
          },
          "elementId": "562"
        }
      },
      {
        "n": {
          "identity": 563,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "金耀药业注射用甲泼尼龙琥珀"
          },
          "elementId": "563"
        }
      },
      {
        "n": {
          "identity": 564,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "大连药业托西酸舒他西林胶囊"
          },
          "elementId": "564"
        }
      },
      {
        "n": {
          "identity": 565,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "恩经复"
          },
          "elementId": "565"
        }
      },
      {
        "n": {
          "identity": 566,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "普德药业注射用盐酸溴己新"
          },
          "elementId": "566"
        }
      },
      {
        "n": {
          "identity": 567,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "皇象铁力蓝天甲硝唑维B6片"
          },
          "elementId": "567"
        }
      },
      {
        "n": {
          "identity": 568,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "松泰斯"
          },
          "elementId": "568"
        }
      },
      {
        "n": {
          "identity": 569,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "迪诺制药替硝唑片"
          },
          "elementId": "569"
        }
      },
      {
        "n": {
          "identity": 570,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "阿莫仙阿莫西林颗粒"
          },
          "elementId": "570"
        }
      },
      {
        "n": {
          "identity": 571,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "银诺克肺宝蛤蚧定喘丸"
          },
          "elementId": "571"
        }
      },
      {
        "n": {
          "identity": 572,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "西岳制药托西酸舒他西林胶囊"
          },
          "elementId": "572"
        }
      },
      {
        "n": {
          "identity": 573,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "金诃藏药仁青芒觉"
          },
          "elementId": "573"
        }
      },
      {
        "n": {
          "identity": 574,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东信药业琥乙红霉素颗粒"
          },
          "elementId": "574"
        }
      },
      {
        "n": {
          "identity": 575,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "迪沙药业甲硝唑维B6片"
          },
          "elementId": "575"
        }
      },
      {
        "n": {
          "identity": 576,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "桂林华信环吡酮胺乳膏"
          },
          "elementId": "576"
        }
      },
      {
        "n": {
          "identity": 577,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "天丁噻托溴铵粉雾剂"
          },
          "elementId": "577"
        }
      },
      {
        "n": {
          "identity": 578,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "澳利达奈德注射用盐酸溴己新"
          },
          "elementId": "578"
        }
      },
      {
        "n": {
          "identity": 579,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "联邦左福康盐酸左氧氟沙星胶"
          },
          "elementId": "579"
        }
      },
      {
        "n": {
          "identity": 580,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康美药业红霉素肠溶片"
          },
          "elementId": "580"
        }
      },
      {
        "n": {
          "identity": 581,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北京同仁堂百咳静糖浆"
          },
          "elementId": "581"
        }
      },
      {
        "n": {
          "identity": 582,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "吉林东方制药枸橼酸喷托维林"
          },
          "elementId": "582"
        }
      },
      {
        "n": {
          "identity": 583,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "佳乐弗乳酸左氧氟沙星片"
          },
          "elementId": "583"
        }
      },
      {
        "n": {
          "identity": 584,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "孩尔欣头孢克洛颗粒"
          },
          "elementId": "584"
        }
      },
      {
        "n": {
          "identity": 585,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "沈阳一药替硝唑片"
          },
          "elementId": "585"
        }
      },
      {
        "n": {
          "identity": 586,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "双林生物人血白蛋白"
          },
          "elementId": "586"
        }
      },
      {
        "n": {
          "identity": 587,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "振兴氨茶碱片"
          },
          "elementId": "587"
        }
      },
      {
        "n": {
          "identity": 588,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "维宏"
          },
          "elementId": "588"
        }
      },
      {
        "n": {
          "identity": 589,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "海南制药厂蛇胆川贝液"
          },
          "elementId": "589"
        }
      },
      {
        "n": {
          "identity": 590,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "国药国瑞注射用盐酸溴己新"
          },
          "elementId": "590"
        }
      },
      {
        "n": {
          "identity": 591,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "美卓乐"
          },
          "elementId": "591"
        }
      },
      {
        "n": {
          "identity": 592,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "信谊布地奈德气雾剂"
          },
          "elementId": "592"
        }
      },
      {
        "n": {
          "identity": 593,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "联邦安必仙氨苄西林胶囊"
          },
          "elementId": "593"
        }
      },
      {
        "n": {
          "identity": 594,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "迪龙制药胸腺肽肠溶片"
          },
          "elementId": "594"
        }
      },
      {
        "n": {
          "identity": 595,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "东信药业阿奇霉素颗粒"
          },
          "elementId": "595"
        }
      },
      {
        "n": {
          "identity": 596,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "朗瑞"
          },
          "elementId": "596"
        }
      },
      {
        "n": {
          "identity": 597,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "石药欧意氨茶碱片"
          },
          "elementId": "597"
        }
      },
      {
        "n": {
          "identity": 598,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "纽兰药业小青龙合剂"
          },
          "elementId": "598"
        }
      },
      {
        "n": {
          "identity": 599,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "桑海制药喷托维林氯化铵糖浆"
          },
          "elementId": "599"
        }
      },
      {
        "n": {
          "identity": 600,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "迪瑞制药琥乙红霉素颗粒"
          },
          "elementId": "600"
        }
      },
      {
        "n": {
          "identity": 601,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "陕西东泰制药复方蛤青胶囊"
          },
          "elementId": "601"
        }
      },
      {
        "n": {
          "identity": 602,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "蛇胆川贝液"
          },
          "elementId": "602"
        }
      },
      {
        "n": {
          "identity": 603,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "康裕头孢氨苄胶囊"
          },
          "elementId": "603"
        }
      },
      {
        "n": {
          "identity": 604,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "哈药总厂头孢氨苄甲氧苄啶片"
          },
          "elementId": "604"
        }
      },
      {
        "n": {
          "identity": 605,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "华南药业红霉素肠溶片"
          },
          "elementId": "605"
        }
      },
      {
        "n": {
          "identity": 606,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "宜昌长江乳酸左氧氟沙星片"
          },
          "elementId": "606"
        }
      },
      {
        "n": {
          "identity": 607,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "明水药业头孢氨苄甲氧苄啶片"
          },
          "elementId": "607"
        }
      },
      {
        "n": {
          "identity": 608,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "赤峰维康托西酸舒他西林胶囊"
          },
          "elementId": "608"
        }
      },
      {
        "n": {
          "identity": 609,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "唐山红星硝酸益康唑溶液"
          },
          "elementId": "609"
        }
      },
      {
        "n": {
          "identity": 610,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "德远药业雷公藤多苷片"
          },
          "elementId": "610"
        }
      },
      {
        "n": {
          "identity": 611,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "彼迪药业托西酸舒他西林胶囊"
          },
          "elementId": "611"
        }
      },
      {
        "n": {
          "identity": 612,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "北京永康药业盐酸利多卡因注"
          },
          "elementId": "612"
        }
      },
      {
        "n": {
          "identity": 613,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "傲宁"
          },
          "elementId": "613"
        }
      },
      {
        "n": {
          "identity": 614,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "贵州汉方药业雷公藤多苷片"
          },
          "elementId": "614"
        }
      },
      {
        "n": {
          "identity": 615,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "南通中华药业硝酸咪康唑乳膏"
          },
          "elementId": "615"
        }
      },
      {
        "n": {
          "identity": 616,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "卓峰地塞米松磷酸钠注射液"
          },
          "elementId": "616"
        }
      },
      {
        "n": {
          "identity": 617,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "爱普森药业阿奇霉素片"
          },
          "elementId": "617"
        }
      },
      {
        "n": {
          "identity": 618,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "津华晖星替硝唑片"
          },
          "elementId": "618"
        }
      },
      {
        "n": {
          "identity": 619,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "重庆华邦制药注射用甲泼尼龙"
          },
          "elementId": "619"
        }
      },
      {
        "n": {
          "identity": 620,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "卫光生物人血白蛋白"
          },
          "elementId": "620"
        }
      },
      {
        "n": {
          "identity": 621,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "飞云岭药业甲硝唑片"
          },
          "elementId": "621"
        }
      },
      {
        "n": {
          "identity": 622,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "苏州三药盐酸克林霉素胶囊"
          },
          "elementId": "622"
        }
      },
      {
        "n": {
          "identity": 623,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "可尔生"
          },
          "elementId": "623"
        }
      },
      {
        "n": {
          "identity": 624,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "福建太平洋制药酮康唑乳膏"
          },
          "elementId": "624"
        }
      },
      {
        "n": {
          "identity": 625,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "赣南制药喷托维林氯化铵糖浆"
          },
          "elementId": "625"
        }
      },
      {
        "n": {
          "identity": 626,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "美通制药雷公藤多苷片"
          },
          "elementId": "626"
        }
      },
      {
        "n": {
          "identity": 627,
          "labels": [
            "Producer"
          ],
          "properties": {
            "name": "瑞尔医药盐酸班布特罗片"
          },
          "elementId": "627"
        }
      },
      {
        "n": {
          "identity": 628,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "头晕"
          },
          "elementId": "628"
        }
      },
      {
        "n": {
          "identity": 629,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺部啰音"
          },
          "elementId": "629"
        }
      },
      {
        "n": {
          "identity": 630,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "纵隔浊音界扩大"
          },
          "elementId": "630"
        }
      },
      {
        "n": {
          "identity": 631,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "冬春季的慢性咳..."
          },
          "elementId": "631"
        }
      },
      {
        "n": {
          "identity": 632,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咳出棕色痰栓"
          },
          "elementId": "632"
        }
      },
      {
        "n": {
          "identity": 633,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "胸痛"
          },
          "elementId": "633"
        }
      },
      {
        "n": {
          "identity": 634,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "闫鹏辉"
          },
          "elementId": "634"
        }
      },
      {
        "n": {
          "identity": 635,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "抽搐"
          },
          "elementId": "635"
        }
      },
      {
        "n": {
          "identity": 636,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "紧张性头晕"
          },
          "elementId": "636"
        }
      },
      {
        "n": {
          "identity": 637,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咯血"
          },
          "elementId": "637"
        }
      },
      {
        "n": {
          "identity": 638,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咳嗽伴胸痛"
          },
          "elementId": "638"
        }
      },
      {
        "n": {
          "identity": 639,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "目赤"
          },
          "elementId": "639"
        }
      },
      {
        "n": {
          "identity": 640,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺泡炎症"
          },
          "elementId": "640"
        }
      },
      {
        "n": {
          "identity": 641,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "黏稠或脓性痰伴..."
          },
          "elementId": "641"
        }
      },
      {
        "n": {
          "identity": 642,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "鼻塞"
          },
          "elementId": "642"
        }
      },
      {
        "n": {
          "identity": 643,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "口唇青紫"
          },
          "elementId": "643"
        }
      },
      {
        "n": {
          "identity": 644,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "喘息"
          },
          "elementId": "644"
        }
      },
      {
        "n": {
          "identity": 645,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "心源性呼吸窘迫"
          },
          "elementId": "645"
        }
      },
      {
        "n": {
          "identity": 646,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "胸闷憋气"
          },
          "elementId": "646"
        }
      },
      {
        "n": {
          "identity": 647,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "骨膜炎"
          },
          "elementId": "647"
        }
      },
      {
        "n": {
          "identity": 648,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "蛋白尿"
          },
          "elementId": "648"
        }
      },
      {
        "n": {
          "identity": 649,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "痰呈粘液脓性"
          },
          "elementId": "649"
        }
      },
      {
        "n": {
          "identity": 650,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "纤毛上皮细胞损伤脱落"
          },
          "elementId": "650"
        }
      },
      {
        "n": {
          "identity": 651,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "小支气管粘膜水肿"
          },
          "elementId": "651"
        }
      },
      {
        "n": {
          "identity": 652,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "横膈低平"
          },
          "elementId": "652"
        }
      },
      {
        "n": {
          "identity": 653,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "痰中带血丝"
          },
          "elementId": "653"
        }
      },
      {
        "n": {
          "identity": 654,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "体重减轻"
          },
          "elementId": "654"
        }
      },
      {
        "n": {
          "identity": 655,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咳嗽伴哮鸣音"
          },
          "elementId": "655"
        }
      },
      {
        "n": {
          "identity": 656,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "吸气时有蝉鸣音"
          },
          "elementId": "656"
        }
      },
      {
        "n": {
          "identity": 657,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "感觉障碍"
          },
          "elementId": "657"
        }
      },
      {
        "n": {
          "identity": 658,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "恶心"
          },
          "elementId": "658"
        }
      },
      {
        "n": {
          "identity": 659,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "毓卓"
          },
          "elementId": "659"
        }
      },
      {
        "n": {
          "identity": 660,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "盗汗"
          },
          "elementId": "660"
        }
      },
      {
        "n": {
          "identity": 661,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺泡灌洗液可见..."
          },
          "elementId": "661"
        }
      },
      {
        "n": {
          "identity": 662,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "呕吐"
          },
          "elementId": "662"
        }
      },
      {
        "n": {
          "identity": 663,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "浅感觉减退或缺失"
          },
          "elementId": "663"
        }
      },
      {
        "n": {
          "identity": 664,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "桶状胸"
          },
          "elementId": "664"
        }
      },
      {
        "n": {
          "identity": 665,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "呼吸音减弱"
          },
          "elementId": "665"
        }
      },
      {
        "n": {
          "identity": 666,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "哮鸣音"
          },
          "elementId": "666"
        }
      },
      {
        "n": {
          "identity": 667,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "低热"
          },
          "elementId": "667"
        }
      },
      {
        "n": {
          "identity": 668,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "呼吸困难"
          },
          "elementId": "668"
        }
      },
      {
        "n": {
          "identity": 669,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "呼气音延长"
          },
          "elementId": "669"
        }
      },
      {
        "n": {
          "identity": 670,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺纹理增粗"
          },
          "elementId": "670"
        }
      },
      {
        "n": {
          "identity": 671,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "面色青紫"
          },
          "elementId": "671"
        }
      },
      {
        "n": {
          "identity": 672,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "眼睛痒"
          },
          "elementId": "672"
        }
      },
      {
        "n": {
          "identity": 673,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "化学性支气管炎"
          },
          "elementId": "673"
        }
      },
      {
        "n": {
          "identity": 674,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "耸肩喘息"
          },
          "elementId": "674"
        }
      },
      {
        "n": {
          "identity": 675,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "变应性咳嗽"
          },
          "elementId": "675"
        }
      },
      {
        "n": {
          "identity": 676,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺阴虚"
          },
          "elementId": "676"
        }
      },
      {
        "n": {
          "identity": 677,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咳铁锈色痰"
          },
          "elementId": "677"
        }
      },
      {
        "n": {
          "identity": 678,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "气急"
          },
          "elementId": "678"
        }
      },
      {
        "n": {
          "identity": 679,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "紧张性头痛"
          },
          "elementId": "679"
        }
      },
      {
        "n": {
          "identity": 680,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "乏力"
          },
          "elementId": "680"
        }
      },
      {
        "n": {
          "identity": 681,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "口唇和甲床略带青紫"
          },
          "elementId": "681"
        }
      },
      {
        "n": {
          "identity": 682,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咯血伴发热"
          },
          "elementId": "682"
        }
      },
      {
        "n": {
          "identity": 683,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "谵妄"
          },
          "elementId": "683"
        }
      },
      {
        "n": {
          "identity": 684,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "气短"
          },
          "elementId": "684"
        }
      },
      {
        "n": {
          "identity": 685,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "急性面容"
          },
          "elementId": "685"
        }
      },
      {
        "n": {
          "identity": 686,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "间歇性头晕"
          },
          "elementId": "686"
        }
      },
      {
        "n": {
          "identity": 687,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "发热伴咳嗽、咯..."
          },
          "elementId": "687"
        }
      },
      {
        "n": {
          "identity": 688,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "湿啰音"
          },
          "elementId": "688"
        }
      },
      {
        "n": {
          "identity": 689,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺部出血"
          },
          "elementId": "689"
        }
      },
      {
        "n": {
          "identity": 690,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "惊厥"
          },
          "elementId": "690"
        }
      },
      {
        "n": {
          "identity": 691,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "肺纤维化"
          },
          "elementId": "691"
        }
      },
      {
        "n": {
          "identity": 692,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "发烧"
          },
          "elementId": "692"
        }
      },
      {
        "n": {
          "identity": 693,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "畏寒"
          },
          "elementId": "693"
        }
      },
      {
        "n": {
          "identity": 694,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "痉挛性咳嗽"
          },
          "elementId": "694"
        }
      },
      {
        "n": {
          "identity": 695,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "腱反射消失"
          },
          "elementId": "695"
        }
      },
      {
        "n": {
          "identity": 696,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "间歇性头痛"
          },
          "elementId": "696"
        }
      },
      {
        "n": {
          "identity": 697,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "出生后即有持续青紫"
          },
          "elementId": "697"
        }
      },
      {
        "n": {
          "identity": 698,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "昏迷"
          },
          "elementId": "698"
        }
      },
      {
        "n": {
          "identity": 699,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "闫铁"
          },
          "elementId": "699"
        }
      },
      {
        "n": {
          "identity": 700,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "腹泻"
          },
          "elementId": "700"
        }
      },
      {
        "n": {
          "identity": 701,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "胸闷"
          },
          "elementId": "701"
        }
      },
      {
        "n": {
          "identity": 702,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "紫绀"
          },
          "elementId": "702"
        }
      },
      {
        "n": {
          "identity": 703,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "嗜酸性粒细胞增多"
          },
          "elementId": "703"
        }
      },
      {
        "n": {
          "identity": 704,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "咽部异物感"
          },
          "elementId": "704"
        }
      },
      {
        "n": {
          "identity": 705,
          "labels": [
            "Symptom"
          ],
          "properties": {
            "name": "多发性神经炎"
          },
          "elementId": "705"
        }
      }
  ],

  kg_math:[
      {
        "n": {
          "identity": 0,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "极限"
          },
          "elementId": "0"
        }
      },
      {
        "n": {
          "identity": 1,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "导数"
          },
          "elementId": "1"
        }
      },
      {
        "n": {
          "identity": 2,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "中值定理"
          },
          "elementId": "2"
        }
      },
      {
        "n": {
          "identity": 3,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "一元积分"
          },
          "elementId": "3"
        }
      },
      {
        "n": {
          "identity": 4,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "定积分"
          },
          "elementId": "4"
        }
      },
      {
        "n": {
          "identity": 5,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "积分应用"
          },
          "elementId": "5"
        }
      },
      {
        "n": {
          "identity": 6,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "一阶微分"
          },
          "elementId": "6"
        }
      },
      {
        "n": {
          "identity": 7,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "向量代数+空间解析几何"
          },
          "elementId": "7"
        }
      },
      {
        "n": {
          "identity": 8,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "多元函数"
          },
          "elementId": "8"
        }
      },
      {
        "n": {
          "identity": 9,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "重积分"
          },
          "elementId": "9"
        }
      },
      {
        "n": {
          "identity": 10,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "曲线积分"
          },
          "elementId": "10"
        }
      },
      {
        "n": {
          "identity": 11,
          "labels": [
            "高等数学"
          ],
          "properties": {
            "name": "无穷级数"
          },
          "elementId": "11"
        }
      },
      {
        "n": {
          "identity": 12,
          "labels": [
            "线性代数"
          ],
          "properties": {
            "name": "行列式"
          },
          "elementId": "12"
        }
      },
      {
        "n": {
          "identity": 13,
          "labels": [
            "线性代数"
          ],
          "properties": {
            "name": "矩阵"
          },
          "elementId": "13"
        }
      },
      {
        "n": {
          "identity": 14,
          "labels": [
            "线性代数"
          ],
          "properties": {
            "name": "初等变换"
          },
          "elementId": "14"
        }
      },
      {
        "n": {
          "identity": 15,
          "labels": [
            "线性代数"
          ],
          "properties": {
            "name": "向量组"
          },
          "elementId": "15"
        }
      },
      {
        "n": {
          "identity": 16,
          "labels": [
            "线性代数"
          ],
          "properties": {
            "name": "相似矩阵二次型"
          },
          "elementId": "16"
        }
      },
      {
        "n": {
          "identity": 17,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "命题逻辑概念"
          },
          "elementId": "17"
        }
      },
      {
        "n": {
          "identity": 18,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "等值演算"
          },
          "elementId": "18"
        }
      },
      {
        "n": {
          "identity": 19,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "推理理论"
          },
          "elementId": "19"
        }
      },
      {
        "n": {
          "identity": 20,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "一阶逻辑概念"
          },
          "elementId": "20"
        }
      },
      {
        "n": {
          "identity": 21,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "一阶等值演算与推理"
          },
          "elementId": "21"
        }
      },
      {
        "n": {
          "identity": 22,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "集合代数"
          },
          "elementId": "22"
        }
      },
      {
        "n": {
          "identity": 23,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "二元关系"
          },
          "elementId": "23"
        }
      },
      {
        "n": {
          "identity": 24,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "函数"
          },
          "elementId": "24"
        }
      },
      {
        "n": {
          "identity": 25,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "代数系统"
          },
          "elementId": "25"
        }
      },
      {
        "n": {
          "identity": 26,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "群与环"
          },
          "elementId": "26"
        }
      },
      {
        "n": {
          "identity": 27,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "格与布尔代数"
          },
          "elementId": "27"
        }
      },
      {
        "n": {
          "identity": 28,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "排列"
          },
          "elementId": "28"
        }
      },
      {
        "n": {
          "identity": 29,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "组合数学"
          },
          "elementId": "29"
        }
      },
      {
        "n": {
          "identity": 30,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "图的基本概念"
          },
          "elementId": "30"
        }
      },
      {
        "n": {
          "identity": 31,
          "labels": [
            "离散数学"
          ],
          "properties": {
            "name": "欧拉图"
          },
          "elementId": "31"
        }
      }
  ],

  kg_item:[
      {
        "n": {
          "identity": 0,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "基于知识图谱的海洋数值预报数据推荐算法"
          },
          "elementId": "0"
        }
      },
      {
        "n": {
          "identity": 1,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "基于知识图谱理念的生物医学电子学在线课程建设初步探索"
          },
          "elementId": "1"
        }
      },
      {
        "n": {
          "identity": 2,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "高校IT运维知识图谱构建及应用"
          },
          "elementId": "2"
        }
      },
      {
        "n": {
          "identity": 3,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "《山海经》知识图谱构建与应用研究"
          },
          "elementId": "3"
        }
      },
      {
        "n": {
          "identity": 4,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "学业预警知识图谱的构建与应用"
          },
          "elementId": "4"
        }
      },
      {
        "n": {
          "identity": 5,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "《人工智能应用导论》知识图谱构建与应用研究"
          },
          "elementId": "5"
        }
      },
      {
        "n": {
          "identity": 6,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "地理知识图谱下的建筑群空间分布模式推理"
          },
          "elementId": "6"
        }
      },
      {
        "n": {
          "identity": 7,
          "labels": [
            "title"
          ],
          "properties": {
            "name": "时态知识图谱的推理研究综述"
          },
          "elementId": "7"
        }
      },
      {
        "n": {
          "identity": 8,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "沈英汉"
          },
          "elementId": "8"
        }
      },
      {
        "n": {
          "identity": 9,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "李忠伟"
          },
          "elementId": "9"
        }
      },
      {
        "n": {
          "identity": 10,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "李建青"
          },
          "elementId": "10"
        }
      },
      {
        "n": {
          "identity": 11,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "唐曾杨"
          },
          "elementId": "11"
        }
      },
      {
        "n": {
          "identity": 12,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "闫瑾"
          },
          "elementId": "12"
        }
      },
      {
        "n": {
          "identity": 13,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "朱良兵"
          },
          "elementId": "13"
        }
      },
      {
        "n": {
          "identity": 14,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "张军"
          },
          "elementId": "14"
        }
      },
      {
        "n": {
          "identity": 15,
          "labels": [
            "creators"
          ],
          "properties": {
            "name": "涂华婷"
          },
          "elementId": "15"
        }
      },
      {
        "n": {
          "identity": 16,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "随着人工智能技术引发新一轮科技革命和社会进步，高职《人工智能应用导论》课程在众多院校相继开设，对其开展知识图谱的构建应用研究逐渐兴起，然而知识图谱的构建需要领域专家共同探讨、手工构建，十分严谨而繁琐，人工智能知识更新又较为快速，目前高职《人工智能应用导论》知识图谱的构建较为缺乏。本文借助机器学习和自然语言处理技术分别对《人工智能应用导论》课程文本资源进行实体识别和关系抽取，接着进行知识融合，最后基于Neo4j图数据库可视化展示并进行知识点推理。实验结果表明：构造后的课程知识图谱涵盖了《人工智能应用导论》课程所有知识点及其关系属性，助力开展知识点学习推理和学习路径推荐研究。"
          },
          "elementId": "16"
        }
      },
      {
        "n": {
          "identity": 17,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "以图结构表达的知识图谱不仅在语义网络的描述与推理中发挥着重要作用，对于空间实体的结构化抽象与空间推理也具有重要意义。空间实体的联系信息在知识图谱中以图的边记录，通过路径探测、子图对齐、模式发现等基于边的知识图谱计算推理，在空间场景认知可发挥重要作用。地理知识图谱是一种对地理概念、实体及其相互关系进行形式化描述的知识系统，既有通用知识的内涵与特点，也有地理知识特定的时空特征，能够将语义模型和时空模型联系起来，描述语义关系、空间关系和时间关系，在地理知识的表达、理解、获取与推理方面有巨大的应用潜力。现有地理知识图谱的研究工作多集中于语义方面，语义关系的抽取与表达比较丰富，可以支持进一步的地理知识语义搜索等功能；然而地理知识图谱在时空模型上的知识表达比较缺乏，现有的空间关系局限在要素之间，很少涉及空间认知中进一步的分布态势、空间格局等，地理知识图谱在空间语义知识方面有待增强。本文基于知识图谱构建原理，以建筑群地理知识图谱构建为例，实现格网型建筑物模式的识别。先将建筑物抽象成实体，表达为图的节点，基于几何邻近分析提取建筑物之间的空间邻域关系，以此构建建筑群地理知识图谱；在此基础上结合建筑物模式识别的领域知识，进一步推理构建其他的空间语义关系，完善地理知识图谱；再将建筑群场景的格网模式表达为知识图谱的规则，在知识图谱上基于NoSQL语言进行推理。结果表明，本文方法能有效提取建筑物格网模式，验证了地理知识图谱在空间推理上的作用和在领域问题研究中的良好适应性，为地理知识图谱在空间认知领域的应用提供了思路。"
          },
          "elementId": "17"
        }
      },
      {
        "n": {
          "identity": 18,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "随着社交网络、物端感知等技术快速发展，网络空间中涌现了大量的交互、话题、事件、新闻等数据，蕴含大量动态演化、强时效性的知识.较于忽略知识中时间信息的传统知识图谱，时态知识图谱通过建模知识的时效性以描述动态变化的现实世界，为时间紧耦合的应用提供有效支持.然而，时态知识图谱无法确保涵盖全量知识，知识的缺失严重影响应用性能，需要推理模型自动挖掘新的知识，以解释事物的历史状态，预测未来发展趋势并描述演化规律.由于实际应用的迫切需要，近年来，时态知识图谱的推理研究工作层出不穷，逐渐引起学术界和工业界的广泛关注.本文对近年来时态知识图谱的推理工作进行全面介绍和总结.首先，介绍了时态知识图谱的推理相关概念与问题描述;其次，介绍了面向补全任务的推理模型与面向预测任务的推理模型，对其进行比较分析;之后总结了时态知识图谱推理的数据集、推理任务、相关指标以及应用场景;最后展望时态知识图谱推理的未来研究趋势.综上，本文致力于为时态知识图谱的推理领域研究人员提供具有价值的参考，以推动该领域进一步发展."
          },
          "elementId": "18"
        }
      },
      {
        "n": {
          "identity": 19,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "针对高校IT运维中出现的效率低下和服务不佳问题，文章研究设计了基于知识图谱的IT运维总体架构。通过分析运维对象、运维服务流程、运维数据、采集分析处理、运维管理等模块，构建了IT运维问答知识图谱，实现了运维场景和孤立知识点的业务应用关联，基于Neo4j和Python技术开发了IT运维问答系统，解决了运维效率低下和服务质量不佳的问题。"
          },
          "elementId": "19"
        }
      },
      {
        "n": {
          "identity": 20,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "针对学业预警体系中“事前事中预防”措施不足、过程化与可视化较低的问题，进行了学业预警知识图谱的构建与应用。首先，通过protégé完成模式层的构建，对知识的数据结构(包含实体、关系、属性)进行了设计，采用了树状结构，使每个子类继承其祖先节点的属性；其次，以事实三元组为单位，存储具体的信息；然后，通过关系型数据库实现数据与本体的映射，对关系型数据库的结构化数据进行知识抽取，通过D2RQ工具将结构化数据转化为三元组数据，存储在SQL中；最后，使用Neo4j图数据库可视化展示，完成学业预警知识图谱的构建。公开数据集实验测试结果表明，所构建的学业预警知识图谱能够对学生学业进行预警，对实体及属性进行校验标注，经过采样标注后得到准确率为94.23%，且时效性良好，系统平均在9 ms后开始传输，并在25 ms后完成，同时在过程化与可视化方面有较大提升，可以实现“事前事中预防”。"
          },
          "elementId": "20"
        }
      },
      {
        "n": {
          "identity": 21,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "为解决海洋数值预报研究人员面对复杂多样的研究任务时难以及时准确地从种类繁多的海洋数值预报数据中找到所需数据的问题，提出基于知识图谱的海洋数值预报数据推荐算法。利用海洋数值预报文献提取研究任务及海洋数值预报数据构建知识图谱，基于知识图谱计算海洋数值预报数据实体之间的相似度，同时融合在研究人员用户行为下海洋数值预报数据的相似度，进行排序选取相似度较高的海洋数值预报数据进行推荐。实验结果表明，推荐精确率及召回率分别为67.14%、62.49%。"
          },
          "elementId": "21"
        }
      },
      {
        "n": {
          "identity": 22,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "为满足疫情期间在线教育需求，基于知识图谱理念，从知识、问题、能力3个维度完善课程知识网络结构，初步探索生物医学电子学在线课程建设新模式，旨在重构教学资源、完善人才培养方案，实现开放、个性、精准的智慧教育体系创新。"
          },
          "elementId": "22"
        }
      },
      {
        "n": {
          "identity": 23,
          "labels": [
            "abstractNote"
          ],
          "properties": {
            "name": "[目的/意义]知识图谱作为数智时代一种先进的知识组织方式，能够为数字人文研究提供良好的技术支持，去洞察那些以往在文本资源中看不见的隐含联系和知识结构。[方法/过程]《山海经》是中国上古三大奇书，具有非常高的研究价值。本文引入主题图和Neo4j等技术和工具，在分析《山海经》中的主题类型、关联关系、属性信息的基础上，提出了构建《山海经》知识图谱的技术架构、数据模型、实施步骤。[结果/结论]将多源异构数据进行集成，完成了《山海经》知识图谱的构建和展示，对于将知识图谱技术应用于数字人文研究领域做了有益的探索。"
          },
          "elementId": "23"
        }
      },
      {
        "n": {
          "identity": 24,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "计算机学报"
          },
          "elementId": "24"
        }
      },
      {
        "n": {
          "identity": 25,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "现代信息科技"
          },
          "elementId": "25"
        }
      },
      {
        "n": {
          "identity": 26,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "情报探索"
          },
          "elementId": "26"
        }
      },
      {
        "n": {
          "identity": 27,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "中北大学学报(自然科学版)"
          },
          "elementId": "27"
        }
      },
      {
        "n": {
          "identity": 28,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "网络安全技术与应用"
          },
          "elementId": "28"
        }
      },
      {
        "n": {
          "identity": 29,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "卫生职业教育"
          },
          "elementId": "29"
        }
      },
      {
        "n": {
          "identity": 30,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "计算机工程与设计"
          },
          "elementId": "30"
        }
      },
      {
        "n": {
          "identity": 31,
          "labels": [
            "publicationTitle"
          ],
          "properties": {
            "name": "地球信息科学学报"
          },
          "elementId": "31"
        }
      },
      {
        "n": {
          "identity": 32,
          "labels": [
            "date"
          ],
          "properties": {
            "name": "2023"
          },
          "elementId": "32"
        }
      },
      {
        "n": {
          "identity": 33,
          "labels": [
            "language"
          ],
          "properties": {
            "name": "中文;"
          },
          "elementId": "33"
        }
      },
      {
        "n": {
          "identity": 34,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50n2_FC1ezrNgNLgIgJzEpc4dzL6iDCe0g5IUw98rlIO1hnPzttTlaiP&uniplatform=NZKPT"
          },
          "elementId": "34"
        }
      },
      {
        "n": {
          "identity": 35,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50niO_CdaBNPNX-0uaDVZU7N5AAnulcHnorXGWxEt2gB0eRbKuKlYbR5&uniplatform=NZKPT"
          },
          "elementId": "35"
        }
      },
      {
        "n": {
          "identity": 36,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50kyKUrPKilczQCToTb0b8hR90UZ_coCnRG5-mFTh0KJYq5nsDzG2GIu&uniplatform=NZKPT"
          },
          "elementId": "36"
        }
      },
      {
        "n": {
          "identity": 37,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50lqbdNo8z0wC2CMNOSuvHmHLVNnW2rbj7WrmcNNMwN0lMx5P0x-rTEa&uniplatform=NZKPT"
          },
          "elementId": "37"
        }
      },
      {
        "n": {
          "identity": 38,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50loVFp_9WcsUA-WIO5VPFBwqL4Z0qvbQZmVs1z40ce6xS5VghuFE8SX&uniplatform=NZKPT"
          },
          "elementId": "38"
        }
      },
      {
        "n": {
          "identity": 39,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50nW0ftToGaH65dirvJKW0nseKn702sm2gcw_U7v3Bi-WOR-4T8vghXQ&uniplatform=NZKPT"
          },
          "elementId": "39"
        }
      },
      {
        "n": {
          "identity": 40,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50l8yRr-dwAdi5vhgvFP3RlDDHgKkYlPZYTXibJWzFBHw1euGu1vuenZ&uniplatform=NZKPT"
          },
          "elementId": "40"
        }
      },
      {
        "n": {
          "identity": 41,
          "labels": [
            "url"
          ],
          "properties": {
            "name": "https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50ntGgPOL7QfrrIhj5ge6CBH4g2IsyPB8asXh8xKI3kodiPsmDcTH8Zw&uniplatform=NZKPT"
          },
          "elementId": "41"
        }
      },
      {
        "n": {
          "identity": 42,
          "labels": [
            "libraryCatalog"
          ],
          "properties": {
            "name": "CNKI"
          },
          "elementId": "42"
        }
      },
      {
        "n": {
          "identity": 43,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "用户行为"
          },
          "elementId": "43"
        }
      },
      {
        "n": {
          "identity": 44,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "山海经"
          },
          "elementId": "44"
        }
      },
      {
        "n": {
          "identity": 45,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "数据层"
          },
          "elementId": "45"
        }
      },
      {
        "n": {
          "identity": 46,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "digital humantiy"
          },
          "elementId": "46"
        }
      },
      {
        "n": {
          "identity": 47,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "空间认知 knowledge graph"
          },
          "elementId": "47"
        }
      },
      {
        "n": {
          "identity": 48,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "生物医学电子学"
          },
          "elementId": "48"
        }
      },
      {
        "n": {
          "identity": 49,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "格网模式"
          },
          "elementId": "49"
        }
      },
      {
        "n": {
          "identity": 50,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "knowledge graph"
          },
          "elementId": "50"
        }
      },
      {
        "n": {
          "identity": 51,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "推理实验"
          },
          "elementId": "51"
        }
      },
      {
        "n": {
          "identity": 52,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "知识预测"
          },
          "elementId": "52"
        }
      },
      {
        "n": {
          "identity": 53,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "地理知识"
          },
          "elementId": "53"
        }
      },
      {
        "n": {
          "identity": 54,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "knowledge prediction"
          },
          "elementId": "54"
        }
      },
      {
        "n": {
          "identity": 55,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "IT运维"
          },
          "elementId": "55"
        }
      },
      {
        "n": {
          "identity": 56,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "geographic knowledge"
          },
          "elementId": "56"
        }
      },
      {
        "n": {
          "identity": 57,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "similarity"
          },
          "elementId": "57"
        }
      },
      {
        "n": {
          "identity": 58,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "语义 The Classic of Mountains and Seas"
          },
          "elementId": "58"
        }
      },
      {
        "n": {
          "identity": 59,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "地理实体"
          },
          "elementId": "59"
        }
      },
      {
        "n": {
          "identity": 60,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "knowledge completion"
          },
          "elementId": "60"
        }
      },
      {
        "n": {
          "identity": 61,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "spatial reasoning"
          },
          "elementId": "61"
        }
      },
      {
        "n": {
          "identity": 62,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "temporal knowledge reasoning"
          },
          "elementId": "62"
        }
      },
      {
        "n": {
          "identity": 63,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "学业预警"
          },
          "elementId": "63"
        }
      },
      {
        "n": {
          "identity": 64,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "geographic entity"
          },
          "elementId": "64"
        }
      },
      {
        "n": {
          "identity": 65,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "IT operation and maintenance"
          },
          "elementId": "65"
        }
      },
      {
        "n": {
          "identity": 66,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "相似度"
          },
          "elementId": "66"
        }
      },
      {
        "n": {
          "identity": 67,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "Q&A system"
          },
          "elementId": "67"
        }
      },
      {
        "n": {
          "identity": 68,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "知识图谱 temporal knowledge graph"
          },
          "elementId": "68"
        }
      },
      {
        "n": {
          "identity": 69,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "data recommendation"
          },
          "elementId": "69"
        }
      },
      {
        "n": {
          "identity": 70,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "semantic"
          },
          "elementId": "70"
        }
      },
      {
        "n": {
          "identity": 71,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "研究任务"
          },
          "elementId": "71"
        }
      },
      {
        "n": {
          "identity": 72,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "建筑群模式识别"
          },
          "elementId": "72"
        }
      },
      {
        "n": {
          "identity": 73,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "模式层"
          },
          "elementId": "73"
        }
      },
      {
        "n": {
          "identity": 74,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "research task"
          },
          "elementId": "74"
        }
      },
      {
        "n": {
          "identity": 75,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "海洋数值预报文献"
          },
          "elementId": "75"
        }
      },
      {
        "n": {
          "identity": 76,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "spatial cognition"
          },
          "elementId": "76"
        }
      },
      {
        "n": {
          "identity": 77,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "关联"
          },
          "elementId": "77"
        }
      },
      {
        "n": {
          "identity": 78,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "data layer"
          },
          "elementId": "78"
        }
      },
      {
        "n": {
          "identity": 79,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "空间推理"
          },
          "elementId": "79"
        }
      },
      {
        "n": {
          "identity": 80,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "Online course"
          },
          "elementId": "80"
        }
      },
      {
        "n": {
          "identity": 81,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "Biomedical electronics"
          },
          "elementId": "81"
        }
      },
      {
        "n": {
          "identity": 82,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "building cluster pattern recognition"
          },
          "elementId": "82"
        }
      },
      {
        "n": {
          "identity": 83,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "association"
          },
          "elementId": "83"
        }
      },
      {
        "n": {
          "identity": 84,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "数字人文"
          },
          "elementId": "84"
        }
      },
      {
        "n": {
          "identity": 85,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "数据推荐 marine numerical forecast"
          },
          "elementId": "85"
        }
      },
      {
        "n": {
          "identity": 86,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "grid-pattern"
          },
          "elementId": "86"
        }
      },
      {
        "n": {
          "identity": 87,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "在线课程 Knowledge graph"
          },
          "elementId": "87"
        }
      },
      {
        "n": {
          "identity": 88,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "时态知识图谱"
          },
          "elementId": "88"
        }
      },
      {
        "n": {
          "identity": 89,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "spatial relationship"
          },
          "elementId": "89"
        }
      },
      {
        "n": {
          "identity": 90,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "空间关系"
          },
          "elementId": "90"
        }
      },
      {
        "n": {
          "identity": 91,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "model layer"
          },
          "elementId": "91"
        }
      },
      {
        "n": {
          "identity": 92,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "时态知识推理"
          },
          "elementId": "92"
        }
      },
      {
        "n": {
          "identity": 93,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "Neo4j cademic early warning"
          },
          "elementId": "93"
        }
      },
      {
        "n": {
          "identity": 94,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "应用研究"
          },
          "elementId": "94"
        }
      },
      {
        "n": {
          "identity": 95,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "marine numerical forecasting literature"
          },
          "elementId": "95"
        }
      },
      {
        "n": {
          "identity": 96,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "知识补全"
          },
          "elementId": "96"
        }
      },
      {
        "n": {
          "identity": 97,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "问答系统 knowledge graph"
          },
          "elementId": "97"
        }
      },
      {
        "n": {
          "identity": 98,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "人工智能应用导论课程"
          },
          "elementId": "98"
        }
      },
      {
        "n": {
          "identity": 99,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "海洋数值预报"
          },
          "elementId": "99"
        }
      },
      {
        "n": {
          "identity": 100,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "topic map"
          },
          "elementId": "100"
        }
      },
      {
        "n": {
          "identity": 101,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "知识图谱"
          },
          "elementId": "101"
        }
      },
      {
        "n": {
          "identity": 102,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "主题图"
          },
          "elementId": "102"
        }
      },
      {
        "n": {
          "identity": 103,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "user behavior"
          },
          "elementId": "103"
        }
      },
      {
        "n": {
          "identity": 104,
          "labels": [
            "tags"
          ],
          "properties": {
            "name": "Neo4j"
          },
          "elementId": "104"
        }
      }
  ],

  kg_database:[
    {
      "n": {
        "identity": 0,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "删除数据"
        },
        "elementId": "0"
      }
    },
    {
      "n": {
        "identity": 1,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "切换数据库"
        },
        "elementId": "1"
      }
    },
    {
      "n": {
        "identity": 2,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "批量添加数据"
        },
        "elementId": "2"
      }
    },
    {
      "n": {
        "identity": 3,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "3"
      }
    },
    {
      "n": {
        "identity": 4,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "4"
      }
    },
    {
      "n": {
        "identity": 5,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查询所有数据库"
        },
        "elementId": "5"
      }
    },
    {
      "n": {
        "identity": 6,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查询指定表的建表语句"
        },
        "elementId": "6"
      }
    },
    {
      "n": {
        "identity": 7,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "字段设置别名"
        },
        "elementId": "7"
      }
    },
    {
      "n": {
        "identity": 8,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "创建用户"
        },
        "elementId": "8"
      }
    },
    {
      "n": {
        "identity": 9,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "9"
      }
    },
    {
      "n": {
        "identity": 10,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查询当前数据库所有表"
        },
        "elementId": "10"
      }
    },
    {
      "n": {
        "identity": 11,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "修改数据类型"
        },
        "elementId": "11"
      }
    },
    {
      "n": {
        "identity": 12,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "创建数据库"
        },
        "elementId": "12"
      }
    },
    {
      "n": {
        "identity": 13,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "创建表结构"
        },
        "elementId": "13"
      }
    },
    {
      "n": {
        "identity": 14,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "删除表"
        },
        "elementId": "14"
      }
    },
    {
      "n": {
        "identity": 15,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "修改数据"
        },
        "elementId": "15"
      }
    },
    {
      "n": {
        "identity": 16,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "条件查询"
        },
        "elementId": "16"
      }
    },
    {
      "n": {
        "identity": 17,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "数据库管理系统"
        },
        "elementId": "17"
      }
    },
    {
      "n": {
        "identity": 18,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "18"
      }
    },
    {
      "n": {
        "identity": 19,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查询当前数据库"
        },
        "elementId": "19"
      }
    },
    {
      "n": {
        "identity": 20,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "删除用户"
        },
        "elementId": "20"
      }
    },
    {
      "n": {
        "identity": 21,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "去除重复记录"
        },
        "elementId": "21"
      }
    },
    {
      "n": {
        "identity": 22,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查看指定表结构"
        },
        "elementId": "22"
      }
    },
    {
      "n": {
        "identity": 23,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "删除数据库"
        },
        "elementId": "23"
      }
    },
    {
      "n": {
        "identity": 24,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "修改表名"
        },
        "elementId": "24"
      }
    },
    {
      "n": {
        "identity": 25,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查询用户"
        },
        "elementId": "25"
      }
    },
    {
      "n": {
        "identity": 26,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "修改用户密码"
        },
        "elementId": "26"
      }
    },
    {
      "n": {
        "identity": 27,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "给指定字段添加数据"
        },
        "elementId": "27"
      }
    },
    {
      "n": {
        "identity": 28,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "给全部字段添加数据"
        },
        "elementId": "28"
      }
    },
    {
      "n": {
        "identity": 29,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "数据库"
        },
        "elementId": "29"
      }
    },
    {
      "n": {
        "identity": 30,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "查询多个字段"
        },
        "elementId": "30"
      }
    },
    {
      "n": {
        "identity": 31,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "修改字段名和字段类型"
        },
        "elementId": "31"
      }
    },
    {
      "n": {
        "identity": 32,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "分组查询"
        },
        "elementId": "32"
      }
    },
    {
      "n": {
        "identity": 33,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "33"
      }
    },
    {
      "n": {
        "identity": 34,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "删除字段"
        },
        "elementId": "34"
      }
    },
    {
      "n": {
        "identity": 35,
        "labels": [
          "Title"
        ],
        "properties": {
          "name": "添加字段"
        },
        "elementId": "35"
      }
    },
    {
      "n": {
        "identity": 36,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DROPTABLE[IFEXISTS]表名"
        },
        "elementId": "36"
      }
    },
    {
      "n": {
        "identity": 37,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "CREATETABLE表名(字段1字段1类型[COMMENT字段1注释]，字段2字段2类型[COMMENT字段2注释]，字段3字段3类型[COMMENT字段3注释]，......字段n字段n类型[COMMENT字段n注释])[COMMENT表注释]"
        },
        "elementId": "37"
      }
    },
    {
      "n": {
        "identity": 38,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "ALTERUSER用户名@主机名IDENTIFIEDWITHmysql_native_passwordBY新密码"
        },
        "elementId": "38"
      }
    },
    {
      "n": {
        "identity": 39,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DataQueryLanguage"
        },
        "elementId": "39"
      }
    },
    {
      "n": {
        "identity": 40,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "dropdatabase[ifexists]数据库名"
        },
        "elementId": "40"
      }
    },
    {
      "n": {
        "identity": 41,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "ALTERTABLE表名CHANGE旧字段名新字段名类型(长度)[COMMENT注释][约束]"
        },
        "elementId": "41"
      }
    },
    {
      "n": {
        "identity": 42,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DataManipulationLanguage"
        },
        "elementId": "42"
      }
    },
    {
      "n": {
        "identity": 43,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "desc表名"
        },
        "elementId": "43"
      }
    },
    {
      "n": {
        "identity": 44,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DataBase（DB）"
        },
        "elementId": "44"
      }
    },
    {
      "n": {
        "identity": 45,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "ALTERTABLE表名ADD字段名类型(长度)[COMMENT注释][约束]"
        },
        "elementId": "45"
      }
    },
    {
      "n": {
        "identity": 46,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "字段名2=值2"
        },
        "elementId": "46"
      }
    },
    {
      "n": {
        "identity": 47,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "StructuredQueryLanguage(SQL)"
        },
        "elementId": "47"
      }
    },
    {
      "n": {
        "identity": 48,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "SELECT字段列表FROM表名[WHERE条件]GROUPBY分组字段名[HAVING分组后过滤条件]"
        },
        "elementId": "48"
      }
    },
    {
      "n": {
        "identity": 49,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "CREATEUSER用户名@主机名IDENTIFIEDBY密码"
        },
        "elementId": "49"
      }
    },
    {
      "n": {
        "identity": 50,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "showdatabases"
        },
        "elementId": "50"
      }
    },
    {
      "n": {
        "identity": 51,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "showtables"
        },
        "elementId": "51"
      }
    },
    {
      "n": {
        "identity": 52,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "use数据库名"
        },
        "elementId": "52"
      }
    },
    {
      "n": {
        "identity": 53,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "....[WHERE条件]"
        },
        "elementId": "53"
      }
    },
    {
      "n": {
        "identity": 54,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "INSERTINTO表名(字段名1，字段名2，...)VALUES(值1，值2，...)"
        },
        "elementId": "54"
      }
    },
    {
      "n": {
        "identity": 55,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "UPDATE表名SET字段名1=值1"
        },
        "elementId": "55"
      }
    },
    {
      "n": {
        "identity": 56,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DELETEFROM表名[WHERE条件]"
        },
        "elementId": "56"
      }
    },
    {
      "n": {
        "identity": 57,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "SELECT字段1，字段2，字段3...FROM表名"
        },
        "elementId": "57"
      }
    },
    {
      "n": {
        "identity": 58,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "selectdatabase()"
        },
        "elementId": "58"
      }
    },
    {
      "n": {
        "identity": 59,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "SELECT字段1[别名1]"
        },
        "elementId": "59"
      }
    },
    {
      "n": {
        "identity": 60,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "ALTERTABLE表名RENAMETO新表名"
        },
        "elementId": "60"
      }
    },
    {
      "n": {
        "identity": 61,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "ALTERTABLE表名MODIFY字段名新数据类型(长度)"
        },
        "elementId": "61"
      }
    },
    {
      "n": {
        "identity": 62,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "ALTERTABLE表名DROP字段名"
        },
        "elementId": "62"
      }
    },
    {
      "n": {
        "identity": 63,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "SELECTDISTINCT字段列表FROM表名"
        },
        "elementId": "63"
      }
    },
    {
      "n": {
        "identity": 64,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DataControlLanguage"
        },
        "elementId": "64"
      }
    },
    {
      "n": {
        "identity": 65,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "SELECT字段列表FROM表名WHERE条件列表"
        },
        "elementId": "65"
      }
    },
    {
      "n": {
        "identity": 66,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DataDefinitionLanguage"
        },
        "elementId": "66"
      }
    },
    {
      "n": {
        "identity": 67,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "INSERTINTO表名VALUES(值1，值2，...)，(值1，值2，...)，(值1，值2，...)"
        },
        "elementId": "67"
      }
    },
    {
      "n": {
        "identity": 68,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DataBaseManagementSystem(DBMS)"
        },
        "elementId": "68"
      }
    },
    {
      "n": {
        "identity": 69,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "createdatabase[ifnotexists]数据库名[defaultcharset字符集][collate排序规则]"
        },
        "elementId": "69"
      }
    },
    {
      "n": {
        "identity": 70,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "INSERTINTO表名VALUES(值1，值2，...)"
        },
        "elementId": "70"
      }
    },
    {
      "n": {
        "identity": 71,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "字段2[别名2]...FROM表名"
        },
        "elementId": "71"
      }
    },
    {
      "n": {
        "identity": 72,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "select*frommysql.user"
        },
        "elementId": "72"
      }
    },
    {
      "n": {
        "identity": 73,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "DROPUSER用户名@主机名"
        },
        "elementId": "73"
      }
    },
    {
      "n": {
        "identity": 74,
        "labels": [
          "Desc"
        ],
        "properties": {
          "name": "showcreatetable表名"
        },
        "elementId": "74"
      }
    },
    {
      "n": {
        "identity": 75,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "75"
      }
    },
    {
      "n": {
        "identity": 76,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "76"
      }
    },
    {
      "n": {
        "identity": 77,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "系统"
        },
        "elementId": "77"
      }
    },
    {
      "n": {
        "identity": 78,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "78"
      }
    },
    {
      "n": {
        "identity": 79,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "数据库语句"
        },
        "elementId": "79"
      }
    },
    {
      "n": {
        "identity": 80,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "80"
      }
    },
    {
      "n": {
        "identity": 81,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "81"
      }
    },
    {
      "n": {
        "identity": 82,
        "labels": [
          "Belong"
        ],
        "properties": {
          "name": "数据库"
        },
        "elementId": "82"
      }
    }
  ],

  kg_zotero:[
    {
      "n": {
        "identity": 0,
        "labels": [
          "zotero"
        ],
        "properties": {
          "name": "zotero"
        },
        "elementId": "0"
      }
    },
    {
      "n": {
        "identity": 1,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "MySQL-3.pdf"
        },
        "elementId": "1"
      }
    },
    {
      "n": {
        "identity": 2,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "MySQL-2.pdf"
        },
        "elementId": "2"
      }
    },
    {
      "n": {
        "identity": 3,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "MySQL-1.pdf"
        },
        "elementId": "3"
      }
    },
    {
      "n": {
        "identity": 4,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "高等数学习题册下册.pdf"
        },
        "elementId": "4"
      }
    },
    {
      "n": {
        "identity": 5,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "地理知识图谱下的建筑群空间分布模式推理"
        },
        "elementId": "5"
      }
    },
    {
      "n": {
        "identity": 6,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "学业预警知识图谱的构建与应用"
        },
        "elementId": "6"
      }
    },
    {
      "n": {
        "identity": 7,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "基于知识图谱理念的生物医学电子学在线课程建设初步探索"
        },
        "elementId": "7"
      }
    },
    {
      "n": {
        "identity": 8,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "《人工智能应用导论》知识图谱构建与应用研究"
        },
        "elementId": "8"
      }
    },
    {
      "n": {
        "identity": 9,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "基于知识图谱的海洋数值预报数据推荐算法"
        },
        "elementId": "9"
      }
    },
    {
      "n": {
        "identity": 10,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "算法竞赛入门经典"
        },
        "elementId": "10"
      }
    },
    {
      "n": {
        "identity": 11,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "时态知识图谱的推理研究综述"
        },
        "elementId": "11"
      }
    },
    {
      "n": {
        "identity": 12,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "《山海经》知识图谱构建与应用研究"
        },
        "elementId": "12"
      }
    },
    {
      "n": {
        "identity": 13,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "高校IT运维知识图谱构建及应用"
        },
        "elementId": "13"
      }
    },
    {
      "n": {
        "identity": 14,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "老妓抄"
        },
        "elementId": "14"
      }
    },
    {
      "n": {
        "identity": 15,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "基于知识图谱与深度学习的推荐算法的应用研究_吴建华.pdf"
        },
        "elementId": "15"
      }
    },
    {
      "n": {
        "identity": 16,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "英语四级.pdf"
        },
        "elementId": "16"
      }
    },
    {
      "n": {
        "identity": 17,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "算法导论(中文版)(现代计算机常用数据结构和算法).pdf"
        },
        "elementId": "17"
      }
    },
    {
      "n": {
        "identity": 18,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "disMath-chapt14-18.pdf"
        },
        "elementId": "18"
      }
    },
    {
      "n": {
        "identity": 19,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "disMath-chapt9-11.pdf"
        },
        "elementId": "19"
      }
    },
    {
      "n": {
        "identity": 20,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "disMath-chapt7-8.pdf"
        },
        "elementId": "20"
      }
    },
    {
      "n": {
        "identity": 21,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "disMath-chapt6.pdf"
        },
        "elementId": "21"
      }
    },
    {
      "n": {
        "identity": 22,
        "labels": [
          "pdf"
        ],
        "properties": {
          "name": "知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf"
        },
        "elementId": "22"
      }
    },
    {
      "n": {
        "identity": 23,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "数据库"
        },
        "elementId": "23"
      }
    },
    {
      "n": {
        "identity": 24,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "数据库管 理系统"
        },
        "elementId": "24"
      }
    },
    {
      "n": {
        "identity": 25,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "25"
      }
    },
    {
      "n": {
        "identity": 26,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "26"
      }
    },
    {
      "n": {
        "identity": 27,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "27"
      }
    },
    {
      "n": {
        "identity": 28,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "28"
      }
    },
    {
      "n": {
        "identity": 29,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "29"
      }
    },
    {
      "n": {
        "identity": 30,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查询所有数据库"
        },
        "elementId": "30"
      }
    },
    {
      "n": {
        "identity": 31,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查询当前数据库"
        },
        "elementId": "31"
      }
    },
    {
      "n": {
        "identity": 32,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "创建数据库"
        },
        "elementId": "32"
      }
    },
    {
      "n": {
        "identity": 33,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "删除数据库"
        },
        "elementId": "33"
      }
    },
    {
      "n": {
        "identity": 34,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "切换数据库"
        },
        "elementId": "34"
      }
    },
    {
      "n": {
        "identity": 35,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查询当前数据库所有表"
        },
        "elementId": "35"
      }
    },
    {
      "n": {
        "identity": 36,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查看指定表结构"
        },
        "elementId": "36"
      }
    },
    {
      "n": {
        "identity": 37,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查询指定表的建表语句"
        },
        "elementId": "37"
      }
    },
    {
      "n": {
        "identity": 38,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "创建表结构"
        },
        "elementId": "38"
      }
    },
    {
      "n": {
        "identity": 39,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "添加字段"
        },
        "elementId": "39"
      }
    },
    {
      "n": {
        "identity": 40,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "修改数据类型"
        },
        "elementId": "40"
      }
    },
    {
      "n": {
        "identity": 41,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "修改字段名和字段类型"
        },
        "elementId": "41"
      }
    },
    {
      "n": {
        "identity": 42,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "删除字段"
        },
        "elementId": "42"
      }
    },
    {
      "n": {
        "identity": 43,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "修改表名"
        },
        "elementId": "43"
      }
    },
    {
      "n": {
        "identity": 44,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "删除表"
        },
        "elementId": "44"
      }
    },
    {
      "n": {
        "identity": 45,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "给指定字段添加数据"
        },
        "elementId": "45"
      }
    },
    {
      "n": {
        "identity": 46,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "给全部字段添加数据"
        },
        "elementId": "46"
      }
    },
    {
      "n": {
        "identity": 47,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "批量添加数据"
        },
        "elementId": "47"
      }
    },
    {
      "n": {
        "identity": 48,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "修改数据"
        },
        "elementId": "48"
      }
    },
    {
      "n": {
        "identity": 49,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "删除数据"
        },
        "elementId": "49"
      }
    },
    {
      "n": {
        "identity": 50,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查询多个字段"
        },
        "elementId": "50"
      }
    },
    {
      "n": {
        "identity": 51,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "字段设置别名"
        },
        "elementId": "51"
      }
    },
    {
      "n": {
        "identity": 52,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "去除重复记录"
        },
        "elementId": "52"
      }
    },
    {
      "n": {
        "identity": 53,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "条件查询"
        },
        "elementId": "53"
      }
    },
    {
      "n": {
        "identity": 54,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "分组查询"
        },
        "elementId": "54"
      }
    },
    {
      "n": {
        "identity": 55,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "查询用户"
        },
        "elementId": "55"
      }
    },
    {
      "n": {
        "identity": 56,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "创建用户"
        },
        "elementId": "56"
      }
    },
    {
      "n": {
        "identity": 57,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "修改用户密码"
        },
        "elementId": "57"
      }
    },
    {
      "n": {
        "identity": 58,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "删除用户"
        },
        "elementId": "58"
      }
    },
    {
      "n": {
        "identity": 59,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "揭示学科的领域性知识结构和学习者的认知过程"
        },
        "elementId": "59"
      }
    },
    {
      "n": {
        "identity": 60,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "图谱可 视化技术"
        },
        "elementId": "60"
      }
    },
    {
      "n": {
        "identity": 61,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "图谱存储技术"
        },
        "elementId": "61"
      }
    },
    {
      "n": {
        "identity": 62,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "实体关系挖掘技术"
        },
        "elementId": "62"
      }
    },
    {
      "n": {
        "identity": 63,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "实体识别技术"
        },
        "elementId": "63"
      }
    },
    {
      "n": {
        "identity": 64,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "获取数据源，即导出保存知识论坛半结构化数据"
        },
        "elementId": "64"
      }
    },
    {
      "n": {
        "identity": 65,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "核心实体进行提取"
        },
        "elementId": "65"
      }
    },
    {
      "n": {
        "identity": 66,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "Neo4j 图数据库"
        },
        "elementId": "66"
      }
    },
    {
      "n": {
        "identity": 67,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "构词模式提取 上下位关系"
        },
        "elementId": "67"
      }
    },
    {
      "n": {
        "identity": 68,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "提取关联关系"
        },
        "elementId": "68"
      }
    },
    {
      "n": {
        "identity": 69,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "实体关系抽取"
        },
        "elementId": "69"
      }
    },
    {
      "n": {
        "identity": 70,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "知识图谱的存储"
        },
        "elementId": "70"
      }
    },
    {
      "n": {
        "identity": 71,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "概率性关联规则"
        },
        "elementId": "71"
      }
    },
    {
      "n": {
        "identity": 72,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "条件随机场 CRF"
        },
        "elementId": "72"
      }
    },
    {
      "n": {
        "identity": 73,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "LSA 算法、SVD 算法、余弦 距离计算相似度"
        },
        "elementId": "73"
      }
    },
    {
      "n": {
        "identity": 74,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "皮尔逊相关系数，术语文档矩阵"
        },
        "elementId": "74"
      }
    },
    {
      "n": {
        "identity": 75,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "Open IE 系统、共现分析、文 本特征、幻灯片结构特征"
        },
        "elementId": "75"
      }
    },
    {
      "n": {
        "identity": 76,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "幻灯片文本位置、文本特 征、语法树"
        },
        "elementId": "76"
      }
    },
    {
      "n": {
        "identity": 77,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "多维尺度法、遗传算法"
        },
        "elementId": "77"
      }
    },
    {
      "n": {
        "identity": 78,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "TF-IDF、VSM、相似度 计算"
        },
        "elementId": "78"
      }
    },
    {
      "n": {
        "identity": 79,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "决策树分类器"
        },
        "elementId": "79"
      }
    },
    {
      "n": {
        "identity": 80,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "TF-IDF"
        },
        "elementId": "80"
      }
    },
    {
      "n": {
        "identity": 81,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "关系提取"
        },
        "elementId": "81"
      }
    },
    {
      "n": {
        "identity": 82,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "实体识别"
        },
        "elementId": "82"
      }
    },
    {
      "n": {
        "identity": 83,
        "labels": [
          "entity"
        ],
        "properties": {
          "name": "数据源"
        },
        "elementId": "83"
      }
    },
    {
      "n": {
        "identity": 84,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "数据查询语言，用来查询数据库中表的记录"
        },
        "elementId": "84"
      }
    },
    {
      "n": {
        "identity": 85,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "数据控制语言，用来创建数据库用户、控制数据库的 访问权限"
        },
        "elementId": "85"
      }
    },
    {
      "n": {
        "identity": 86,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "数据操作语言，用来对数据库表中的数据进行增删改"
        },
        "elementId": "86"
      }
    },
    {
      "n": {
        "identity": 87,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "数据定义语言，用来定义数据库对象(数据库，表， 字段)"
        },
        "elementId": "87"
      }
    },
    {
      "n": {
        "identity": 88,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "操作关系型数据库的编程语言，定义了一套操作 关系型数据库统一 标准"
        },
        "elementId": "88"
      }
    },
    {
      "n": {
        "identity": 89,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "操纵和管理数据库的大型软件"
        },
        "elementId": "89"
      }
    },
    {
      "n": {
        "identity": 90,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "存储数据的仓库，数据是有组织的进行存储"
        },
        "elementId": "90"
      }
    },
    {
      "n": {
        "identity": 91,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "部 分 是 竞赛 篇 〈 第 9 一 11 章 )， 涉 及 竞赛 中 常用 的 其 他 知识 点 和 技巧 。 和 前 两 部 分 相 比 ， 第 3 部 分 涉及 的 内 容 更 加 广泛 ， 其 中 还包括 一 些难以 理解 的 “学 术 内 容 ”， 但 其 实 这 些 才 是 算法 的 精 艇 。"
        },
        "elementId": "91"
      }
    },
    {
      "n": {
        "identity": 92,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "部 分 是 算法 篇 (第 5 一 8 章 )， 在 介绍 算法 的 同时 继续 强化语言 ， 补 充 了 第 1 部 分 没有 涉及 的 语言 特性 ， 如 位 运算 、 动 态内 存 管理等， 并 延续 第 一 部 分 的 风格 ， 在 需要 时 引入 更 多 的 思想 和 技巧 。 学 习 完 前 两 部 分 的 读者 应 当 可 以 完成 相当 数量 的 练习 题"
        },
        "elementId": "92"
      }
    },
    {
      "n": {
        "identity": 93,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "部 分 是 语言 篇 (第 1一 4 章 )， 纯 粹 介绍 语言 ， 几 乎 不 涉及 算法 ， 但 逐步 引入 一 些 工 程 性 的 东西 ， 如 测试 、 断 言 、 擅 代码 和 迭代 开发 等 。"
        },
        "elementId": "93"
      }
    },
    {
      "n": {
        "identity": 94,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "证明：对于任意集合A, B, C，有(A − B) − C = (A − C) − (B − C). 证明：∀x，有: x ∈ (A − C) − (B − C) ⇔ x ∈ (A − C) ∧ x / ∈ (B − C) ⇔ (x ∈ A ∧ x / ∈ C) ∧ ¬(x ∈ B ∧ x / ∈ C) ⇔ (x ∈ A ∧ x / ∈ C) ∧ (x / ∈ B ∨ x ∈ C) ⇔ (x ∈ A ∧ x / ∈B∧x / ∈ C) ∨ (x ∈ A ∧ x / ∈ C ∧ x ∈ C) ⇔x∈A∧x / ∈B∧x / ∈C ⇔ x ∈ (A − B) − C 所以有：(A − B) − C = (A − C) − (B − C)."
        },
        "elementId": "94"
      }
    },
    {
      "n": {
        "identity": 95,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "证明：对于任意集合A和B，P(A) ∩ P(B) = P(A ∩ B). 证明：设∀x ∈ P(A) ∩ P(B)，有： x ∈ P(A) ∩ P(B) ⇔ x ∈ P(A) ∧ x ∈ P(B) x⊆A∧x⊆B⇔x⊆A∩B x ∈ P(A ∩ B)"
        },
        "elementId": "95"
      }
    },
    {
      "n": {
        "identity": 96,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "再由右边证明左边 ∀x ∈ (A ∩ B) ∪ C，有 x ∈ (A ∩ B) ∪ C ⇔ x ∈ A ∩ B ∨ x ∈ C ⇔ (x ∈ A ∧ x ∈ B) ∨ x ∈ C ⇔ (x ∈ A ∨ x ∈ C) ∧ (x ∈ B ∨ x ∈ C) ⇔ x ∈ A ∧ (x ∈ B ∨ x ∈ C) ⇔ x ∈ A ∩ (B ∪ C)"
        },
        "elementId": "96"
      }
    },
    {
      "n": {
        "identity": 97,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "证明对于任意集合A, B, C，有: (A ∩ B) ∪ C = A ∩ (B ∪ C) iff C ⊆ A. 证明：先由左边证明右边 ∀x ∈ C，有x ∈ (A ∩ B) ∪ C ∵ (A ∩ B) ∪ C = A ∩ (B ∪ C) ∴ x ∈ A ∩ (B ∪ C) ∴x∈A∧x∈B∪C ∴x∈A ∴ C ⊆ A."
        },
        "elementId": "97"
      }
    },
    {
      "n": {
        "identity": 98,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "证明：(A ⊕ B) ⊕ C = A ⊕ (B ⊕ C). 证明：设a, b, c分别表示∀x(x ∈ A)、∀x(x ∈ B)、∀x(x ∈ C)，则∀x，有： x ∈ (A ⊕ B) ⊕ C ⇔ (x ∈ A ⊕ B ∧ x / ∈ C) ∨ (x / ∈ A ⊕ B ∧ x ∈ C) ⇔ (((a ∧ ¬b) ∨ (¬a ∧ b)) ∧ ¬c) ∨ (¬((a ∧ ¬b) ∨ (¬a ∧ b)) ∧ c) ⇔ (¬a ∧ ¬b ∧ c) ∨ (¬a ∧ b¬c) ∨ (a ∧ ¬b ∧ ¬c) ∨ (a ∧ b ∧ c) ⇔ m1 ∨ m2 ∨ m4 ∨ m7 x ∈ A ⊕ (B ⊕ C) ⇔ · · · ⇔ (¬a ∧ ¬b ∧ c) ∨ (¬a ∧ b¬c) ∨ (a ∧ ¬b ∧ ¬c) ∨ (a ∧ b ∧ c) ⇔ m1 ∨ m2 ∨ m4 ∨ m7 ∴ (A ⊕ B) ⊕ C = A ⊕ (B ⊕ C)"
        },
        "elementId": "98"
      }
    },
    {
      "n": {
        "identity": 99,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "求证：A ∩ (B ⊕ C) = (A ∩ B) ⊕ (A ∩ C) 证明： 右边 = ((A ∩ B)∩ ∼ (A ∩ C)) ∪ (∼ (A ∩ B) ∩ (A ∩ C)) = ((A ∩ B) ∩ (∼ A∪ ∼ C)) ∪ ((∼ A∪ ∼ B) ∩ (A ∩ C)) = (A ∩ B∩ ∼ A) ∪ (A ∩ B∩ ∼ C) ∪ (A ∩ C∩ ∼ A) ∪ (A ∩ C∩ ∼ B) = (A ∩ B∩ ∼ C) ∪ (A ∩ C∩ ∼ B) = A ∩ ((B∩ ∼ C) ∪ (∼ B ∩ C)) = A ∩ ((B − C) ∪ (C − B)) = A ∩ (B ⊕ C)"
        },
        "elementId": "99"
      }
    },
    {
      "n": {
        "identity": 100,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "错位排列的计数问题: 设i1i2 · · · in是1, 2, · · · , n这n个数的排列. 如果 排在第i位的数都不等于i，其中i = 1, 2, · · · , n，则称这个排列为错位排 列. 将n个数的不同错位排列个数记作Dn，证 明Dn = n! [1 − 1 1! + 1 2! − · · · + (−1)n 1 n! ] 证明: 先划分集合，设第i位刚好是i的排列的集合为Ai， 则|Ai| = (n − 1)! 则Dn = |A1 ∩ A2 · · · ∩An|，根据包含排斥原理，有 Dn = n! − n(n − 1)! + C2 n(n − 2)! − C3 n(n − 3)! + · · · + (−1)nCn n = Dn = n! [ 1− 1 1! + 1 2! − · · · + (−1)n 1 n! ]"
        },
        "elementId": "100"
      }
    },
    {
      "n": {
        "identity": 101,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "某班有25名学生，其中12人会打排球，6人会打网球，14人会打篮 球，6人会打排球和篮球，5人会打网球和篮球，还有2人会打3种球. 而会打网球的人都会打另一种球，求不会打这3种球的人数. 解: 设会打排球、网球和篮球的学生集合分别为A、B和C，则有 |A| = 12,|B| = 6,|C| = 14,|S| = 25 |A ∩ C| = 6,|B ∩ C| = 5,|A ∩ B ∩ C| = 2 根据“6个会打网球的人都会打另一种球”，推算 出|A ∩ B| = (6 − 5) + 2 = 3 ∴ |A ∩ B ∩ C| = 25 − (12 + 6 + 14) + (6 + 5 + 3) − 2 = 5"
        },
        "elementId": "101"
      }
    },
    {
      "n": {
        "identity": 102,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "2个集合: |A1 ∩ A2| = |S| − (|A1| + |A2|) + |A1 ∩ A2| 3个集合: |A1 ∩ A2 ∩ A3| = |S| − (|A1| + |A2| + |A3|) + (|A1 ∩ A2| + |A1 ∩ A3| + |A2 ∩ A3|) − |A1 ∩ A2 ∩ A3|"
        },
        "elementId": "102"
      }
    },
    {
      "n": {
        "identity": 103,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "有100名学生，其中47名选修了Java语言，35名选修了网络安 全，23名同时选修了这两门课，问有多少学生这两门课都没有选 修？ 解: 设A和B分别代表选修了Java语言和选修了网络安全课的学生 集合，则有 |A − B| = |A| − |A ∩ B| = 47 − 23 = 24 |B − A| = |B| − |A ∩ B| = 35 − 23 = 12 ∴ |A ∪ B| = 24 + 23 + 12 = 59 ∴ | ∼ (A ∪ B)| = 100 − 59 = 41"
        },
        "elementId": "103"
      }
    },
    {
      "n": {
        "identity": 104,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "设A = {{a}, {a, b}}，计算∪ ∪ A，∩ ∩ A和∩ ∪ A ∪ (∪ ∪ A − ∪ ∩ A). 解： ∪A = {a, b}，∩A = {a} ∪ ∪ A = a ∪ b，∩ ∩ A = a ∪ ∩ A = a，∩ ∪ A = a ∩ b ∩ ∪ A ∪ (∪ ∪ A − ∪ ∩ A) = (a ∩ b) ∪ ((a ∪ b) − a) = (a ∩ b) ∪ (b − a) = b"
        },
        "elementId": "104"
      }
    },
    {
      "n": {
        "identity": 105,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "设A = {0, 1, 2}, B = {2, 3}，则有： A ⊕ B = {0, 1} ∪ {3} = {0, 1, 3} A ⊕ B = {0, 1, 2, 3} − {2} = {0, 1, 3}"
        },
        "elementId": "105"
      }
    },
    {
      "n": {
        "identity": 106,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "n元集的所有子集的个数为:C0 n + C1 n + C2 n + · · · + Cn n = 2n."
        },
        "elementId": "106"
      }
    },
    {
      "n": {
        "identity": 107,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "求集合A = {a, b, c}的全部子集 0元子集，Ø,有C0 3 个. 1元子集，{a}, {b}, {c}，有C1 3 个. 2元子集，{a, b}, {a, c}, {b, c}，有C2 3 个. 3元子集，{a, b, c}，有C3 3 个."
        },
        "elementId": "107"
      }
    },
    {
      "n": {
        "identity": 108,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "C = {a, {a}, b, c, {{d}}, {d, e}}"
        },
        "elementId": "108"
      }
    },
    {
      "n": {
        "identity": 109,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "列举法，列出所有的元素，如A = {1, 2, 3, 4} 概括法，给出集合中元素的属性，如B = {x|x = 2k, k = 1, 2, · · · }"
        },
        "elementId": "109"
      }
    },
    {
      "n": {
        "identity": 110,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "N: 自然数集(包括0). Z, Q, R, C分别代表整数集、有理数集、实数集和复数集."
        },
        "elementId": "110"
      }
    },
    {
      "n": {
        "identity": 111,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "所有自然数构成的集合. 广工所有男生构成的集合. 所有英文单词构成的集合."
        },
        "elementId": "111"
      }
    },
    {
      "n": {
        "identity": 112,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "无向图"
        },
        "elementId": "112"
      }
    },
    {
      "n": {
        "identity": 113,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "权威资料"
        },
        "elementId": "113"
      }
    },
    {
      "n": {
        "identity": 114,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "半 结构化数据"
        },
        "elementId": "114"
      }
    },
    {
      "n": {
        "identity": 115,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "结构化数据"
        },
        "elementId": "115"
      }
    },
    {
      "n": {
        "identity": 116,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "复杂关系"
        },
        "elementId": "116"
      }
    },
    {
      "n": {
        "identity": 117,
        "labels": [
          "description"
        ],
        "properties": {
          "name": "知识实体"
        },
        "elementId": "117"
      }
    },
    {
      "n": {
        "identity": 118,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "广东工业大学 自动化学院"
        },
        "elementId": "118"
      }
    },
    {
      "n": {
        "identity": 119,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "DataBase（DB）"
        },
        "elementId": "119"
      }
    },
    {
      "n": {
        "identity": 120,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "DataBase Management System (DBMS)"
        },
        "elementId": "120"
      }
    },
    {
      "n": {
        "identity": 121,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Structured Query Language (SQL)"
        },
        "elementId": "121"
      }
    },
    {
      "n": {
        "identity": 122,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Data Definition Language"
        },
        "elementId": "122"
      }
    },
    {
      "n": {
        "identity": 123,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Data Manipulation Language"
        },
        "elementId": "123"
      }
    },
    {
      "n": {
        "identity": 124,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Data Query Language"
        },
        "elementId": "124"
      }
    },
    {
      "n": {
        "identity": 125,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Data Control Language"
        },
        "elementId": "125"
      }
    },
    {
      "n": {
        "identity": 126,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "show databases ;"
        },
        "elementId": "126"
      }
    },
    {
      "n": {
        "identity": 127,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "select database() ;"
        },
        "elementId": "127"
      }
    },
    {
      "n": {
        "identity": 128,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "create database [ if not exists ] 数据库名 [ default charset 字符集 ] [ collate 排序 规则 ] ;"
        },
        "elementId": "128"
      }
    },
    {
      "n": {
        "identity": 129,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "drop database [ if exists ] 数据库名 ;"
        },
        "elementId": "129"
      }
    },
    {
      "n": {
        "identity": 130,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "use 数据库名 ;"
        },
        "elementId": "130"
      }
    },
    {
      "n": {
        "identity": 131,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "show tables;"
        },
        "elementId": "131"
      }
    },
    {
      "n": {
        "identity": 132,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "desc 表名 ;"
        },
        "elementId": "132"
      }
    },
    {
      "n": {
        "identity": 133,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "show create table 表名 ;"
        },
        "elementId": "133"
      }
    },
    {
      "n": {
        "identity": 134,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "CREATE TABLE 表名( 字段1 字段1类型 [ COMMENT 字段1注释 ], 字段2 字段2类型 [COMMENT 字段2注释 ], 字段3 字段3类型 [COMMENT 字段3注释 ], ...... 字段n 字段n类型 [COMMENT 字段n注释 ] ) [ COMMENT 表注释 ] ;"
        },
        "elementId": "134"
      }
    },
    {
      "n": {
        "identity": 135,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "ALTER TABLE 表名 ADD 字段名 类型 (长度) [ COMMENT 注释 ] [ 约束 ];"
        },
        "elementId": "135"
      }
    },
    {
      "n": {
        "identity": 136,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "ALTER TABLE 表名 MODIFY 字段名 新数据类型 (长度);"
        },
        "elementId": "136"
      }
    },
    {
      "n": {
        "identity": 137,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "ALTER TABLE 表名 CHANGE 旧字段名 新字段名 类型 (长度) [ COMMENT 注释 ] [ 约束 ];"
        },
        "elementId": "137"
      }
    },
    {
      "n": {
        "identity": 138,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "ALTER TABLE 表名 DROP 字段名;"
        },
        "elementId": "138"
      }
    },
    {
      "n": {
        "identity": 139,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "ALTER TABLE 表名 RENAME TO 新表名;"
        },
        "elementId": "139"
      }
    },
    {
      "n": {
        "identity": 140,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "DROP TABLE [ IF EXISTS ] 表名;"
        },
        "elementId": "140"
      }
    },
    {
      "n": {
        "identity": 141,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "INSERT INTO 表名 (字段名1, 字段名2, ...) VALUES (值1, 值2, ...);"
        },
        "elementId": "141"
      }
    },
    {
      "n": {
        "identity": 142,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "INSERT INTO 表名 VALUES (值1, 值2, ...);"
        },
        "elementId": "142"
      }
    },
    {
      "n": {
        "identity": 143,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "INSERT INTO 表名 VALUES (值1, 值2, ...), (值1, 值2, ...), (值1, 值2, ...) ;"
        },
        "elementId": "143"
      }
    },
    {
      "n": {
        "identity": 144,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "UPDATE 表名 SET 字段名1 = 值1 , 字段名2 = 值2 , .... [ WHERE 条件 ] ;"
        },
        "elementId": "144"
      }
    },
    {
      "n": {
        "identity": 145,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "DELETE FROM 表名 [ WHERE 条件 ] ;"
        },
        "elementId": "145"
      }
    },
    {
      "n": {
        "identity": 146,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "SELECT 字段1, 字段2, 字段3 ... FROM 表名 ;"
        },
        "elementId": "146"
      }
    },
    {
      "n": {
        "identity": 147,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "SELECT 字段1 [ 别名1 ] , 字段2 [ 别名2 ] ... FROM 表名;"
        },
        "elementId": "147"
      }
    },
    {
      "n": {
        "identity": 148,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "SELECT DISTINCT 字段列表 FROM 表名;"
        },
        "elementId": "148"
      }
    },
    {
      "n": {
        "identity": 149,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "SELECT 字段列表 FROM 表名 WHERE 条件列表 ;"
        },
        "elementId": "149"
      }
    },
    {
      "n": {
        "identity": 150,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "SELECT 字段列表 FROM 表名 [ WHERE 条件 ] GROUP BY 分组字段名 [ HAVING 分组 后过滤条件 ];"
        },
        "elementId": "150"
      }
    },
    {
      "n": {
        "identity": 151,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "select * from mysql.user;"
        },
        "elementId": "151"
      }
    },
    {
      "n": {
        "identity": 152,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "CREATE USER '用户名'@'主机名' IDENTIFIED BY '密码';"
        },
        "elementId": "152"
      }
    },
    {
      "n": {
        "identity": 153,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "ALTER USER '用户名'@'主机名' IDENTIFIED WITH mysql_native_password BY '新密码' ;"
        },
        "elementId": "153"
      }
    },
    {
      "n": {
        "identity": 154,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "DROP USER '用户名'@'主机名' ;"
        },
        "elementId": "154"
      }
    },
    {
      "n": {
        "identity": 155,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "可以将学位论文的全部或部分内容编入有关数据库 进行检索，并采用影印、缩印或扫描等复制手段保存、"
        },
        "elementId": "155"
      }
    },
    {
      "n": {
        "identity": 156,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "料。对本文的研究做出重要贡献的个人和集体，均已在 论文中作了明确的说明并表示了谢意。本人完全意"
        },
        "elementId": "156"
      }
    },
    {
      "n": {
        "identity": 157,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "集合运算的主要算律(部分) 分配律 A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C) A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C) 排中律: A∪ ∼ A = E 吸收律: A ∪ (A ∩ B) = A, A ∩ (A ∪ B) = A 德.摩根律 A − (B ∪ C) = (A − B) ∩ (A − C) A − (B ∩ C) = (A − B) ∪ (A − C) ∼ (B ∪ C) =∼ B∩ ∼ C ∼ (B ∪ C) =∼ B∩ ∼ C ∼ Ø = E, ∼ E = Ø"
        },
        "elementId": "157"
      }
    },
    {
      "n": {
        "identity": 158,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "(包含排斥原理) 设S为有穷集，P1, P2, · · · , Pn是n个性质，S中的任何元素x或者具有性 质Pi，或者不具有性质Pi，两种情况必居其一. 令Ai表示S中具有性 质Pi的元素构成的子集，则S中不具有性质P1, P2, · · · , Pn的元素个数是: |A1 ∩ A2 ∩ · · · An| = |S| − n ∑ i=1 |Ai| + ∑ 1≤i<j≤n |Ai ∩ Aj| − ∑ 1≤i<j<k≤n |Ai ∩ Aj ∩ Ak| + · · · + (−1)n|A1 ∩ A2 ∩ · · · ∩ An|"
        },
        "elementId": "158"
      }
    },
    {
      "n": {
        "identity": 159,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "广义交：设A为非空集合，A的所有元素的公共元素构成的集合称 作A的广义交，记作∩A，符号化为： ∩A = {x|∀z(z ∈ A → x ∈ z)}"
        },
        "elementId": "159"
      }
    },
    {
      "n": {
        "identity": 160,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "广义并：设A为集合，A的元素的元素构成的集合称作A的广义 并，记作∪A，符号化为： ∪A = {x|∃z(z ∈ A ∧ x ∈ z)}"
        },
        "elementId": "160"
      }
    },
    {
      "n": {
        "identity": 161,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "对称差：A ⊕ B = (A − B) ∪ (B − A) 对称差的另一种定义: A ⊕ B = (A − B) ∪ (B − A) = (A ∪ B) − (A ∩ B)"
        },
        "elementId": "161"
      }
    },
    {
      "n": {
        "identity": 162,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "并集: A ∪ B = {x|x ∈ A ∨ x ∈ B}. 交集: A ∩ B = {x|x ∈ A ∧ x ∈ B}. 相对补集(差): A − B = {x|x ∈ A ∧ x / ∈ B}. 绝对补集: ∼ A = E − A = {x|x ∈ E ∧ x / ∈ A}. 多个集合的并: n ⋃ i=1 Ai = A1 ∪ A2 ∪ · · · ∪ An 多个集合的交: n ⋂ i=1 Ai = A1 ∩ A2 ∩ · · · ∩ An 推广到无穷多个集合的并和交: ∞ ⋃ i=1 Ai, ∞ ⋂ i=1 Ai"
        },
        "elementId": "162"
      }
    },
    {
      "n": {
        "identity": 163,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "在一个具体问题中，如果所涉及的集合都是某个集合的子集，则称这 个集合为全全全集集集，记作E或U"
        },
        "elementId": "163"
      }
    },
    {
      "n": {
        "identity": 164,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "设A为集合，把A的全体子集构成的集合称作A的幂集，记作P(A)或2A. 记作P(A) = {x|x ⊆ A}"
        },
        "elementId": "164"
      }
    },
    {
      "n": {
        "identity": 165,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "不含任何元素的集合称作空空空集集集，记作Ø. 空集的形式化表示 为Ø = {x|x 6= x}"
        },
        "elementId": "165"
      }
    },
    {
      "n": {
        "identity": 166,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "设A, B为集合，如果B ⊆ A且B 6= A，则称B是A的真真真子子子集集集，记作B ⊂ A"
        },
        "elementId": "166"
      }
    },
    {
      "n": {
        "identity": 167,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "设A, B为集合，如果B中的每个元素都是A中的元素，则称B为A的子子子 集集集，记作B ⊆ A，也称A包含B或B被A包含"
        },
        "elementId": "167"
      }
    },
    {
      "n": {
        "identity": 168,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "把一些事物汇集到一起组 成一个整体就称作集集集合合合，而这些事物就是这个集合的元元元素素素或成成成员员员"
        },
        "elementId": "168"
      }
    },
    {
      "n": {
        "identity": 169,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "KB 话语探测 器"
        },
        "elementId": "169"
      }
    },
    {
      "n": {
        "identity": 170,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "观点线索地图"
        },
        "elementId": "170"
      }
    },
    {
      "n": {
        "identity": 171,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "知识论坛"
        },
        "elementId": "171"
      }
    },
    {
      "n": {
        "identity": 172,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "知识建构"
        },
        "elementId": "172"
      }
    },
    {
      "n": {
        "identity": 173,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "SSM 设计"
        },
        "elementId": "173"
      }
    },
    {
      "n": {
        "identity": 174,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Bootstrap"
        },
        "elementId": "174"
      }
    },
    {
      "n": {
        "identity": 175,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "模型 LDA"
        },
        "elementId": "175"
      }
    },
    {
      "n": {
        "identity": 176,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Echarts"
        },
        "elementId": "176"
      }
    },
    {
      "n": {
        "identity": 177,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Neo4j"
        },
        "elementId": "177"
      }
    },
    {
      "n": {
        "identity": 178,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "Word2vec"
        },
        "elementId": "178"
      }
    },
    {
      "n": {
        "identity": 179,
        "labels": [
          "grammar"
        ],
        "properties": {
          "name": "TFIDF 算法"
        },
        "elementId": "179"
      }
    },
    {
      "n": {
        "identity": 180,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "数据库"
        },
        "elementId": "180"
      }
    },
    {
      "n": {
        "identity": 181,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "系统"
        },
        "elementId": "181"
      }
    },
    {
      "n": {
        "identity": 182,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "数据库语句"
        },
        "elementId": "182"
      }
    },
    {
      "n": {
        "identity": 183,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "183"
      }
    },
    {
      "n": {
        "identity": 184,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "184"
      }
    },
    {
      "n": {
        "identity": 185,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "185"
      }
    },
    {
      "n": {
        "identity": 186,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "SQL"
        },
        "elementId": "186"
      }
    },
    {
      "n": {
        "identity": 187,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "187"
      }
    },
    {
      "n": {
        "identity": 188,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "188"
      }
    },
    {
      "n": {
        "identity": 189,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "189"
      }
    },
    {
      "n": {
        "identity": 190,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "190"
      }
    },
    {
      "n": {
        "identity": 191,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "191"
      }
    },
    {
      "n": {
        "identity": 192,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "192"
      }
    },
    {
      "n": {
        "identity": 193,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "193"
      }
    },
    {
      "n": {
        "identity": 194,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "194"
      }
    },
    {
      "n": {
        "identity": 195,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "195"
      }
    },
    {
      "n": {
        "identity": 196,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "196"
      }
    },
    {
      "n": {
        "identity": 197,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "197"
      }
    },
    {
      "n": {
        "identity": 198,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "198"
      }
    },
    {
      "n": {
        "identity": 199,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "199"
      }
    },
    {
      "n": {
        "identity": 200,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "200"
      }
    },
    {
      "n": {
        "identity": 201,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DDL"
        },
        "elementId": "201"
      }
    },
    {
      "n": {
        "identity": 202,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "202"
      }
    },
    {
      "n": {
        "identity": 203,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "203"
      }
    },
    {
      "n": {
        "identity": 204,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "204"
      }
    },
    {
      "n": {
        "identity": 205,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "205"
      }
    },
    {
      "n": {
        "identity": 206,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DML"
        },
        "elementId": "206"
      }
    },
    {
      "n": {
        "identity": 207,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "207"
      }
    },
    {
      "n": {
        "identity": 208,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "208"
      }
    },
    {
      "n": {
        "identity": 209,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "209"
      }
    },
    {
      "n": {
        "identity": 210,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "210"
      }
    },
    {
      "n": {
        "identity": 211,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DQL"
        },
        "elementId": "211"
      }
    },
    {
      "n": {
        "identity": 212,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "212"
      }
    },
    {
      "n": {
        "identity": 213,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "213"
      }
    },
    {
      "n": {
        "identity": 214,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "214"
      }
    },
    {
      "n": {
        "identity": 215,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "DCL"
        },
        "elementId": "215"
      }
    },
    {
      "n": {
        "identity": 216,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": ""
        },
        "elementId": "216"
      }
    },
    {
      "n": {
        "identity": 217,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "每一页固定大小为16kb，B+树相比红黑树所存储的节点更多，因此页的层级更少，提高查询效率，减小占用空间"
        },
        "elementId": "217"
      }
    },
    {
      "n": {
        "identity": 218,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "这是注释的测试"
        },
        "elementId": "218"
      }
    },
    {
      "n": {
        "identity": 219,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "另 一 种思路 是 把 a、b、e 这 3 个 变量 本 身 改 成 a 和 b<e 的 形式 。 首 先 检 查 a 和 的 值 ， 如 果 a>b， 则 交换 a 和 b (利用 前 面 讲 过的 三 变量 交换 法 ) ， 接下 来检查 a 和 c， 最 后 检查 b 和 c， 程"
        },
        "elementId": "219"
      }
    },
    {
      "n": {
        "identity": 220,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "读者 也 许 发 现 了 ， 如 果 a 为 真 ， 则 无 论 b 的 值 如 何，a ||b 均 为 真 。 换 句 话 说， 一 旦 发 现 a 为 真 ,就不 必 计 算 b 的"
        },
        "elementId": "220"
      }
    },
    {
      "n": {
        "identity": 221,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "异 或 运算 ^ 代 替 加 法 和 减法 ， 它 还 可 以 进一步 简写 成 ae =~b^=a^=b。"
        },
        "elementId": "221"
      }
    },
    {
      "n": {
        "identity": 222,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "可 以 将 这 种 方法 形象 地 比喻成 将 一 瓶 着 油 和 一 瓶 醋 借 助 一 个 空 瓶子 进行 交换 : 先 把 交 油 倒入 空 瓶 ， 然 后 将 醋 倒 进 原 来 的 次 油 瓶 中 ， 最 后 把 酱油 从 辅助 的 瓶子 中 倒 入 原来 的 酯 瓶 子 里 。 这 样 的 比喻 虽然形象 ， 但 是 初学 者 应当 注 意 它 和 真正 的 变量 交换 的 区 别 。"
        },
        "elementId": "222"
      }
    },
    {
      "n": {
        "identity": 223,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "算 法竞赛 的 程序 应 当 只 做 3 件 事情 : 读 入 数据 、 计 算 结 果 、 打 印 输出 。 不 要 打印 提示信息 ，"
        },
        "elementId": "223"
      }
    },
    {
      "n": {
        "identity": 224,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "其 次， 不 要 让 程序 “ 按任意 键 退出 ”例如 调用 system(“pause”)， 或 者 加 一个多余 的 getchar0) ，因 为 不 会 有 人 来“ 按 任意 键 ” 的 。 不 少 早期 的 C 语言 教材 会 建议 在 程序 的 最 后 加 这 样 一 条 语句 来 “观察 输出结果 ”， 但 注意 千 万 不要 在 算法竞赛 中 这 样 做"
        },
        "elementId": "224"
      }
    },
    {
      "n": {
        "identity": 225,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "数 先“变 ”成 浮 点 数 ， 然 后 浮 点 数 - 浮 点 数 = 浮 点 数"
        },
        "elementId": "225"
      }
    },
    {
      "n": {
        "identity": 226,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "，8/5 的 确切含义 是 8 除 以 5 所 得 商 值 的 整数 部"
        },
        "elementId": "226"
      }
    },
    {
      "n": {
        "identity": 227,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "算 法 竞赛 的 核心 是 算法 。"
        },
        "elementId": "227"
      }
    },
    {
      "n": {
        "identity": 228,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "我 曾 考虑 过 把 C 语言 和 算 法分 开讲 解， 一 本 书 讲 语言 ， 另 一 本书 讲 基础 算法 。 但 后 来 我 发 现， 其 实二 者 难以分 开 。"
        },
        "elementId": "228"
      }
    },
    {
      "n": {
        "identity": 229,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "但 语言 毕竟只 是算法 竞赛 的 工具"
        },
        "elementId": "229"
      }
    },
    {
      "n": {
        "identity": 230,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "我 开始 庆幸 自己 先 学 的 是 C 语言 一 一 在 我 购买 的 各 类 技术 书籍 中 ， 几乎全 部 使 用 的 是 C 语言 而 不 是 Pascal 语言 ， 尽 管 偶尔 有 用 Delphi 的 文章 ， 但 这 种 语言 似乎 除了 构建 漂亮 的 界面 比较 方便之 外 ， 并 没有 太 多 的 “技术 含量 ”。 我 始终 保持着 对 C 语言 的 熟 悉 ， 而 事实证 明 这 对 我 的 职业 生涯 发 挥 了 巨大 的 作用 。"
        },
        "elementId": "230"
      }
    },
    {
      "n": {
        "identity": 231,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "包含性质的所有元素，且不能重复算，之后再用全集减去这些元素(排斥),得到不含这些性质的所有元素。"
        },
        "elementId": "231"
      }
    },
    {
      "n": {
        "identity": 232,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "注意：集合中的元素可以无序，但不能重复！"
        },
        "elementId": "232"
      }
    },
    {
      "n": {
        "identity": 233,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "红色：所需技术"
        },
        "elementId": "233"
      }
    },
    {
      "n": {
        "identity": 234,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "蓝色：专业名词"
        },
        "elementId": "234"
      }
    },
    {
      "n": {
        "identity": 235,
        "labels": [
          "comment"
        ],
        "properties": {
          "name": "绿色：实体名词"
        },
        "elementId": "235"
      }
    },
    {
      "n": {
        "identity": 236,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "根 据 不 同 的 实 际 需 求 ， 时 态 知 识 图 谱 可 被 表 示 为离散时 态 动 态 图 （ Ｄｉ ｓｃｒｅ ｔ ｅ Ｔ ｅ ｍ ｐ ｏ ｒ ａ ｌ Ｄ ｙ ｎ ａ ｍ ｉ ｃ Ｇ ｒ ａ ｐ ｈ ， 简 称 为 离 散 动 态 图 ） 或 连 续 时 态 动 态 图 （ Ｃ ｏ ｎ ｔ ｉ ｎ ｕ ｏ ｕ ｓ Ｔ ｅ ｍ ｐ ｏ ｒ ａ ｌ Ｄ ｙ ｎ ａ ｍ ｉ ｃ Ｇ ｒ ａ ｐ ｈ ， 简称为 连 续动 态 图 ） 两 种形式 ［ １ 气"
        },
        "elementId": "236"
      }
    },
    {
      "n": {
        "identity": 237,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "知识图谱的构建方法主要有三种方式，即自顶 向下、自底向上和二者混合的方法。其中，业内最常 使用的是自底向上的构建方法，该方法从数据源中 自动或人工提取主题、属性和关系构建知识图谱的 模式。其主要的构建过程按照“知识获取———知识 表 示———知 识 存 储———知 识 可 视 化 ”的 步 骤 进 行［12］，本文在此构建过程的基础上，融入 DIKW 层 次结构的特点形成《山海经》知识图谱构建流程，如 图 3 所示。"
        },
        "elementId": "237"
      }
    },
    {
      "n": {
        "identity": 238,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "知识结构网络化、网络结 构复杂、网络由三元组构成、数据主要由知识库承载 是知识图谱的四大基本特征［2］。"
        },
        "elementId": "238"
      }
    },
    {
      "n": {
        "identity": 239,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "知识抽取则使用ｊｉｅｂａ分词工 具 对 文 献 题 目 进 行 分 词 处 理和词性标注，根据题目词性及内容的特点，为获取海洋 数值预报对象及其研究任务，筛选出题目中包含的名词及 动词，抽取出三 元 组 （名 词， 动 词， 名 词 ） 信 息。"
        },
        "elementId": "239"
      }
    },
    {
      "n": {
        "identity": 240,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "近年来，基于知识图谱的推 荐 中 基 于 嵌 入 的 方 法 越 来 越 受 到 重 视［３］， Ｗａｎｇ 等［４］设 计 ＲｉｐｐｌｅＮｅｔ方法利用从知识图谱中 抽 取 的 实 体 节 点 所 相 连 的 节点嵌入表征来更新用户表征，由此进行推荐结果的预测。"
        },
        "elementId": "240"
      }
    },
    {
      "n": {
        "identity": 241,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "本文基于 Python+Neo4j 搭建了问答系统， 作为人工客服的有益补充，能减缓一线运维人员的工作强度 和压力，提高运维效率和质量。"
        },
        "elementId": "241"
      }
    },
    {
      "n": {
        "identity": 242,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "本文建立了 8 种问句类型，通过提取问句中的疑问 词与用户疑问词分类词典匹配后实现分类。问答系统基于分 类后提取的实体类别和实体进行解析后生成本体三元组，据 此构建 Cyper 语句进行描述，然后发送 Cyper 语句到 neo4j 图数据库查询。然后将查询返回数据与系统匹配提取的答案 模板进行整合，将最终解答回复给用户。"
        },
        "elementId": "242"
      }
    },
    {
      "n": {
        "identity": 243,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "运行语句 :“MATCH (m:Keywords)<- [r:key_words]-(n:Maintenance) where m.name ='OA 移动 ' return distinct n.name, n.desc, n.instructions, n.department,n.telephone, n.cause, n.area, n.correlation”"
        },
        "elementId": "243"
      }
    },
    {
      "n": {
        "identity": 244,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "知识图谱本质上是一种大型、结构化的语义知识库，以 符号形式描述客观世界的概念实体事件及其之间的关系 [11]。 通俗讲：知识图谱是由实体、关系和属性组成的一种数据结构。"
        },
        "elementId": "244"
      }
    },
    {
      "n": {
        "identity": 245,
        "labels": [
          "others"
        ],
        "properties": {
          "name": "算法能力层是所有运维业务管理功能实现的算法支撑， 是根据系统逻辑需要，基于知识图谱方法和数据层实现的实 体三元组抽取、推理过程。"
        },
        "elementId": "245"
      }
    }
  ]
}
// 关系
const rels_check=[['肺泡蛋白质沉积症', '胸部CT检查'], ['肺泡蛋白质沉积症', '肺活检'], ['肺泡蛋白质沉积症', '支气管镜检查'], ['百日咳', '耳、鼻、咽拭子细菌培养'], ['百日咳', '周围血白细胞计数及分类检验'], ['百日咳', '血常规'], ['百日咳', '酶联免疫吸附试验'], ['百日咳', '白细胞分类计数'], ['苯中毒', '血常规'], ['苯中毒', '骨髓象分析'], ['苯中毒', '先令氏指数'], ['喘息样支气管炎', '肺部检查'], ['喘息样支气管炎', '肺和胸膜听诊'], ['喘息样支气管炎', '抗链球菌型M蛋白抗体'], ['喘息样支气管炎', '抗链球菌壁多糖抗体'], ['喘息样支气管炎', '酶联免疫吸附试验'], ['成人呼吸窘迫综合征', '胸部CT检查'], ['成人呼吸窘迫综合征', '呼吸肌功能测定'], ['成人呼吸窘迫综合征', '血浆蛋白C抗原'], ['成人呼吸窘迫综合征', '肺泡气-动脉血氧分压差'], ['成人呼吸窘迫综合征', '肺毛细血管楔压'], ['大量羊水吸入', '肺部检查'], ['大量羊水吸入', '胸部透视'], ['大量羊水吸入', '胸部平片'], ['大量羊水吸入', '胸部CT检查'], ['单纯性肺嗜酸粒细胞浸润症', '痰液中细胞分类'], ['单纯性肺嗜酸粒细胞浸润症', '胸部平片'], ['单纯性肺嗜酸粒细胞浸润症', '痰液中寄生虫和虫卵'], ['大叶性肺炎', 'Optochin敏感试验'], ['大叶性肺炎', '小白鼠毒力试验'], ['大叶性肺炎', '痰培养'], ['大叶性肺炎', '肺活量体重指数'], ['大叶性肺炎', '胸部平片'], ['大叶性肺炎', '免疫电泳'], ['大叶性肺炎', '血常规'], ['大叶性肺炎', '痰液细菌涂片检查'], ['大楼病综合征', '钼靶X线检查'], ['大楼病综合征', 'CT检查'], ['大楼病综合征', '血常规'], ['二硫化碳中毒', '血常规'], ['二硫化碳中毒', '尿常规'], ['二硫化碳中毒', '肾功能检查'], ['二硫化碳中毒', '神经系统检查'], ['二硫化碳中毒', '眼底荧光血管造影'], ['二硫化碳中毒', '肌电图'], ['二硫化碳中毒', '脑电图检查'], ['二硫化碳中毒', '心肺功能运动试验（CPET）'], ['肺-胸膜阿米巴病', '胸部平片'], ['肺-胸膜阿米巴病', '痰液病原体检查'], ['肺出血－肾炎综合征', '痰液常规检查'], ['肺出血－肾炎综合征', '尿液镜检法'], ['肺出血－肾炎综合征', '胸部平片'], ['肺出血－肾炎综合征', '肾功能检查'], ['肺出血－肾炎综合征', '抗肾小球基底膜抗体测定（AGBM）'], ['肺出血－肾炎综合征', '隐血试验与含铁血黄素检查'], ['肺放线菌病', '痰液病原体检查'], ['肺放线菌病', '胸部平片'], ['肺泡蛋白沉着症', '胸部CT检查'], ['肺泡蛋白沉着症', '支气管镜检查'], ['肺泡蛋白沉着症', '肺活检'], ['肺曲菌病', '胸部平片'], ['肺曲菌病', '痰培养'], ['肺曲菌病', '纤维支气管镜检查'], ['肺曲菌病', '胸部CT检查'], ['肺曲菌病', '痰液细菌涂片检查'], ['放射性肺炎', '胸部平片'], ['放射性肺炎', '肺功能检查'], ['放射性肺炎', '通气与血流灌注比值（V/Q）'], ['放射性肺炎', '每分钟最大通气量（MVV）'], ['放射性肺炎', '血常规'], ['肺念珠菌病', '肺量计检测'], ['肺念珠菌病', '胸部平片'], ['肺念珠菌病', '痰液细菌涂片检查'], ['肺大疱', '胸部CT检查'], ['肺大疱', '支气管造影'], ['肺大疱', '胸部平片'], ['肺炎球菌肺炎', '胸部平片'], ['肺炎球菌肺炎', '血常规'], ['肺气肿', '肺量计检测'], ['肺气肿', '残气量／肺总量比值（RV/TLC）'], ['肺气肿', '肺容量测定'], ['肺气肿', '肺活量（VC）'], ['肺气肿', '最大呼气流量-容积曲线（MEFV）'], ['肺气肿', '深吸气量（IC）'], ['肺气肿', '一秒用力呼出量／用力肺活量比值'], ['肺气肿', '心电图'], ['肺气肿', '无效腔气量／潮气量比值'], ['肺气肿', '肺泡气-动脉血氧分压差'], ['肺炎杆菌肺炎', '痰液细菌涂片检查'], ['肺炎杆菌肺炎', '痰液细菌培养'], ['肺炎杆菌肺炎', '血常规']]
const rels_symptom=[['肺泡蛋白质沉积症', '紫绀'], ['肺泡蛋白质沉积症', '胸痛'], ['肺泡蛋白质沉积症', '呼吸困难'], ['肺泡蛋白质沉积症', '乏力'], ['肺泡蛋白质沉积症', '毓卓'], ['百日咳', '吸气时有蝉鸣音'], ['百日咳', '痉挛性咳嗽'], ['百日咳', '胸闷'], ['百日咳', '肺阴虚'], ['百日咳', '抽搐'], ['百日咳', '低热'], ['百日咳', '闫鹏辉'], ['百日咳', '惊厥'], ['苯中毒', '恶心'], ['苯中毒', '抽搐'], ['苯中毒', '感觉障碍'], ['喘息样支气管炎', '耸肩喘息'], ['喘息样支气管炎', '哮鸣音'], ['喘息样支气管炎', '纤毛上皮细胞损伤脱落'], ['喘息样支气管炎', '变应性咳嗽'], ['喘息样支气管炎', '化学性支气管炎'], ['喘息样支气管炎', '喘息'], ['喘息样支气管炎', '冬春季的慢性咳...'], ['喘息样支气管炎', '咳嗽伴哮鸣音'], ['成人呼吸窘迫综合征', '呼吸困难'], ['成人呼吸窘迫综合征', '紫绀'], ['成人呼吸窘迫综合征', '心源性呼吸窘迫'], ['大量羊水吸入', '面色青紫'], ['大量羊水吸入', '呼吸困难'], ['大量羊水吸入', '口唇青紫'], ['大量羊水吸入', '肺纹理增粗'], ['大量羊水吸入', '出生后即有持续青紫'], ['大量羊水吸入', '口唇和甲床略带青紫'], ['大量羊水吸入', '气急'], ['单纯性肺嗜酸粒细胞浸润症', '嗜酸性粒细胞增多'], ['单纯性肺嗜酸粒细胞浸润症', '咽部异物感'], ['单纯性肺嗜酸粒细胞浸润症', '胸闷憋气'], ['单纯性肺嗜酸粒细胞浸润症', '咯血伴发热'], ['单纯性肺嗜酸粒细胞浸润症', '胸闷'], ['单纯性肺嗜酸粒细胞浸润症', '乏力'], ['大叶性肺炎', '湿啰音'], ['大叶性肺炎', '胸痛'], ['大叶性肺炎', '发烧'], ['大叶性肺炎', '咳铁锈色痰'], ['大叶性肺炎', '急性面容'], ['大叶性肺炎', '呼吸音减弱'], ['大楼病综合征', '紧张性头晕'], ['大楼病综合征', '紧张性头痛'], ['大楼病综合征', '间歇性头晕'], ['大楼病综合征', '鼻塞'], ['大楼病综合征', '头晕'], ['大楼病综合征', '恶心'], ['大楼病综合征', '眼睛痒'], ['大楼病综合征', '目赤'], ['大楼病综合征', '间歇性头痛'], ['二硫化碳中毒', '昏迷'], ['二硫化碳中毒', '腱反射消失'], ['二硫化碳中毒', '呕吐'], ['二硫化碳中毒', '谵妄'], ['二硫化碳中毒', '多发性神经炎'], ['二硫化碳中毒', '浅感觉减退或缺失'], ['二硫化碳中毒', '恶心'], ['二硫化碳中毒', '感觉障碍'], ['肺-胸膜阿米巴病', '盗汗'], ['肺-胸膜阿米巴病', '腹泻'], ['肺-胸膜阿米巴病', '乏力'], ['肺-胸膜阿米巴病', '发热伴咳嗽、咯...'], ['肺出血－肾炎综合征', '肺部出血'], ['肺出血－肾炎综合征', '呼吸困难'], ['肺出血－肾炎综合征', '咯血'], ['肺出血－肾炎综合征', '气短'], ['肺出血－肾炎综合征', '发热伴咳嗽、咯...'], ['肺出血－肾炎综合征', '蛋白尿'], ['肺放线菌病', '骨膜炎'], ['肺放线菌病', '体重减轻'], ['肺放线菌病', '咯血'], ['肺放线菌病', '盗汗'], ['肺放线菌病', '乏力'], ['肺放线菌病', '低热'], ['肺泡蛋白沉着症', '胸痛'], ['肺泡蛋白沉着症', '紫绀'], ['肺泡蛋白沉着症', '呼吸困难'], ['肺泡蛋白沉着症', '肺泡炎症'], ['肺泡蛋白沉着症', '肺泡灌洗液可见...'], ['肺泡蛋白沉着症', '乏力'], ['肺泡蛋白沉着症', '发热伴咳嗽、咯...'], ['肺曲菌病', '咳出棕色痰栓'], ['肺曲菌病', '嗜酸性粒细胞增多'], ['肺曲菌病', '胸痛'], ['放射性肺炎', '闫铁'], ['放射性肺炎', '肺纤维化'], ['放射性肺炎', '胸痛'], ['放射性肺炎', '低热'], ['肺念珠菌病', '痰呈粘液脓性'], ['肺念珠菌病', '肺部啰音'], ['肺大疱', '胸闷'], ['肺大疱', '气短'], ['肺大疱', '胸闷憋气'], ['肺大疱', '发热伴咳嗽、咯...'], ['肺炎球菌肺炎', '痰中带血丝'], ['肺炎球菌肺炎', '咳嗽伴胸痛'], ['肺炎球菌肺炎', '胸痛'], ['肺炎球菌肺炎', '发热伴咳嗽、咯...'], ['肺气肿', '纵隔浊音界扩大'], ['肺气肿', '桶状胸'], ['肺气肿', '小支气管粘膜水肿'], ['肺气肿', '黏稠或脓性痰伴...'], ['肺气肿', '横膈低平'], ['肺气肿', '胸闷'], ['肺气肿', '呼气音延长'], ['肺气肿', '肺部啰音'], ['肺气肿', '呼吸音减弱'], ['肺炎杆菌肺炎', '畏寒'], ['肺炎杆菌肺炎', '胸痛'], ['肺炎杆菌肺炎', '气急'], ['肺炎杆菌肺炎', '发热伴咳嗽、咯...']]
const rels_acompany=[['肺泡蛋白质沉积症', '多重肺部感染'], ['百日咳', '肺不张'], ['苯中毒', '贫血'], ['喘息样支气管炎', '支气管哮喘'], ['成人呼吸窘迫综合征', '细菌性肺炎'], ['大量羊水吸入', '呼吸衰竭'], ['单纯性肺嗜酸粒细胞浸润症', '胆道蛔虫病'], ['大叶性肺炎', '脓胸'], ['大楼病综合征', '抑郁症'], ['二硫化碳中毒', '昏迷'], ['肺-胸膜阿米巴病', '阿米巴肝脓肿'], ['肺出血－肾炎综合征', '便血'], ['肺放线菌病', '膈下脓肿'], ['肺泡蛋白沉着症', '呼吸衰竭'], ['肺曲菌病', '过敏性鼻炎'], ['放射性肺炎', '肺气肿'], ['肺念珠菌病', '菌血症'], ['肺大疱', '张力性气胸'], ['肺炎球菌肺炎', '败血症'], ['肺气肿', '呼吸衰竭'], ['肺气肿', '自发性气胸'], ['肺气肿', '慢性肺源性心脏病'], ['肺气肿', '胃溃疡'], ['肺炎杆菌肺炎', '脑疝']]
const rels_recommanddrug=[['百日咳', '琥乙红霉素片'], ['百日咳', '琥乙红霉素颗粒'], ['百日咳', '百咳静糖浆'], ['百日咳', '穿心莲内酯片'], ['百日咳', '红霉素肠溶片'], ['百日咳', '环酯红霉素片'], ['苯中毒', '布美他尼片'], ['苯中毒', '十一味金色丸'], ['苯中毒', '注射用布美他尼'], ['苯中毒', '注射用呋塞米'], ['苯中毒', '盐酸利多卡因注射液'], ['苯中毒', '注射用硫代硫酸钠'], ['苯中毒', '大月晶丸'], ['苯中毒', '仁青芒觉'], ['苯中毒', '注射用鼠神经生长因子'], ['苯中毒', '地塞米松磷酸钠注射液'], ['喘息样支气管炎', '枸橼酸喷托维林片'], ['喘息样支气管炎', '氨茶碱片'], ['喘息样支气管炎', '二羟丙茶碱片'], ['喘息样支气管炎', '胸腺肽肠溶片'], ['喘息样支气管炎', '硫酸沙丁胺醇气雾剂'], ['喘息样支气管炎', '小青龙合剂'], ['喘息样支气管炎', '硫酸沙丁胺醇片'], ['喘息样支气管炎', '蛇胆川贝液'], ['喘息样支气管炎', '小青龙颗粒'], ['喘息样支气管炎', '布地奈德气雾剂'], ['喘息样支气管炎', '喷托维林氯化铵糖浆'], ['成人呼吸窘迫综合征', '注射用还原型谷胱甘肽钠'], ['成人呼吸窘迫综合征', '注射用盐酸氨溴索'], ['成人呼吸窘迫综合征', '人血白蛋白'], ['成人呼吸窘迫综合征', '盐酸氨溴索葡萄糖注射液'], ['单纯性肺嗜酸粒细胞浸润症', '注射用盐酸头孢替安'], ['单纯性肺嗜酸粒细胞浸润症', '注射用磺苄西林钠'], ['单纯性肺嗜酸粒细胞浸润症', '托西酸舒他西林胶囊'], ['单纯性肺嗜酸粒细胞浸润症', '头孢泊肟酯胶囊'], ['单纯性肺嗜酸粒细胞浸润症', '头孢氨苄甲氧苄啶片'], ['大叶性肺炎', '阿奇霉素胶囊'], ['大叶性肺炎', '阿奇霉素分散片'], ['大叶性肺炎', '诺氟沙星胶囊'], ['大叶性肺炎', '阿奇霉素片'], ['大叶性肺炎', '乳酸左氧氟沙星片'], ['大楼病综合征', '注射用盐酸溴己新'], ['大楼病综合征', '云南花粉片'], ['二硫化碳中毒', '布美他尼片'], ['二硫化碳中毒', '十一味金色丸'], ['二硫化碳中毒', '注射用布美他尼'], ['二硫化碳中毒', '注射用呋塞米'], ['二硫化碳中毒', '盐酸利多卡因注射液'], ['二硫化碳中毒', '注射用硫代硫酸钠'], ['二硫化碳中毒', '大月晶丸'], ['二硫化碳中毒', '仁青芒觉'], ['二硫化碳中毒', '注射用鼠神经生长因子'], ['二硫化碳中毒', '地塞米松磷酸钠注射液'], ['肺-胸膜阿米巴病', '甲硝唑片'], ['肺-胸膜阿米巴病', '甲硝唑维B6片'], ['肺-胸膜阿米巴病', '替硝唑片'], ['肺-胸膜阿米巴病', '奥硝唑片'], ['肺出血－肾炎综合征', '雷公藤多苷片'], ['肺出血－肾炎综合征', '注射用甲泼尼龙琥珀酸钠'], ['肺出血－肾炎综合征', '蒺藜药酒'], ['肺出血－肾炎综合征', '甲泼尼龙片'], ['肺放线菌病', '盐酸克林霉素棕榈酸酯分散片'], ['肺放线菌病', '注射用美洛西林钠舒巴坦钠'], ['肺放线菌病', '盐酸克林霉素棕榈酸酯颗粒'], ['肺放线菌病', '盐酸克林霉素胶囊'], ['肺曲菌病', '阿奇霉素胶囊'], ['肺曲菌病', '阿奇霉素分散片'], ['肺曲菌病', '诺氟沙星胶囊'], ['肺曲菌病', '阿奇霉素片'], ['肺曲菌病', '乳酸左氧氟沙星片'], ['放射性肺炎', '阿奇霉素胶囊'], ['放射性肺炎', '阿奇霉素分散片'], ['放射性肺炎', '诺氟沙星胶囊'], ['放射性肺炎', '阿奇霉素片'], ['放射性肺炎', '乳酸左氧氟沙星片'], ['肺念珠菌病', '硝酸咪康唑乳膏'], ['肺念珠菌病', '盐酸特比萘芬片'], ['肺念珠菌病', '酮康唑乳膏'], ['肺念珠菌病', '环吡酮胺乳膏'], ['肺念珠菌病', '硝酸益康唑溶液'], ['肺念珠菌病', '伊曲康唑胶囊'], ['肺念珠菌病', '克霉唑阴道片'], ['肺念珠菌病', '氟康唑胶囊'], ['肺念珠菌病', '硝酸益康唑乳膏'], ['肺念珠菌病', '盐酸特比萘芬凝胶'], ['肺念珠菌病', '盐酸特比萘芬溶液'], ['肺念珠菌病', '联苯苄唑乳膏'], ['肺念珠菌病', '转移因子口服溶液'], ['肺念珠菌病', '硝酸咪康唑栓'], ['肺炎球菌肺炎', '氯霉素片'], ['肺炎球菌肺炎', '阿奇霉素片'], ['肺炎球菌肺炎', '阿奇霉素分散片'], ['肺炎球菌肺炎', '阿奇霉素颗粒'], ['肺气肿', '祛痰止咳胶囊'], ['肺气肿', '如意定喘丸'], ['肺气肿', '硫酸特布他林雾化液'], ['肺气肿', '茶碱缓释片'], ['肺气肿', '氨茶碱片'], ['肺气肿', '噻托溴铵粉吸入剂'], ['肺气肿', '盐酸班布特罗胶囊'], ['肺气肿', '白及颗粒'], ['肺气肿', '氨溴特罗口服溶液'], ['肺气肿', '化痰平喘片'], ['肺气肿', '噻托溴铵粉雾剂'], ['肺气肿', '盐酸妥洛特罗片'], ['肺气肿', '茶碱缓释胶囊'], ['肺气肿', '盐酸班布特罗片'], ['肺气肿', '喘嗽宁片'], ['肺气肿', '硫酸特布他林片'], ['肺气肿', '肺气肿片'], ['肺气肿', '复方蛤青胶囊'], ['肺炎杆菌肺炎', '氨苄西林胶囊'], ['肺炎杆菌肺炎', '头孢拉定胶囊'], ['肺炎杆菌肺炎', '通宣理肺丸'], ['肺炎杆菌肺炎', '阿莫西林颗粒'], ['肺炎杆菌肺炎', '头孢克洛颗粒'], ['肺炎杆菌肺炎', '盐酸左氧氟沙星胶囊'], ['肺炎杆菌肺炎', '头孢氨苄胶囊'], ['肺炎杆菌肺炎', '依托红霉素片'], ['肺炎杆菌肺炎', '蛤蚧定喘丸'], ['肺炎杆菌肺炎', '乙酰螺旋霉素片'], ['肺炎杆菌肺炎', '注射用头孢唑林钠'], ['肺炎杆菌肺炎', '头孢克肟颗粒'], ['肺炎杆菌肺炎', '头孢克肟分散片'], ['肺炎杆菌肺炎', '氟康唑胶囊'], ['肺炎杆菌肺炎', '麦迪霉素片'], ['肺炎杆菌肺炎', '司帕沙星分散片'], ['肺炎杆菌肺炎', '头孢丙烯分散片'], ['肺炎杆菌肺炎', '蛇胆川贝液'], ['肺炎杆菌肺炎', '头孢拉定分散片'], ['肺炎杆菌肺炎', '乳酸左氧氟沙星片']]
const rels_commonddrug=[['百日咳', '穿心莲内酯片'], ['百日咳', '百咳静糖浆'], ['苯中毒', '布美他尼片'], ['苯中毒', '十一味金色丸'], ['喘息样支气管炎', '布地奈德气雾剂'], ['喘息样支气管炎', '喷托维林氯化铵糖浆'], ['成人呼吸窘迫综合征', '人血白蛋白'], ['成人呼吸窘迫综合征', '注射用还原型谷胱甘肽钠'], ['单纯性肺嗜酸粒细胞浸润症', '头孢泊肟酯胶囊'], ['单纯性肺嗜酸粒细胞浸润症', '头孢氨苄甲氧苄啶片'], ['大叶性肺炎', '乳酸左氧氟沙星片'], ['大叶性肺炎', '阿奇霉素片'], ['大楼病综合征', '云南花粉片'], ['大楼病综合征', '注射用盐酸溴己新'], ['二硫化碳中毒', '布美他尼片'], ['二硫化碳中毒', '十一味金色丸'], ['肺-胸膜阿米巴病', '甲硝唑片'], ['肺-胸膜阿米巴病', '替硝唑片'], ['肺出血－肾炎综合征', '雷公藤多苷片'], ['肺出血－肾炎综合征', '甲泼尼龙片'], ['肺放线菌病', '盐酸克林霉素棕榈酸酯分散片'], ['肺放线菌病', '盐酸克林霉素胶囊'], ['肺曲菌病', '乳酸左氧氟沙星片'], ['肺曲菌病', '阿奇霉素片'], ['放射性肺炎', '乳酸左氧氟沙星片'], ['放射性肺炎', '阿奇霉素片'], ['肺念珠菌病', '转移因子口服溶液'], ['肺念珠菌病', '克霉唑阴道片'], ['肺炎球菌肺炎', '阿奇霉素片'], ['肺炎球菌肺炎', '阿奇霉素分散片'], ['肺气肿', '噻托溴铵粉雾剂'], ['肺气肿', '氨茶碱片'], ['肺炎杆菌肺炎', '头孢氨苄胶囊'], ['肺炎杆菌肺炎', '盐酸左氧氟沙星胶囊']]
const rels_noteat=[['百日咳', '螃蟹'], ['百日咳', '海蟹'], ['百日咳', '海虾'], ['百日咳', '海螺'], ['苯中毒', '海蟹'], ['苯中毒', '海虾'], ['苯中毒', '海参（水浸）'], ['苯中毒', '辣椒(青、尖)'], ['喘息样支气管炎', '海蟹'], ['喘息样支气管炎', '海虾'], ['喘息样支气管炎', '海螺'], ['喘息样支气管炎', '猪肉(肥瘦)'], ['成人呼吸窘迫综合征', '啤酒'], ['成人呼吸窘迫综合征', '白酒'], ['成人呼吸窘迫综合征', '洋葱'], ['成人呼吸窘迫综合征', '辣椒(红、尖、干)'], ['大叶性肺炎', '洋葱'], ['大叶性肺炎', '辣椒(青、尖)'], ['大叶性肺炎', '辣椒(红、尖、干)'], ['大叶性肺炎', '韭菜'], ['大楼病综合征', '洋葱'], ['大楼病综合征', '辣椒(青、尖)'], ['大楼病综合征', '辣椒(红、尖、干)'], ['大楼病综合征', '韭菜'], ['二硫化碳中毒', '啤酒'], ['二硫化碳中毒', '白酒'], ['二硫化碳中毒', '洋葱'], ['二硫化碳中毒', '辣椒(红、尖、干)'], ['肺出血－肾炎综合征', '竹笋'], ['肺出血－肾炎综合征', '辣椒(青、尖)'], ['肺出血－肾炎综合征', '辣椒(红、尖、干)'], ['肺出血－肾炎综合征', '韭菜'], ['肺放线菌病', '啤酒'], ['肺放线菌病', '白酒'], ['肺放线菌病', '狗肉'], ['肺放线菌病', '洋葱'], ['肺曲菌病', '啤酒'], ['肺曲菌病', '白酒'], ['肺曲菌病', '洋葱'], ['肺曲菌病', '韭菜'], ['放射性肺炎', '白酒'], ['放射性肺炎', '洋葱'], ['放射性肺炎', '辣椒(红、尖、干)'], ['放射性肺炎', '大蒜'], ['肺念珠菌病', '啤酒'], ['肺念珠菌病', '白酒'], ['肺念珠菌病', '空心菜'], ['肺念珠菌病', '奶油'], ['肺炎球菌肺炎', '啤酒'], ['肺炎球菌肺炎', '白酒'], ['肺炎球菌肺炎', '辣椒(红、尖、干)'], ['肺炎球菌肺炎', '咖啡'], ['肺气肿', '海虾'], ['肺气肿', '带鱼'], ['肺气肿', '羊肉(瘦)'], ['肺气肿', '圆白菜'], ['肺炎杆菌肺炎', '鱼腥草'], ['肺炎杆菌肺炎', '洋葱'], ['肺炎杆菌肺炎', '香菜'], ['肺炎杆菌肺炎', '辣椒(青、尖)']]
const rels_doeat=[['百日咳', '南瓜子仁'], ['百日咳', '圆白菜'], ['百日咳', '樱桃番茄'], ['百日咳', '小白菜'], ['苯中毒', '鸡蛋'], ['苯中毒', '大豆'], ['苯中毒', '猪肉(瘦)'], ['苯中毒', '樱桃番茄'], ['喘息样支气管炎', '鸡蛋'], ['喘息样支气管炎', '海蚌'], ['喘息样支气管炎', '赤贝'], ['喘息样支气管炎', '圆白菜'], ['成人呼吸窘迫综合征', '莲子'], ['成人呼吸窘迫综合征', '生菜'], ['成人呼吸窘迫综合征', '山药'], ['成人呼吸窘迫综合征', '空心菜'], ['大叶性肺炎', '栗子（熟）'], ['大叶性肺炎', '鲫鱼'], ['大叶性肺炎', '猪肉(瘦)'], ['大叶性肺炎', '油菜'], ['大楼病综合征', '圆白菜'], ['大楼病综合征', '小白菜'], ['大楼病综合征', '生菜'], ['大楼病综合征', '空心菜'], ['二硫化碳中毒', '生菜'], ['二硫化碳中毒', '南瓜'], ['二硫化碳中毒', '苦瓜'], ['二硫化碳中毒', '空心菜'], ['肺出血－肾炎综合征', '茄子'], ['肺出血－肾炎综合征', '空心菜'], ['肺出血－肾炎综合征', '茭白'], ['肺出血－肾炎综合征', '番茄'], ['肺放线菌病', '油菜'], ['肺放线菌病', '生菜'], ['肺放线菌病', '南瓜'], ['肺放线菌病', '空心菜'], ['肺曲菌病', '鸡蛋'], ['肺曲菌病', '鲤鱼'], ['肺曲菌病', '鲫鱼'], ['肺曲菌病', '油麦菜'], ['放射性肺炎', '莲子'], ['放射性肺炎', '豆浆'], ['放射性肺炎', '生菜'], ['放射性肺炎', '南瓜'], ['肺念珠菌病', '鸡蛋清'], ['肺念珠菌病', '鸡'], ['肺念珠菌病', '杏仁'], ['肺念珠菌病', '核桃'], ['肺炎球菌肺炎', '鸡蛋'], ['肺炎球菌肺炎', '鲈鱼'], ['肺炎球菌肺炎', '鲢鱼'], ['肺炎球菌肺炎', '鲤鱼'], ['肺气肿', '鹿肉'], ['肺气肿', '鸡肝'], ['肺气肿', '杏仁'], ['肺气肿', '松子仁'], ['肺炎杆菌肺炎', '鹿肉'], ['肺炎杆菌肺炎', '鸡蛋'], ['肺炎杆菌肺炎', '鸡肝'], ['肺炎杆菌肺炎', '杏仁']]
const rels_recommandeat=[['百日咳', '清蒸鸡蛋羹'], ['百日咳', '百合双耳鸡蛋羹'], ['百日咳', '排骨汤'], ['百日咳', '罗汉果雪耳鸡汤'], ['百日咳', '小黄瓜凉拌面'], ['百日咳', '黄瓜三丝汤'], ['百日咳', '黄瓜拌兔丝'], ['百日咳', '黄瓜拌皮丝'], ['苯中毒', '豆腐干炒韭菜'], ['苯中毒', '素炒小白菜'], ['苯中毒', '白菜蛋花粥'], ['喘息样支气管炎', '紫苏粥'], ['喘息样支气管炎', '菊花芦根茶'], ['喘息样支气管炎', '生芦根粥'], ['喘息样支气管炎', '鲜芦根粥'], ['喘息样支气管炎', '薏仁党参粥'], ['喘息样支气管炎', '党参粥'], ['喘息样支气管炎', '黄芪粥'], ['喘息样支气管炎', '鸡蛋木耳粥'], ['成人呼吸窘迫综合征', '百合糖粥'], ['成人呼吸窘迫综合征', '百合粥'], ['成人呼吸窘迫综合征', '百合花生汤'], ['成人呼吸窘迫综合征', '首乌百合粥'], ['成人呼吸窘迫综合征', '薏米莲子粥'], ['成人呼吸窘迫综合征', '牛奶玉米汤'], ['成人呼吸窘迫综合征', '萝卜豆腐汤'], ['成人呼吸窘迫综合征', '瓜粒杂锦汤'], ['大叶性肺炎', '奶汤锅子鱼'], ['大叶性肺炎', '酱豆腐汁烧猪肉'], ['大叶性肺炎', '百合汤'], ['大叶性肺炎', '山楂百合汤'], ['大叶性肺炎', '番茄鸡蛋煎饼'], ['大叶性肺炎', '凉拌番茄'], ['大叶性肺炎', '番茄猪肝瘦肉汤'], ['大叶性肺炎', '番茄牛肉'], ['大楼病综合征', '生姜乌梅饮'], ['大楼病综合征', '乌梅粥'], ['大楼病综合征', '山楂乌梅饮'], ['大楼病综合征', '山楂红糖粥'], ['大楼病综合征', '山楂桑椹粥'], ['二硫化碳中毒', '小麦粥'], ['二硫化碳中毒', '荞麦粥'], ['二硫化碳中毒', '杂粮粥'], ['二硫化碳中毒', '蔬菜杂烩粥'], ['二硫化碳中毒', '花生杏仁粥'], ['二硫化碳中毒', '豆薯小米粥'], ['二硫化碳中毒', '羊腩萝卜丝粥'], ['二硫化碳中毒', '绿豆南瓜汤'], ['肺出血－肾炎综合征', '肉末冬瓜'], ['肺出血－肾炎综合征', '肉松'], ['肺出血－肾炎综合征', '五丝白菜卷'], ['肺出血－肾炎综合征', '拌肚丝白菜'], ['肺出血－肾炎综合征', '冬菇烧白菜'], ['肺出血－肾炎综合征', '水萝卜丝拌白菜'], ['肺出血－肾炎综合征', '珊瑚白菜墩'], ['肺出血－肾炎综合征', '素炒小白菜'], ['肺放线菌病', '番茄西米粥'], ['肺放线菌病', '番茄牛肉片'], ['肺放线菌病', '番茄羊肉汤'], ['肺放线菌病', '番茄羊肉蛋花汤'], ['肺放线菌病', '番茄皮蛋汤'], ['肺放线菌病', '百合炒芦笋'], ['肺放线菌病', '百合炖猪蹄'], ['肺放线菌病', '鲜百合烧肉'], ['肺曲菌病', '银耳粥'], ['肺曲菌病', '鸭梨粥'], ['肺曲菌病', '雪梨饮'], ['肺曲菌病', '川贝酿梨'], ['肺曲菌病', '北杏炖雪梨'], ['肺曲菌病', '红枣银耳粥'], ['肺曲菌病', '冰糖银耳羹'], ['肺曲菌病', '椰子银耳煲鸽汤'], ['放射性肺炎', '杂粮粥'], ['放射性肺炎', '蔬菜杂烩粥'], ['放射性肺炎', '小麦粥'], ['放射性肺炎', '虾皮香芹燕麦粥'], ['放射性肺炎', '荞麦粥'], ['放射性肺炎', '花生杏仁粥'], ['放射性肺炎', '豆薯小米粥'], ['放射性肺炎', '萝卜豆腐汤'], ['肺念珠菌病', '小麦粥'], ['肺念珠菌病', '荞麦粥'], ['肺念珠菌病', '杂粮粥'], ['肺念珠菌病', '蔬菜杂烩粥'], ['肺念珠菌病', '豆薯小米粥'], ['肺念珠菌病', '花生杏仁粥'], ['肺念珠菌病', '冬瓜草鱼汤'], ['肺念珠菌病', '三鲜冬瓜汤'], ['肺炎球菌肺炎', '小黄瓜凉拌面'], ['肺炎球菌肺炎', '黄瓜三丝汤'], ['肺炎球菌肺炎', '水萝卜拌黄瓜'], ['肺炎球菌肺炎', '黄瓜拌豆腐丝'], ['肺炎球菌肺炎', '黄瓜拌香菜'], ['肺炎球菌肺炎', '小黄瓜西瓜汁'], ['肺炎球菌肺炎', '五丝白菜卷'], ['肺炎球菌肺炎', '玉竹白菜'], ['肺气肿', '糖醋草鱼'], ['肺气肿', '炖白鲢鱼'], ['肺气肿', '红烧鲢鱼'], ['肺气肿', '泡莲藕'], ['肺气肿', '凉拌莲藕'], ['肺气肿', '山楂糕'], ['肺气肿', '百合汁'], ['肺气肿', '百合粥'], ['肺炎杆菌肺炎', '番茄鸡蛋煎饼'], ['肺炎杆菌肺炎', '番茄芹菜汁'], ['肺炎杆菌肺炎', '番茄汁'], ['肺炎杆菌肺炎', '锅塌番茄'], ['肺炎杆菌肺炎', '意式番茄牛肉凉面'], ['肺炎杆菌肺炎', '番茄牛肉'], ['肺炎杆菌肺炎', '番茄三素'], ['肺炎杆菌肺炎', '番茄苹果芝麻蜜']]
const rels_drug_producer=[['惠普森穿心莲内酯片', '穿心莲内酯片'], ['北京同仁堂百咳静糖浆', '百咳静糖浆'], ['邦琪药业百咳静糖浆', '百咳静糖浆'], ['东新药业百咳静糖浆', '百咳静糖浆'], ['达发新', '环酯红霉素片'], ['康美药业红霉素肠溶片', '红霉素肠溶片'], ['旺龙药业琥乙红霉素颗粒', '琥乙红霉素颗粒'], ['白云山医药琥乙红霉素片', '琥乙红霉素片'], ['国瑞琥乙红霉素片', '琥乙红霉素片'], ['利君制药红霉素肠溶片', '红霉素肠溶片'], ['东信药业琥乙红霉素颗粒', '琥乙红霉素颗粒'], ['石药欧意红霉素肠溶片', '红霉素肠溶片'], ['平光制药红霉素肠溶片', '红霉素肠溶片'], ['北京曙光药业红霉素肠溶片', '红霉素肠溶片'], ['迪瑞制药琥乙红霉素颗粒', '琥乙红霉素颗粒'], ['永定制药百咳静糖浆', '百咳静糖浆'], ['东信药业琥乙红霉素片', '琥乙红霉素片'], ['利君制药琥乙红霉素片', '琥乙红霉素片'], ['北京中新制药琥乙红霉素片', '琥乙红霉素片'], ['华南药业红霉素肠溶片', '红霉素肠溶片'], ['佐今明百咳静糖浆', '百咳静糖浆'], ['恒益药业琥乙红霉素颗粒', '琥乙红霉素颗粒'], ['利君沙', '琥乙红霉素颗粒'], ['桂林南药布美他尼片', '布美他尼片'], ['雄巴拉曲神水十一味金色丸', '十一味金色丸'], ['西藏甘露仁青芒觉', '仁青芒觉'], ['金诃藏药大月晶丸', '大月晶丸'], ['金诃藏药仁青芒觉', '仁青芒觉'], ['苏肽生', '注射用鼠神经生长因子'], ['新峰药业盐酸利多卡因注射液', '盐酸利多卡因注射液'], ['海斯制药盐酸利多卡因注射液', '盐酸利多卡因注射液'], ['西藏甘露十一味金色丸', '十一味金色丸'], ['卓峰地塞米松磷酸钠注射液', '地塞米松磷酸钠注射液'], ['白云山天心地塞米松磷酸钠注', '地塞米松磷酸钠注射液'], ['涟水制药地塞米松磷酸钠注射', '地塞米松磷酸钠注射液'], ['金耀药业地塞米松磷酸钠注射', '地塞米松磷酸钠注射液'], ['遂成药业地塞米松磷酸钠注射', '地塞米松磷酸钠注射液'], ['恩经复', '注射用鼠神经生长因子'], ['金路捷', '注射用鼠神经生长因子'], ['新亚注射用硫代硫酸钠', '注射用硫代硫酸钠'], ['北京永康药业盐酸利多卡因注', '盐酸利多卡因注射液'], ['北京益民药业盐酸利多卡因注', '盐酸利多卡因注射液'], ['中国大冢盐酸利多卡因注射液', '盐酸利多卡因注射液'], ['盐酸利多卡因注射液', '盐酸利多卡因注射液'], ['全星制药注射用布美他尼', '注射用布美他尼'], ['皇隆制药注射用呋塞米', '注射用呋塞米'], ['信谊布地奈德气雾剂', '布地奈德气雾剂'], ['桑海制药喷托维林氯化铵糖浆', '喷托维林氯化铵糖浆'], ['赣南制药喷托维林氯化铵糖浆', '喷托维林氯化铵糖浆'], ['奇莫欣', '胸腺肽肠溶片'], ['振兴氨茶碱片', '氨茶碱片'], ['盛翔制药蛇胆川贝液', '蛇胆川贝液'], ['蛇胆川贝液', '蛇胆川贝液'], ['晶珠藏药蛇胆川贝液', '蛇胆川贝液'], ['天天乐药业蛇胆川贝液', '蛇胆川贝液'], ['东信药业蛇胆川贝液', '蛇胆川贝液'], ['广西灵峰药业蛇胆川贝液', '蛇胆川贝液'], ['吉林东方制药枸橼酸喷托维林', '枸橼酸喷托维林片'], ['万托林', '硫酸沙丁胺醇气雾剂'], ['天津太平洋二羟丙茶碱片', '二羟丙茶碱片'], ['海南制药厂蛇胆川贝液', '蛇胆川贝液'], ['首儿药厂小青龙颗粒', '小青龙颗粒'], ['石药欧意枸橼酸喷托维林片', '枸橼酸喷托维林片'], ['纽兰药业小青龙颗粒', '小青龙颗粒'], ['纽兰药业小青龙合剂', '小青龙合剂'], ['济安堂蛇胆川贝液', '蛇胆川贝液'], ['迪龙制药胸腺肽肠溶片', '胸腺肽肠溶片'], ['天津力生制药硫酸沙丁胺醇片', '硫酸沙丁胺醇片'], ['仁和堂硫酸沙丁胺醇片', '硫酸沙丁胺醇片'], ['莱士人血白蛋白', '人血白蛋白'], ['卫光生物人血白蛋白', '人血白蛋白'], ['泰邦生物人血白蛋白', '人血白蛋白'], ['绿十字', '中国)生物制品人'], ['人血白蛋白', '人血白蛋白'], ['松泰斯', '注射用还原型谷胱甘肽钠'], ['欣得生', '盐酸氨溴索葡萄糖注射液'], ['武汉生物人血白蛋白', '人血白蛋白'], ['诺健', '注射用盐酸氨溴索'], ['广春药业盐酸氨溴索葡萄糖注', '盐酸氨溴索葡萄糖注射液'], ['罗欣药业注射用盐酸氨溴索', '注射用盐酸氨溴索'], ['润阳药业盐酸氨溴索葡萄糖注', '盐酸氨溴索葡萄糖注射液'], ['博康健制药盐酸氨溴索葡萄糖', '盐酸氨溴索葡萄糖注射液'], ['德源生物人血白蛋白', '人血白蛋白'], ['六安华源制药盐酸氨溴索葡萄', '盐酸氨溴索葡萄糖注射液'], ['艾富西药业盐酸氨溴索葡萄糖', '盐酸氨溴索葡萄糖注射液'], ['山西康宝人血白蛋白', '人血白蛋白'], ['莎普爱思盐酸氨溴索葡萄糖注', '盐酸氨溴索葡萄糖注射液'], ['蜀阳药业人血白蛋白', '人血白蛋白'], ['双林生物人血白蛋白', '人血白蛋白'], ['蓉生药业人血白蛋白', '人血白蛋白'], ['金峰制药盐酸氨溴索葡萄糖注', '盐酸氨溴索葡萄糖注射液'], ['广东卫伦人血白蛋白', '人血白蛋白'], ['亮博', '头孢泊肟酯胶囊'], ['白云山光华头孢氨苄甲氧苄啶', '头孢氨苄甲氧苄啶片'], ['头孢氨苄甲氧苄啶片', '头孢氨苄甲氧苄啶片'], ['锋替新', '注射用盐酸头孢替安'], ['西岳制药托西酸舒他西林胶囊', '托西酸舒他西林胶囊'], ['华瑞联合制药头孢氨苄甲氧苄', '头孢氨苄甲氧苄啶片'], ['明水药业头孢氨苄甲氧苄啶片', '头孢氨苄甲氧苄啶片'], ['注射用磺苄西林钠', '注射用磺苄西林钠'], ['圣大（张家口）头孢氨苄甲氧', '头孢氨苄甲氧苄啶片'], ['大连药业托西酸舒他西林胶囊', '托西酸舒他西林胶囊'], ['瑞阳制药注射用磺苄西林钠', '注射用磺苄西林钠'], ['注射用盐酸头孢替安', '注射用盐酸头孢替安'], ['赤峰维康托西酸舒他西林胶囊', '托西酸舒他西林胶囊'], ['彼迪药业托西酸舒他西林胶囊', '托西酸舒他西林胶囊'], ['复仙安', '注射用盐酸头孢替安'], ['哈药总厂头孢氨苄甲氧苄啶片', '头孢氨苄甲氧苄啶片'], ['云门药业头孢氨苄甲氧苄啶片', '头孢氨苄甲氧苄啶片'], ['哈药总厂注射用磺苄西林钠', '注射用磺苄西林钠'], ['萨兰欣', '注射用盐酸头孢替安'], ['搏沃欣', '头孢泊肟酯胶囊'], ['哈药总厂托西酸舒他西林胶囊', '托西酸舒他西林胶囊'], ['全星制药注射用盐酸头孢替安', '注射用盐酸头孢替安'], ['罗欣药业注射用盐酸头孢替安', '注射用盐酸头孢替安'], ['宜昌长江乳酸左氧氟沙星片', '乳酸左氧氟沙星片'], ['希舒美', '阿奇霉素片'], ['维宏', '阿奇霉素片'], ['宜昌长江阿奇霉素分散片', '阿奇霉素分散片'], ['大连天宇制药阿奇霉素胶囊', '阿奇霉素胶囊'], ['兰花药业诺氟沙星胶囊', '诺氟沙星胶囊'], ['福邦药业阿奇霉素胶囊', '阿奇霉素胶囊'], ['葵花药业得菲尔公司阿奇霉素', '阿奇霉素胶囊'], ['利民制药阿奇霉素胶囊', '阿奇霉素胶囊'], ['东药阿奇霉素胶囊', '阿奇霉素胶囊'], ['浙江南洋药业阿奇霉素胶囊', '阿奇霉素胶囊'], ['江苏长江阿奇霉素胶囊', '阿奇霉素胶囊'], ['辅仁药业阿奇霉素片', '阿奇霉素片'], ['汇仁药业阿奇霉素片', '阿奇霉素片'], ['爱普森药业阿奇霉素片', '阿奇霉素片'], ['石药欧意诺氟沙星胶囊', '诺氟沙星胶囊'], ['白云山医药诺氟沙星胶囊', '诺氟沙星胶囊'], ['康美药业诺氟沙星胶囊', '诺氟沙星胶囊'], ['锦华药业诺氟沙星胶囊', '诺氟沙星胶囊'], ['北京京丰制药集团诺氟沙星胶', '诺氟沙星胶囊'], ['欣匹特', '阿奇霉素分散片'], ['海王阿奇霉素片', '阿奇霉素片'], ['安诺药业阿奇霉素分散片', '阿奇霉素分散片'], ['云南白药云南花粉片', '云南花粉片'], ['丰原制药注射用盐酸溴己新', '注射用盐酸溴己新'], ['普德药业注射用盐酸溴己新', '注射用盐酸溴己新'], ['海斯制药注射用盐酸溴己新', '注射用盐酸溴己新'], ['国药国瑞注射用盐酸溴己新', '注射用盐酸溴己新'], ['傲群', '注射用盐酸溴己新'], ['智同生物注射用盐酸溴己新', '注射用盐酸溴己新'], ['澳利达奈德注射用盐酸溴己新', '注射用盐酸溴己新'], ['一品红注射用盐酸溴己新', '注射用盐酸溴己新'], ['海鲸药业注射用盐酸溴己新', '注射用盐酸溴己新'], ['益佳清', '注射用盐酸溴己新'], ['伏枝', '注射用盐酸溴己新'], ['飞云岭药业甲硝唑片', '甲硝唑片'], ['丽珠制药替硝唑片', '替硝唑片'], ['亨瑞达制药甲硝唑片', '甲硝唑片'], ['环科药业甲硝唑片', '甲硝唑片'], ['鲁抗赛特替硝唑片', '替硝唑片'], ['皇象铁力蓝天甲硝唑维B6片', '甲硝唑维B6片'], ['迪沙药业甲硝唑维B6片', '甲硝唑维B6片'], ['彼迪药业替硝唑片', '替硝唑片'], ['潇然', '奥硝唑片'], ['傲宁', '奥硝唑片'], ['衡博来', '奥硝唑片'], ['太原药业甲硝唑片', '甲硝唑片'], ['汉森制药甲硝唑片', '甲硝唑片'], ['海力制药替硝唑片', '替硝唑片'], ['津华晖星替硝唑片', '替硝唑片'], ['东药替硝唑片', '替硝唑片'], ['迪诺制药替硝唑片', '替硝唑片'], ['沈阳一药替硝唑片', '替硝唑片'], ['甲硝唑片', '甲硝唑片'], ['亚宝药业甲硝唑片', '甲硝唑片'], ['津华晖星甲硝唑片', '甲硝唑片'], ['华中药业甲硝唑片', '甲硝唑片'], ['康美药业甲硝唑片', '甲硝唑片'], ['得恩德制药雷公藤多苷片', '雷公藤多苷片'], ['复旦复华雷公藤多苷片', '雷公藤多苷片'], ['远大医药黄石飞云制药雷公藤', '雷公藤多苷片'], ['美通制药雷公藤多苷片', '雷公藤多苷片'], ['普洛康裕天然药物雷公藤多苷', '雷公藤多苷片'], ['新陇海药业雷公藤多苷片', '雷公藤多苷片'], ['贵州汉方药业雷公藤多苷片', '雷公藤多苷片'], ['尤金', '甲泼尼龙片'], ['美卓乐', '甲泼尼龙片'], ['米乐松', '注射用甲泼尼龙琥珀酸钠'], ['甲强龙', '注射用甲泼尼龙琥珀酸钠'], ['金耀药业注射用甲泼尼龙琥珀', '注射用甲泼尼龙琥珀酸钠'], ['央宗药业蒺藜药酒', '蒺藜药酒'], ['德远药业雷公藤多苷片', '雷公藤多苷片'], ['比利时辉瑞注射用甲泼尼龙琥', '注射用甲泼尼龙琥珀酸钠'], ['重庆华邦制药注射用甲泼尼龙', '注射用甲泼尼龙琥珀酸钠'], ['辽宁海思科注射用甲泼尼龙琥', '注射用甲泼尼龙琥珀酸钠'], ['南光注射用甲泼尼龙琥珀酸钠', '注射用甲泼尼龙琥珀酸钠'], ['一品红盐酸克林霉素棕榈酸酯', '盐酸克林霉素棕榈酸酯分散片'], ['杭州民生药业盐酸克林霉素胶', '盐酸克林霉素胶囊'], ['盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['宜昌人福盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['东药盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['康普药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['锦华药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['仁和药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['安诺药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['天方药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['科伦药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['星斗药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['苏州三药盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['河南羚锐制药盐酸克林霉素胶', '盐酸克林霉素胶囊'], ['可尔生', '盐酸克林霉素棕榈酸酯颗粒'], ['亚太药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['白云山光华盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['台城制药盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['新亚闵行盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['黄河药业盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['同济堂制药盐酸克林霉素胶囊', '盐酸克林霉素胶囊'], ['一品红盐酸克林霉素棕榈酸酯', '盐酸克林霉素棕榈酸酯颗粒'], ['开林', '注射用美洛西林钠舒巴坦钠'], ['圣泰转移因子口服溶液', '转移因子口服溶液'], ['仙琚制药克霉唑阴道片', '克霉唑阴道片'], ['运佳黄浦硝酸咪康唑乳膏', '硝酸咪康唑乳膏'], ['三维康', '氟康唑胶囊'], ['赣南海欣转移因子口服溶液', '转移因子口服溶液'], ['福建太平洋制药酮康唑乳膏', '酮康唑乳膏'], ['二天堂联苯苄唑乳膏', '联苯苄唑乳膏'], ['倍佳', '盐酸特比萘芬溶液'], ['倍佳', '盐酸特比萘芬凝胶'], ['唐山红星硝酸咪康唑乳膏', '硝酸咪康唑乳膏'], ['唐山红星硝酸益康唑溶液', '硝酸益康唑溶液'], ['衡阳紫光古汉硝酸益康唑乳膏', '硝酸益康唑乳膏'], ['纽兰药业硝酸咪康唑栓', '硝酸咪康唑栓'], ['黑龙江天龙药业联苯苄唑乳膏', '联苯苄唑乳膏'], ['斯皮仁诺', '伊曲康唑胶囊'], ['美扶', '伊曲康唑胶囊'], ['桂林华信环吡酮胺乳膏', '环吡酮胺乳膏'], ['南通中华药业硝酸咪康唑乳膏', '硝酸咪康唑乳膏'], ['吉春制药硝酸咪康唑乳膏', '硝酸咪康唑乳膏'], ['康正药业硝酸咪康唑乳膏', '硝酸咪康唑乳膏'], ['恒安药业盐酸特比萘芬片', '盐酸特比萘芬片'], ['迪沙药业克霉唑阴道片', '克霉唑阴道片'], ['五洲通药业硝酸咪康唑乳膏', '硝酸咪康唑乳膏'], ['百利药业阿奇霉素颗粒', '阿奇霉素颗粒'], ['东信药业阿奇霉素颗粒', '阿奇霉素颗粒'], ['俞氏阿奇霉素颗粒', '阿奇霉素颗粒'], ['湘江药业阿奇霉素颗粒', '阿奇霉素颗粒'], ['潜江制药阿奇霉素颗粒', '阿奇霉素颗粒'], ['海力制药阿奇霉素颗粒', '阿奇霉素颗粒'], ['北海阳光药业阿奇霉素颗粒', '阿奇霉素颗粒'], ['锦华药业氯霉素片', '氯霉素片'], ['赛乐欣', '阿奇霉素分散片'], ['齐迈星', '阿奇霉素分散片'], ['丽珠奇乐', '阿奇霉素分散片'], ['健生制药阿奇霉素分散片', '阿奇霉素分散片'], ['彼迪药业阿奇霉素分散片', '阿奇霉素分散片'], ['利君制药阿奇霉素分散片', '阿奇霉素分散片'], ['天丁噻托溴铵粉雾剂', '噻托溴铵粉雾剂'], ['埃斯玛隆', '茶碱缓释胶囊'], ['曲靖药业白及颗粒', '白及颗粒'], ['思力华', '噻托溴铵粉吸入剂'], ['帮备', '盐酸班布特罗片'], ['博利康尼', '硫酸特布他林片'], ['陕西东泰制药复方蛤青胶囊', '复方蛤青胶囊'], ['诚信制药盐酸妥洛特罗片', '盐酸妥洛特罗片'], ['吉尔吉药业喘嗽宁片', '喘嗽宁片'], ['瑞尔医药盐酸班布特罗片', '盐酸班布特罗片'], ['易坦静', '氨溴特罗口服溶液'], ['万方制药肺气肿片', '肺气肿片'], ['吉春制药祛痰止咳胶囊', '祛痰止咳胶囊'], ['龙泰制药化痰平喘片', '化痰平喘片'], ['七星山药业化痰平喘片', '化痰平喘片'], ['国医堂制药如意定喘丸', '如意定喘丸'], ['博利康尼', '硫酸特布他林雾化液'], ['石药欧意氨茶碱片', '氨茶碱片'], ['山西云鹏制药氨茶碱片', '氨茶碱片'], ['广东环球制药茶碱缓释片', '茶碱缓释片'], ['白敬宇制药氨茶碱片', '氨茶碱片'], ['湖南九典制药盐酸班布特罗胶', '盐酸班布特罗胶囊'], ['康裕头孢氨苄胶囊', '头孢氨苄胶囊'], ['联邦左福康盐酸左氧氟沙星胶', '盐酸左氧氟沙星胶囊'], ['阿莫仙阿莫西林颗粒', '阿莫西林颗粒'], ['联邦安必仙氨苄西林胶囊', '氨苄西林胶囊'], ['江西诚志永丰蛇胆川贝液', '蛇胆川贝液'], ['鲁抗阿莫西林颗粒', '阿莫西林颗粒'], ['广东华南依托红霉素片', '依托红霉素片'], ['孩尔欣头孢克洛颗粒', '头孢克洛颗粒'], ['银力舒', '头孢丙烯分散片'], ['达仁堂通宣理肺丸', '通宣理肺丸'], ['申优', '头孢拉定分散片'], ['康良头孢拉定胶囊', '头孢拉定胶囊'], ['安必君氨苄西林胶囊', '氨苄西林胶囊'], ['佳乐弗乳酸左氧氟沙星片', '乳酸左氧氟沙星片'], ['银诺克肺宝蛤蚧定喘丸', '蛤蚧定喘丸'], ['达力芬', '头孢克肟颗粒'], ['鲁神乙酰螺旋霉素片', '乙酰螺旋霉素片'], ['鲁抗注射用头孢唑林钠', '注射用头孢唑林钠'], ['上海新亚头孢克肟分散片', '头孢克肟分散片'], ['鲁抗麦迪霉素片', '麦迪霉素片'], ['珠海联邦头孢拉定胶囊', '头孢拉定胶囊'], ['朗瑞', '司帕沙星分散片']]
const rels_category=[['肺泡蛋白质沉积症', '呼吸内科'], ['百日咳', '小儿内科'], ['苯中毒', '急诊科'], ['喘息样支气管炎', '呼吸内科'], ['成人呼吸窘迫综合征', '呼吸内科'], ['大量羊水吸入', '小儿内科'], ['单纯性肺嗜酸粒细胞浸润症', '呼吸内科'], ['大叶性肺炎', '呼吸内科'], ['大楼病综合征', '其他综合'], ['二硫化碳中毒', '急诊科'], ['肺-胸膜阿米巴病', '呼吸内科'], ['肺出血－肾炎综合征', '呼吸内科'], ['肺放线菌病', '呼吸内科'], ['肺泡蛋白沉着症', '呼吸内科'], ['肺曲菌病', '呼吸内科'], ['放射性肺炎', '呼吸内科'], ['肺念珠菌病', '呼吸内科'], ['肺大疱', '呼吸内科'], ['肺炎球菌肺炎', '呼吸内科'], ['肺气肿', '呼吸内科'], ['肺炎杆菌肺炎', '呼吸内科']]
const rels_department=[['呼吸内科', '内科'], ['小儿内科', '儿科'], ['其他综合', '其他科室']]

const rels_subject=[['极限', '导数'], ['极限', '无穷级数'], ['导数', '中值定理'], ['导数', '一阶微分'], ['导数', '多元函数'], ['中值定理', '一阶微分'], ['一元积分', '重积分'], ['一元积分', '矩阵'], ['定积分', '积分应用'], ['定积分', '重积分'], ['积分应用', '重积分'], ['一阶微分', '多元函数'], ['向量代数+空间解析几何', '多元函数'], ['多元函数', '重积分'], ['重积分', '曲线积分'], ['曲线积分', '初等变换'], ['行列式', '推理理论'], ['矩阵', '初等变换'], ['初等变换', '向量组'], ['向量组', '初等变换'], ['向量组', '中值定理'], ['相似矩阵二次型', '初等变换'], ['命题逻辑概念', '一阶逻辑概念'], ['等值演算', '一阶等值演算与推理'], ['推理理论', '一阶等值演算与推理'], ['一阶逻辑概念', '一阶等值演算与推理'], ['集合代数', '二元关系'], ['二元关系', '代数系统'], ['函数', '相似矩阵二次型'], ['代数系统', '群与环'], ['格与布尔代数', '群与环'], ['格与布尔代数', '定积分'], ['排列', '组合数学'], ['图的基本概念', '相似矩阵二次型'], ['欧拉图', '图的基本概念']]   

const rels_creators=[['地理知识图谱下的建筑群空间分布模式推理', '唐曾杨'], ['学业预警知识图谱的构建与应用', '闫瑾'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '涂华婷'], ['《人工智能应用导论》知识图谱构建与应用研究', '张军'], ['基于知识图谱的海洋数值预报数据推荐算法', '李忠伟'], ['时态知识图谱的推理研究综述', '沈英汉'], ['《山海经》知识图谱构建与应用研究', '朱良兵'], ['高校IT运维知识图谱构建及应用', '李建青']]
const rels_abstractNote=[['地理知识图谱下的建筑群空间分布模式推理', '以图结构表达的知识图谱不仅在语义网络的描述与推理中发挥着重要作用，对于空间实体的结构化抽象与空间推理也具有重要意义。空间实体的联系信息在知识图谱中以图的边记录，通过路径探测、子图对齐、模式发现等基于边的知识图谱计算推理，在空间场景认知可发挥重要作用。地理知识图谱是一种对地理概念、实体及其相互关系进行形式化描述的知识系统，既有通用知识的内涵与特点，也有地理知识特定的时空特征，能够将语义模型和时空模型联系起来，描述语义关系、空间关系和时间关系，在地理知识的表达、理解、获取与推理方面有巨大的应用潜力。现有地理知识图谱的研究工作多集中于语义方面，语义关系的抽取与表达比较丰富，可以支持进一步的地理知识语义搜索等功能；然而地理知识图谱在时空模型上的知识表达比较缺乏，现有的空间关系局限在要素之间，很少涉及空间认知中进一步的分布态势、空间格局等，地理知识图谱在空间语义知识方面有待增强。本文基于知识图谱构建原理，以建筑群地理知识图谱构建为例，实现格网型建筑物模式的识别。先将建筑物抽象成实体，表达为图的节点，基于几何邻近分析提取建筑物之间的空间邻域关系，以此构建建筑群地理知识图谱；在此基础上结合建筑物模式识别的领域知识，进一步推理构建其他的空间语义关系，完善地理知识图谱；再将建筑群场景的格网模式表达为知识图谱的规则，在知识图谱上基于NoSQL语言进行推理。结果表明，本文方法能有效提取建筑物格网模式，验证了地理知识图谱在空间推理上的作用和在领域问题研究中的良好适应性，为地理知识图谱在空间认知领域的应用提供了思路。'], ['学业预警知识图谱的构建与应用', '针对学业预警体系中“事前事中预防”措施不足、过程化与可视化较低的问题，进行了学业预警知识图谱的构建与应用。首先，通过protégé完成模式层的构建，对知识的数据结构(包含实体、关系、属性)进行了设计，采用了树状结构，使每个子类继承其祖先节点的属性；其次，以事实三元组为单位，存储具体的信息；然后，通过关系型数据库实现数据与本体的映射，对关系型数据库的结构化数据进行知识抽取，通过D2RQ工具将结构化数据转化为三元组数据，存储在SQL中；最后，使用Neo4j图数据库可视化展示，完成学业预警知识图谱的构建。公开数据集实验测试结果表明，所构建的学业预警知识图谱能够对学生学业进行预警，对实体及属性进行校验标注，经过采样标注后得到准确率为94.23%，且时效性良好，系统平均在9 ms后开始传输，并在25 ms后完成，同时在过程化与可视化方面有较大提升，可以实现“事前事中预防”。'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '为满足疫情期间在线教育需求，基于知识图谱理念，从知识、问题、能力3个维度完善课程知识网络结构，初步探索生物医学电子学在线课程建设新模式，旨在重构教学资源、完善人才培养方案，实现开放、个性、精准的智慧教育体系创新。'], ['《人工智能应用导论》知识图谱构建与应用研究', '随着人工智能技术引发新一轮科技革命和社会进步，高职《人工智能应用导论》课程在众多院校相继开设，对其开展知识图谱的构建应用研究逐渐兴起，然而知识图谱的构建需要领域专家共同探讨、手工构建，十分严谨而繁琐，人工智能知识更新又较为快速，目前高职《人工智能应用导论》知识图谱的构建较为缺乏。本文借助机器学习和自然语言处理技术分别对《人工智能应用导论》课程文本资源进行实体识别和关系抽取，接着进行知识融合，最后基于Neo4j图数据库可视化展示并进行知识点推理。实验结果表明：构造后的课程知识图谱涵盖了《人工智能应用导论》课程所有知识点及其关系属性，助力开展知识点学习推理和学习路径推荐研究。'], ['基于知识图谱的海洋数值预报数据推荐算法', '为解决海洋数值预报研究人员面对复杂多样的研究任务时难以及时准确地从种类繁多的海洋数值预报数据中找到所需数据的问题，提出基于知识图谱的海洋数值预报数据推荐算法。利用海洋数值预报文献提取研究任务及海洋数值预报数据构建知识图谱，基于知识图谱计算海洋数值预报数据实体之间的相似度，同时融合在研究人员用户行为下海洋数值预报数据的相似度，进行排序选取相似度较高的海洋数值预报数据进行推荐。实验结果表明，推荐精确率及召回率分别为67.14%、62.49%。'], ['时态知识图谱的推理研究综述', '随着社交网络、物端感知等技术快速发展，网络空间中涌现了大量的交互、话题、事件、新闻等数据，蕴含大量动态演化、强时效性的知识.较于忽略知识中时间信息的传统知识图谱，时态知识图谱通过建模知识的时效性以描述动态变化的现实世界，为时间紧耦合的应用提供有效支持.然而，时态知识图谱无法确保涵盖全量知识，知识的缺失严重影响应用性能，需要推理模型自动挖掘新的知识，以解释事物的历史状态，预测未来发展趋势并描述演化规律.由于实际应用的迫切需要，近年来，时态知识图谱的推理研究工作层出不穷，逐渐引起学术界和工业界的广泛关注.本文对近年来时态知识图谱的推理工作进行全面介绍和总结.首先，介绍了时态知识图谱的推理相关概念与问题描述;其次，介绍了面向补全任务的推理模型与面向预测任务的推理模型，对其进行比较分析;之后总结了时态知识图谱推理的数据集、推理任务、相关指标以及应用场景;最后展望时态知识图谱推理的未来研究趋势.综上，本文致力于为时态知识图谱的推理领域研究人员提供具有价值的参考，以推动该领域进一步发展.'], ['《山海经》知识图谱构建与应用研究', '[目的/意义]知识图谱作为数智时代一种先进的知识组织方式，能够为数字人文研究提供良好的技术支持，去洞察那些以往在文本资源中看不见的隐含联系和知识结构。[方法/过程]《山海经》是中国上古三大奇书，具有非常高的研究价值。本文引入主题图和Neo4j等技术和工具，在分析《山海经》中的主题类型、关联关系、属性信息的基础上，提出了构建《山海经》知识图谱的技术架构、数据模型、实施步骤。[结果/结论]将多源异构数据进行集成，完成了《山海经》知识图谱的构建和展示，对于将知识图谱技术应用于数字人文研究领域做了有益的探索。'], ['高校IT运维知识图谱构建及应用', '针对高校IT运维中出现的效率低下和服务不佳问题，文章研究设计了基于知识图谱的IT运维总体架构。通过分析运维对象、运维服务流程、运维数据、采集分析处理、运维管理等模块，构建了IT运维问答知识图谱，实现了运维场景和孤立知识点的业务应用关联，基于Neo4j和Python技术开发了IT运维问答系统，解决了运维效率低下和服务质量不佳的问题。']]
const rels_publicationTitle=[['地理知识图谱下的建筑群空间分布模式推理', '地球信息科学学报'], ['学业预警知识图谱的构建与应用', '中北大学学报(自然科学版)'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '卫生职业教育'], ['《人工智能应用导论》知识图谱构建与应用研究', '网络安全技术与应用'], ['基于知识图谱的海洋数值预报数据推荐算法', '计算机工程与设计'], ['时态知识图谱的推理研究综述', '计算机学报'], ['《山海经》知识图谱构建与应用研究', '情报探索'], ['高校IT运维知识图谱构建及应用', '现代信息科技']]
const rels_libraryCatalog=[['地球信息科学学报', 'CNKI'], ['中北大学学报(自然科学版)', 'CNKI'], ['卫生职业教育', 'CNKI'], ['网络安全技术与应用', 'CNKI'], ['计算机工程与设计', 'CNKI'], ['计算机学报', 'CNKI'], ['情报探索', 'CNKI'], ['现代信息科技', 'CNKI']]
const rels_date=[['地理知识图谱下的建筑群空间分布模式推理', '2023'], ['学业预警知识图谱的构建与应用', '2023'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '2023'], ['《人工智能应用导论》知识图谱构建与应用研究', '2023'], ['基于知识图谱的海洋数值预报数据推荐算法', '2023'], ['时态知识图谱的推理研究综述', '2023'], ['《山海经》知识图谱构建与应用研究', '2023'], ['高校IT运维知识图谱构建及应用', '2023']]
const rels_url=[['地理知识图谱下的建筑群空间分布模式推理', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50lqbdNo8z0wC2CMNOSuvHmHLVNnW2rbj7WrmcNNMwN0lMx5P0x-rTEa&uniplatform=NZKPT'], ['学业预警知识图谱的构建与应用', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50kyKUrPKilczQCToTb0b8hR90UZ_coCnRG5-mFTh0KJYq5nsDzG2GIu&uniplatform=NZKPT'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50loVFp_9WcsUA-WIO5VPFBwqL4Z0qvbQZmVs1z40ce6xS5VghuFE8SX&uniplatform=NZKPT'], ['《人工智能应用导论》知识图谱构建与应用研究', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50ntGgPOL7QfrrIhj5ge6CBH4g2IsyPB8asXh8xKI3kodiPsmDcTH8Zw&uniplatform=NZKPT'], ['基于知识图谱的海洋数值预报数据推荐算法', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50nW0ftToGaH65dirvJKW0nseKn702sm2gcw_U7v3Bi-WOR-4T8vghXQ&uniplatform=NZKPT'], ['时态知识图谱的推理研究综述', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50n2_FC1ezrNgNLgIgJzEpc4dzL6iDCe0g5IUw98rlIO1hnPzttTlaiP&uniplatform=NZKPT'], ['《山海经》知识图谱构建与应用研究', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50niO_CdaBNPNX-0uaDVZU7N5AAnulcHnorXGWxEt2gB0eRbKuKlYbR5&uniplatform=NZKPT'], ['高校IT运维知识图谱构建及应用', 'https://kns.cnki.net/kcms2/article/abstract?v=3uoqIhG8C44YLTlOAiTRKu87-SJxoEJu6LL9TJzd50l8yRr-dwAdi5vhgvFP3RlDDHgKkYlPZYTXibJWzFBHw1euGu1vuenZ&uniplatform=NZKPT']]
const rels_language=[['地理知识图谱下的建筑群空间分布模式推理', '中文;'], ['学业预警知识图谱的构建与应用', '中文;'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '中文;'], ['《人工智能应用导论》知识图谱构建与应用研究', '中文;'], ['基于知识图谱的海洋数值预报数据推荐算法', '中文;'], ['时态知识图谱的推理研究综述', '中文;'], ['《山海经》知识图谱构建与应用研究', '中文;'], ['高校IT运维知识图谱构建及应用', '中文;']]
const rels_tags=[['地理知识图谱下的建筑群空间分布模式推理', 'building cluster pattern recognition'], ['地理知识图谱下的建筑群空间分布模式推理', 'geographic entity'], ['地理知识图谱下的建筑群空间分布模式推理', 'geographic knowledge'], ['地理知识图谱下的建筑群空间分布模式推理', 'grid-pattern'], ['地理知识图谱下的建筑群空间分布模式推理', 'spatial cognition'], ['地理知识图谱下的建筑群空间分布模式推理', 'spatial reasoning'], ['地理知识图谱下的建筑群空间分布模式推理', 'spatial relationship'], ['地理知识图谱下的建筑群空间分布模式推理', '地理实体'], ['地理知识图谱下的建筑群空间分布模式推理', '地理知识'], ['地理知识图谱下的建筑群空间分布模式推理', '建筑群模式识别'], ['地理知识图谱下的建筑群空间分布模式推理', '格网模式'], ['地理知识图谱下的建筑群空间分布模式推理', '知识图谱'], ['地理知识图谱下的建筑群空间分布模式推理', '空间关系'], ['地理知识图谱下的建筑群空间分布模式推理', '空间推理'], ['地理知识图谱下的建筑群空间分布模式推理', '空间认知 knowledge graph'], ['学业预警知识图谱的构建与应用', 'Neo4j'], ['学业预警知识图谱的构建与应用', 'Neo4j cademic early warning'], ['学业预警知识图谱的构建与应用', 'data layer'], ['学业预警知识图谱的构建与应用', 'knowledge graph'], ['学业预警知识图谱的构建与应用', 'model layer'], ['学业预警知识图谱的构建与应用', '学业预警'], ['学业预警知识图谱的构建与应用', '数据层'], ['学业预警知识图谱的构建与应用', '模式层'], ['学业预警知识图谱的构建与应用', '知识图谱'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', 'Biomedical electronics'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', 'Online course'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '在线课程 Knowledge graph'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '生物医学电子学'], ['基于知识图谱理念的生物医学电子学在线课程建设初步探索', '知识图谱'], ['《人工智能应用导论》知识图谱构建与应用研究', '人工智能应用导论课程'], ['《人工智能应用导论》知识图谱构建与应用研究', '应用研究'], ['《人工智能应用导论》知识图谱构建与应用研究', '推理实验'], ['《人工智能应用导论》知识图谱构建与应用研究', '知识图谱'], ['基于知识图谱的海洋数值预报数据推荐算法', 'data recommendation'], ['基于知识图谱的海洋数值预报数据推荐算法', 'knowledge graph'], ['基于知识图谱的海洋数值预报数据推荐算法', 'marine numerical forecasting literature'], ['基于知识图谱的海洋数值预报数据推荐算法', 'research task'], ['基于知识图谱的海洋数值预报数据推荐算法', 'similarity'], ['基于知识图谱的海洋数值预报数据推荐算法', 'user behavior'], ['基于知识图谱的海洋数值预报数据推荐算法', '数据推荐 marine numerical forecast'], ['基于知识图谱的海洋数值预报数据推荐算法', '海洋数值预报'], ['基于知识图谱的海洋数值预报数据推荐算法', '海洋数值预报文献'], ['基于知识图谱的海洋数值预报数据推荐算法', '用户行为'], ['基于知识图谱的海洋数值预报数据推荐算法', '相似度'], ['基于知识图谱的海洋数值预报数据推荐算法', '知识图谱'], ['基于知识图谱的海洋数值预报数据推荐算法', '研究任务'], ['时态知识图谱的推理研究综述', 'knowledge completion'], ['时态知识图谱的推理研究综述', 'knowledge graph'], ['时态知识图谱的推理研究综述', 'knowledge prediction'], ['时态知识图谱的推理研究综述', 'temporal knowledge reasoning'], ['时态知识图谱的推理研究综述', '时态知识图谱'], ['时态知识图谱的推理研究综述', '时态知识推理'], ['时态知识图谱的推理研究综述', '知识图谱 temporal knowledge graph'], ['时态知识图谱的推理研究综述', '知识补全'], ['时态知识图谱的推理研究综述', '知识预测'], ['《山海经》知识图谱构建与应用研究', 'association'], ['《山海经》知识图谱构建与应用研究', 'digital humantiy'], ['《山海经》知识图谱构建与应用研究', 'knowledge graph'], ['《山海经》知识图谱构建与应用研究', 'semantic'], ['《山海经》知识图谱构建与应用研究', 'topic map'], ['《山海经》知识图谱构建与应用研究', '主题图'], ['《山海经》知识图谱构建与应用研究', '关联'], ['《山海经》知识图谱构建与应用研究', '山海经'], ['《山海经》知识图谱构建与应用研究', '数字人文'], ['《山海经》知识图谱构建与应用研究', '知识图谱'], ['《山海经》知识图谱构建与应用研究', '语义 The Classic of Mountains and Seas'], ['高校IT运维知识图谱构建及应用', 'IT operation and maintenance'], ['高校IT运维知识图谱构建及应用', 'IT运维'], ['高校IT运维知识图谱构建及应用', 'Q&A system'], ['高校IT运维知识图谱构建及应用', '知识图谱'], ['高校IT运维知识图谱构建及应用', '问答系统 knowledge graph']]

const rels_desc=[['数据库', 'DataBase（DB）'], ['数据库管理系统', 'DataBaseManagementSystem(DBMS)'], ['SQL', 'StructuredQueryLanguage(SQL)'], ['DDL', 'DataDefinitionLanguage'], ['DML', 'DataManipulationLanguage'], ['DQL', 'DataQueryLanguage'], ['DCL', 'DataControlLanguage'], ['查询所有数据库', 'showdatabases'], ['查询当前数据库', 'selectdatabase()'], ['创建数据库', 'createdatabase[ifnotexists]数据库名[defaultcharset字符集][collate排序规则]'], ['删除数据库', 'dropdatabase[ifexists]数据库名'], ['切换数据库', 'use数据库名'], ['查询当前数据库所有表', 'showtables'], ['查看指定表结构', 'desc表名'], ['查询指定表的建表语句', 'showcreatetable表名'], ['创建表结构', 'CREATETABLE表名(字段1字段1类型[COMMENT字段1注释]，字段2字段2类型[COMMENT字段2注释]，字段3字段3类型[COMMENT字段3注释]，......字段n字段n类型[COMMENT字段n注释])[COMMENT表注释]'], ['添加字段', 'ALTERTABLE表名ADD字段名类型(长度)[COMMENT注释][约束]'], ['修改数据类型', 'ALTERTABLE表名MODIFY字段名新数据类型(长度)'], ['修改字段名和字段类型', 'ALTERTABLE表名CHANGE旧字段名新字段名类型(长度)[COMMENT注释][约束]'], ['删除字段', 'ALTERTABLE表名DROP字段名'], ['修改表名', 'ALTERTABLE表名RENAMETO新表名'], ['删除表', 'DROPTABLE[IFEXISTS]表名'], ['给指定字段添加数据', 'INSERTINTO表名(字段名1，字段名2，...)VALUES(值1，值2，...)'], ['给全部字段添加数据', 'INSERTINTO表名VALUES(值1，值2，...)'], ['批量添加数据', 'INSERTINTO表名VALUES(值1，值2，...)，(值1，值2，...)，(值1，值2，...)'], ['修改数据', 'UPDATE表名SET字段名1=值1'], ['修改数据', '字段名2=值2'], ['修改数据', '....[WHERE条件]'], ['删除数据', 'DELETEFROM表名[WHERE条件]'], ['查询多个字段', 'SELECT字段1，字段2，字段3...FROM表名'], ['字段设置别名', 'SELECT字段1[别名1]'], ['字段设置别名', '字段2[别名2]...FROM表名'], ['去除重复记录', 'SELECTDISTINCT字段列表FROM表名'], ['条件查询', 'SELECT字段列表FROM表名WHERE条件列表'], ['分组查询', 'SELECT字段列表FROM表名[WHERE条件]GROUPBY分组字段名[HAVING分组后过滤条件]'], ['查询用户', 'select*frommysql.user'], ['创建用户', 'CREATEUSER用户名@主机名IDENTIFIEDBY密码'], ['修改用户密码', 'ALTERUSER用户名@主机名IDENTIFIEDWITHmysql_native_passwordBY新密码'], ['删除用户', 'DROPUSER用户名@主机名']]
const rels_belong=[['数据库', '数据库'], ['数据库管理系统', '系统'], ['SQL', '数据库语句'], ['DDL', 'SQL'], ['DML', 'SQL'], ['DQL', 'SQL'], ['DCL', 'SQL'], ['查询所有数据库', 'DDL'], ['查询当前数据库', 'DDL'], ['创建数据库', 'DDL'], ['删除数据库', 'DDL'], ['切换数据库', 'DDL'], ['查询当前数据库所有表', 'DDL'], ['查看指定表结构', 'DDL'], ['查询指定表的建表语句', 'DDL'], ['创建表结构', 'DDL'], ['添加字段', 'DDL'], ['修改数据类型', 'DDL'], ['修改字段名和字段类型', 'DDL'], ['删除字段', 'DDL'], ['修改表名', 'DDL'], ['删除表', 'DDL'], ['给指定字段添加数据', 'DML'], ['给全部字段添加数据', 'DML'], ['批量添加数据', 'DML'], ['修改数据', 'DML'], ['删除数据', 'DML'], ['查询多个字段', 'DQL'], ['字段设置别名', 'DQL'], ['去除重复记录', 'DQL'], ['条件查询', 'DQL'], ['分组查询', 'DQL'], ['查询用户', 'DCL'], ['创建用户', 'DCL'], ['修改用户密码', 'DCL'], ['删除用户', 'DCL']]

const rels_zotero=[['MySQL-2.pdf', ''], ['MySQL-2.pdf', '每一页固定大小为16kb，B+树相比红黑树所存储的节点更多，因此页的层级更少，提高查询效率，减小占用空间'], ['MySQL-1.pdf', 'DataBase（DB）'], ['MySQL-1.pdf', 'DataBase Management System (DBMS)'], ['MySQL-1.pdf', 'Structured Query Language (SQL)'], ['MySQL-1.pdf', 'Data Definition Language'], ['MySQL-1.pdf', 'Data Manipulation Language'], ['MySQL-1.pdf', 'Data Query Language'], ['MySQL-1.pdf', 'Data Control Language'], ['MySQL-1.pdf', 'show databases ;'], ['MySQL-1.pdf', 'select database() ;'], ['MySQL-1.pdf', 'create database [ if not exists ] 数据库名 [ default charset 字符集 ] [ collate 排序 规则 ] ;'], ['MySQL-1.pdf', 'drop database [ if exists ] 数据库名 ;'], ['MySQL-1.pdf', 'use 数据库名 ;'], ['MySQL-1.pdf', 'show tables;'], ['MySQL-1.pdf', 'desc 表名 ;'], ['MySQL-1.pdf', 'show create table 表名 ;'], ['MySQL-1.pdf', 'CREATE TABLE 表名( 字段1 字段1类型 [ COMMENT 字段1注释 ], 字段2 字段2类型 [COMMENT 字段2注释 ], 字段3 字段3类型 [COMMENT 字段3注释 ], ...... 字段n 字段n类型 [COMMENT 字段n注释 ] ) [ COMMENT 表注释 ] ;'], ['MySQL-1.pdf', 'ALTER TABLE 表名 ADD 字段名 类型 (长度) [ COMMENT 注释 ] [ 约束 ];'], ['MySQL-1.pdf', 'ALTER TABLE 表名 MODIFY 字段名 新数据类型 (长度);'], ['MySQL-1.pdf', 'ALTER TABLE 表名 CHANGE 旧字段名 新字段名 类型 (长度) [ COMMENT 注释 ] [ 约束 ];'], ['MySQL-1.pdf', 'ALTER TABLE 表名 DROP 字段名;'], ['MySQL-1.pdf', 'ALTER TABLE 表名 RENAME TO 新表名;'], ['MySQL-1.pdf', 'DROP TABLE [ IF EXISTS ] 表名;'], ['MySQL-1.pdf', 'INSERT INTO 表名 (字段名1, 字段名2, ...) VALUES (值1, 值2, ...);'], ['MySQL-1.pdf', 'INSERT INTO 表名 VALUES (值1, 值2, ...);'], ['MySQL-1.pdf', 'INSERT INTO 表名 VALUES (值1, 值2, ...), (值1, 值2, ...), (值1, 值2, ...) ;'], ['MySQL-1.pdf', 'UPDATE 表名 SET 字段名1 = 值1 , 字段名2 = 值2 , .... [ WHERE 条件 ] ;'], ['MySQL-1.pdf', 'DELETE FROM 表名 [ WHERE 条件 ] ;'], ['MySQL-1.pdf', 'SELECT 字段1, 字段2, 字段3 ... FROM 表名 ;'], ['MySQL-1.pdf', 'SELECT 字段1 [ 别名1 ] , 字段2 [ 别名2 ] ... FROM 表名;'], ['MySQL-1.pdf', 'SELECT DISTINCT 字段列表 FROM 表名;'], ['MySQL-1.pdf', 'SELECT 字段列表 FROM 表名 WHERE 条件列表 ;'], ['MySQL-1.pdf', 'SELECT 字段列表 FROM 表名 [ WHERE 条件 ] GROUP BY 分组字段名 [ HAVING 分组 后过滤条件 ];'], ['MySQL-1.pdf', 'select * from mysql.user;'], ['MySQL-1.pdf', "CREATE USER '用户名'@'主机名' IDENTIFIED BY '密码';"], ['MySQL-1.pdf', "ALTER USER '用户名'@'主机名' IDENTIFIED WITH mysql_native_password BY '新密码' ;"], ['MySQL-1.pdf', "DROP USER '用户名'@'主机名' ;"], ['MySQL-1.pdf', '数据库'], ['MySQL-1.pdf', '数据库管 理系统'], ['MySQL-1.pdf', 'SQL'], ['MySQL-1.pdf', 'DDL'], ['MySQL-1.pdf', 'DML'], ['MySQL-1.pdf', 'DQL'], ['MySQL-1.pdf', 'DCL'], ['MySQL-1.pdf', '查询所有数据库'], ['MySQL-1.pdf', '查询当前数据库'], ['MySQL-1.pdf', '创建数据库'], ['MySQL-1.pdf', '删除数据库'], ['MySQL-1.pdf', '切换数据库'], ['MySQL-1.pdf', '查询当前数据库所有表'], ['MySQL-1.pdf', '查看指定表结构'], ['MySQL-1.pdf', '查询指定表的建表语句'], ['MySQL-1.pdf', '创建表结构'], ['MySQL-1.pdf', '添加字段'], ['MySQL-1.pdf', '修改数据类型'], ['MySQL-1.pdf', '修改字段名和字段类型'], ['MySQL-1.pdf', '删除字段'], ['MySQL-1.pdf', '修改表名'], ['MySQL-1.pdf', '删除表'], ['MySQL-1.pdf', '给指定字段添加数据'], ['MySQL-1.pdf', '给全部字段添加数据'], ['MySQL-1.pdf', '批量添加数据'], ['MySQL-1.pdf', '修改数据'], ['MySQL-1.pdf', '删除数据'], ['MySQL-1.pdf', '查询多个字段'], ['MySQL-1.pdf', '字段设置别名'], ['MySQL-1.pdf', '去除重复记录'], ['MySQL-1.pdf', '条件查询'], ['MySQL-1.pdf', '分组查询'], ['MySQL-1.pdf', '查询用户'], ['MySQL-1.pdf', '创建用户'], ['MySQL-1.pdf', '修改用户密码'], ['MySQL-1.pdf', '删除用户'], ['MySQL-1.pdf', '系统'], ['MySQL-1.pdf', '数据库语句'], ['MySQL-1.pdf', '数据查询语言，用来查询数据库中表的记录'], ['MySQL-1.pdf', '数据控制语言，用来创建数据库用户、控制数据库的 访问权限'], ['MySQL-1.pdf', '数据操作语言，用来对数据库表中的数据进行增删改'], ['MySQL-1.pdf', '数据定义语言，用来定义数据库对象(数据库，表， 字段)'], ['MySQL-1.pdf', '操作关系型数据库的编程语言，定义了一套操作 关系型数据库统一 标准'], ['MySQL-1.pdf', '操纵和管理数据库的大型软件'], ['MySQL-1.pdf', '存储数据的仓库，数据是有组织的进行存储'], ['基于知识图谱的海洋数值预报数据推荐算法', '知识抽取则使用ｊｉｅｂａ分词工 具 对 文 献 题 目 进 行 分 词 处 理和词性标注，根据题目词性及内容的特点，为获取海洋 数值预报对象及其研究任务，筛选出题目中包含的名词及 动词，抽取出三 元 组 （名 词， 动 词， 名 词 ） 信 息。'], ['基于知识图谱的海洋数值预报数据推荐算法', '近年来，基于知识图谱的推 荐 中 基 于 嵌 入 的 方 法 越 来 越 受 到 重 视［３］， Ｗａｎｇ 等［４］设 计 ＲｉｐｐｌｅＮｅｔ方法利用从知识图谱中 抽 取 的 实 体 节 点 所 相 连 的 节点嵌入表征来更新用户表征，由此进行推荐结果的预测。'], ['算法竞赛入门经典', '另 一 种思路 是 把 a、b、e 这 3 个 变量 本 身 改 成 a 和 b<e 的 形式 。 首 先 检 查 a 和 的 值 ， 如 果 a>b， 则 交换 a 和 b (利用 前 面 讲 过的 三 变量 交换 法 ) ， 接下 来检查 a 和 c， 最 后 检查 b 和 c， 程'], ['算法竞赛入门经典', '读者 也 许 发 现 了 ， 如 果 a 为 真 ， 则 无 论 b 的 值 如 何，a ||b 均 为 真 。 换 句 话 说， 一 旦 发 现 a 为 真 ,就不 必 计 算 b 的'], ['算法竞赛入门经典', '异 或 运算 ^ 代 替 加 法 和 减法 ， 它 还 可 以 进一步 简写 成 ae\\=~b^=a^=b。'], ['算法竞赛入门经典', '可 以 将 这 种 方法 形象 地 比喻成 将 一 瓶 着 油 和 一 瓶 醋 借 助 一 个 空 瓶子 进行 交换 : 先 把 交 油 倒入 空 瓶 ， 然 后 将 醋 倒 进 原 来 的 次 油 瓶 中 ， 最 后 把 酱油 从 辅助 的 瓶子 中 倒 入 原来 的 酯 瓶 子 里 。 这 样 的 比喻 虽然形象 ， 但 是 初学 者 应当 注 意 它 和 真正 的 变量 交换 的 区 别 。'], ['算法竞赛入门经典', '算 法竞赛 的 程序 应 当 只 做 3 件 事情 : 读 入 数据 、 计 算 结 果 、 打 印 输出 。 不 要 打印 提示信息 ，'], ['算法竞赛入门经典', '其 次， 不 要 让 程序 “ 按任意 键 退出 ”例如 调用 system(“pause”)， 或 者 加 一个多余 的 getchar0) ，因 为 不 会 有 人 来“ 按 任意 键 ” 的 。 不 少 早期 的 C 语言 教材 会 建议 在 程序 的 最 后 加 这 样 一 条 语句 来 “观察 输出结果 ”， 但 注意 千 万 不要 在 算法竞赛 中 这 样 做'], ['算法竞赛入门经典', '数 先“变 ”成 浮 点 数 ， 然 后 浮 点 数 - 浮 点 数 = 浮 点 数'], ['算法竞赛入门经典', '，8/5 的 确切含义 是 8 除 以 5 所 得 商 值 的 整数 部'], ['算法竞赛入门经典', '部 分 是 竞赛 篇 〈 第 9 一 11 章 )， 涉 及 竞赛 中 常用 的 其 他 知识 点 和 技巧 。 和 前 两 部 分 相 比 ， 第 3 部 分 涉及 的 内 容 更 加 广泛 ， 其 中 还包括 一 些难以 理解 的 “学 术 内 容 ”， 但 其 实 这 些 才 是 算法 的 精 艇 。'], ['算法竞赛入门经典', '部 分 是 算法 篇 (第 5 一 8 章 )， 在 介绍 算法 的 同时 继续 强化语言 ， 补 充 了 第 1 部 分 没有 涉及 的 语言 特性 ， 如 位 运算 、 动 态内 存 管理等， 并 延续 第 一 部 分 的 风格 ， 在 需要 时 引入 更 多 的 思想 和 技巧 。 学 习 完 前 两 部 分 的 读者 应 当 可 以 完成 相当 数量 的 练习 题'], ['算法竞赛入门经典', '部 分 是 语言 篇 (第 1一 4 章 )， 纯 粹 介绍 语言 ， 几 乎 不 涉及 算法 ， 但 逐步 引入 一 些 工 程 性 的 东西 ， 如 测试 、 断 言 、 擅 代码 和 迭代 开发 等 。'], ['算法竞赛入门经典', '算 法 竞赛 的 核心 是 算法 。'], ['算法竞赛入门经典', '我 曾 考虑 过 把 C 语言 和 算 法分 开讲 解， 一 本 书 讲 语言 ， 另 一 本书 讲 基础 算法 。 但 后 来 我 发 现， 其 实二 者 难以分 开 。'], ['算法竞赛入门经典', '但 语言 毕竟只 是算法 竞赛 的 工具'], ['算法竞赛入门经典', '我 开始 庆幸 自己 先 学 的 是 C 语言 一 一 在 我 购买 的 各 类 技术 书籍 中 ， 几乎全 部 使 用 的 是 C 语言 而 不 是 Pascal 语言 ， 尽 管 偶尔 有 用 Delphi 的 文章 ， 但 这 种 语言 似乎 除了 构建 漂亮 的 界面 比较 方便之 外 ， 并 没有 太 多 的 “技术 含量 ”。 我 始终 保持着 对 C 语言 的 熟 悉 ， 而 事实证 明 这 对 我 的 职业 生涯 发 挥 了 巨大 的 作用 。'], ['时态知识图谱的推理研究综述', '根 据 不 同 的 实 际 需 求 ，\ue5d2\ue5cf 时 态 知 识 图 谱 可 被 表 示 为离散时 态 动 态 图 （ Ｄｉ ｓｃｒｅ ｔ ｅ\ue5d2\ue5cf Ｔ ｅ ｍ ｐ ｏ ｒ ａ ｌ\ue5e5 Ｄ ｙ ｎ ａ ｍ ｉ ｃ \ue5e5Ｇ ｒ ａ ｐ ｈ ， 简 称 为 离 散 动 态 图 ） 或\ue5d2\ue5cf 连 续 时 态 动 态 图 （ Ｃ ｏ ｎ ｔ ｉ ｎ ｕ ｏ ｕ ｓ \ue5e5Ｔ ｅ ｍ ｐ ｏ ｒ ａ ｌ\ue5e5 Ｄ ｙ ｎ ａ ｍ ｉ ｃ\ue5d2\ue5cf Ｇ ｒ ａ ｐ ｈ ， 简称为 连 续动 态 图 ） 两 种形式 ［ １ 气'], ['《山海经》知识图谱构建与应用研究', '知识图谱的构建方法主要有三种方式，即自顶 向下、自底向上和二者混合的方法。其中，业内最常 使用的是自底向上的构建方法，该方法从数据源中 自动或人工提取主题、属性和关系构建知识图谱的 模式。其主要的构建过程按照“知识获取———知识 表 示———知 识 存 储———知 识 可 视 化 ”的 步 骤 进 行［12］，本文在此构建过程的基础上，融入 DIKW 层 次结构的特点形成《山海经》知识图谱构建流程，如 图 3 所示。'], ['《山海经》知识图谱构建与应用研究', '知识结构网络化、网络结 构复杂、网络由三元组构成、数据主要由知识库承载 是知识图谱的四大基本特征［2］。'], ['高校IT运维知识图谱构建及应用', '本文基于 Python+Neo4j 搭建了问答系统， 作为人工客服的有益补充，能减缓一线运维人员的工作强度 和压力，提高运维效率和质量。'], ['高校IT运维知识图谱构建及应用', '本文建立了 8 种问句类型，通过提取问句中的疑问 词与用户疑问词分类词典匹配后实现分类。问答系统基于分 类后提取的实体类别和实体进行解析后生成本体三元组，据 此构建 Cyper 语句进行描述，然后发送 Cyper 语句到 neo4j 图数据库查询。然后将查询返回数据与系统匹配提取的答案 模板进行整合，将最终解答回复给用户。'], ['高校IT运维知识图谱构建及应用', "运行语句 :“MATCH (m:Keywords)<- [r:key_words]-(n:Maintenance) where m.name ='OA 移动 ' return distinct n.name, n.desc, n.instructions, n.department,n.telephone, n.cause, n.area, n.correlation”"], ['高校IT运维知识图谱构建及应用', '知识图谱本质上是一种大型、结构化的语义知识库，以 符号形式描述客观世界的概念实体事件及其之间的关系 [11]。 通俗讲：知识图谱是由实体、关系和属性组成的一种数据结构。'], ['高校IT运维知识图谱构建及应用', '算法能力层是所有运维业务管理功能实现的算法支撑， 是根据系统逻辑需要，基于知识图谱方法和数据层实现的实 体三元组抽取、推理过程。'], ['基于知识图谱与深度学习的推荐算法的应用研究_吴建华.pdf', '可以将学位论文的全部或部分内容编入有关数据库 进行检索，并采用影印、缩印或扫描等复制手段保存、'], ['基于知识图谱与深度学习的推荐算法的应用研究_吴建华.pdf', '料。对本文的研究做出重要贡献的个人和集体，均已在 论文中作了明确的说明并表示了谢意。本人完全意'], ['disMath-chapt9-11.pdf', '广东工业大学 自动化学院'], ['disMath-chapt6.pdf', '包含性质的所有元素，且不能重复算，之后再用全集减去这些元素(排斥),得到不含这些性质的所有元素。'], ['disMath-chapt6.pdf', '注意：集合中的元素可以无序，但不能重复！'], ['disMath-chapt6.pdf', '证明：对于任意集合A, B, C，有(A − B) − C = (A − C) − (B − C). 证明：∀x，有: x ∈ (A − C) − (B − C) ⇔ x ∈ (A − C) ∧ x / ∈ (B − C) ⇔ (x ∈ A ∧ x / ∈ C) ∧ ¬(x ∈ B ∧ x / ∈ C) ⇔ (x ∈ A ∧ x / ∈ C) ∧ (x / ∈ B ∨ x ∈ C) ⇔ (x ∈ A ∧ x / ∈B∧x / ∈ C) ∨ (x ∈ A ∧ x / ∈ C ∧ x ∈ C) ⇔x∈A∧x / ∈B∧x / ∈C ⇔ x ∈ (A − B) − C 所以有：(A − B) − C = (A − C) − (B − C).'], ['disMath-chapt6.pdf', '证明：对于任意集合A和B，P(A) ∩ P(B) = P(A ∩ B). 证明：设∀x ∈ P(A) ∩ P(B)，有： x ∈ P(A) ∩ P(B) ⇔ x ∈ P(A) ∧ x ∈ P(B) x⊆A∧x⊆B⇔x⊆A∩B x ∈ P(A ∩ B)'], ['disMath-chapt6.pdf', '再由右边证明左边 ∀x ∈ (A ∩ B) ∪ C，有 x ∈ (A ∩ B) ∪ C ⇔ x ∈ A ∩ B ∨ x ∈ C ⇔ (x ∈ A ∧ x ∈ B) ∨ x ∈ C ⇔ (x ∈ A ∨ x ∈ C) ∧ (x ∈ B ∨ x ∈ C) ⇔ x ∈ A ∧ (x ∈ B ∨ x ∈ C) ⇔ x ∈ A ∩ (B ∪ C)'], ['disMath-chapt6.pdf', '证明对于任意集合A, B, C，有: (A ∩ B) ∪ C = A ∩ (B ∪ C) iff C ⊆ A. 证明：先由左边证明右边 ∀x ∈ C，有x ∈ (A ∩ B) ∪ C ∵ (A ∩ B) ∪ C = A ∩ (B ∪ C) ∴ x ∈ A ∩ (B ∪ C) ∴x∈A∧x∈B∪C ∴x∈A ∴ C ⊆ A.'], ['disMath-chapt6.pdf', '证明：(A ⊕ B) ⊕ C = A ⊕ (B ⊕ C). 证明：设a, b, c分别表示∀x(x ∈ A)、∀x(x ∈ B)、∀x(x ∈ C)，则∀x，有： x ∈ (A ⊕ B) ⊕ C ⇔ (x ∈ A ⊕ B ∧ x / ∈ C) ∨ (x / ∈ A ⊕ B ∧ x ∈ C) ⇔ (((a ∧ ¬b) ∨ (¬a ∧ b)) ∧ ¬c) ∨ (¬((a ∧ ¬b) ∨ (¬a ∧ b)) ∧ c) ⇔ (¬a ∧ ¬b ∧ c) ∨ (¬a ∧ b¬c) ∨ (a ∧ ¬b ∧ ¬c) ∨ (a ∧ b ∧ c) ⇔ m1 ∨ m2 ∨ m4 ∨ m7 x ∈ A ⊕ (B ⊕ C) ⇔ · · · ⇔ (¬a ∧ ¬b ∧ c) ∨ (¬a ∧ b¬c) ∨ (a ∧ ¬b ∧ ¬c) ∨ (a ∧ b ∧ c) ⇔ m1 ∨ m2 ∨ m4 ∨ m7 ∴ (A ⊕ B) ⊕ C = A ⊕ (B ⊕ C)'], ['disMath-chapt6.pdf', '求证：A ∩ (B ⊕ C) = (A ∩ B) ⊕ (A ∩ C) 证明： 右边 = ((A ∩ B)∩ ∼ (A ∩ C)) ∪ (∼ (A ∩ B) ∩ (A ∩ C)) = ((A ∩ B) ∩ (∼ A∪ ∼ C)) ∪ ((∼ A∪ ∼ B) ∩ (A ∩ C)) = (A ∩ B∩ ∼ A) ∪ (A ∩ B∩ ∼ C) ∪ (A ∩ C∩ ∼ A) ∪ (A ∩ C∩ ∼ B) = (A ∩ B∩ ∼ C) ∪ (A ∩ C∩ ∼ B) = A ∩ ((B∩ ∼ C) ∪ (∼ B ∩ C)) = A ∩ ((B − C) ∪ (C − B)) = A ∩ (B ⊕ C)'], ['disMath-chapt6.pdf', '错位排列的计数问题: 设i1i2 · · · in是1, 2, · · · , n这n个数的排列. 如果 排在第i位的数都不等于i，其中i = 1, 2, · · · , n，则称这个排列为错位排 列. 将n个数的不同错位排列个数记作Dn，证 明Dn = n! [1 − 1 1! + 1 2! − · · · + (−1)n 1 n! ] 证明: 先划分集合，设第i位刚好是i的排列的集合为Ai， 则|Ai| = (n − 1)! 则Dn = |A1 ∩ A2 · · · ∩An|，根据包含排斥原理，有 Dn = n! − n(n − 1)! + C2 n(n − 2)! − C3 n(n − 3)! + · · · + (−1)nCn n = Dn = n! [ 1− 1 1! + 1 2! − · · · + (−1)n 1 n! ]'], ['disMath-chapt6.pdf', '某班有25名学生，其中12人会打排球，6人会打网球，14人会打篮 球，6人会打排球和篮球，5人会打网球和篮球，还有2人会打3种球. 而会打网球的人都会打另一种球，求不会打这3种球的人数. 解: 设会打排球、网球和篮球的学生集合分别为A、B和C，则有 |A| = 12,|B| = 6,|C| = 14,|S| = 25 |A ∩ C| = 6,|B ∩ C| = 5,|A ∩ B ∩ C| = 2 根据“6个会打网球的人都会打另一种球”，推算 出|A ∩ B| = (6 − 5) + 2 = 3 ∴ |A ∩ B ∩ C| = 25 − (12 + 6 + 14) + (6 + 5 + 3) − 2 = 5'], ['disMath-chapt6.pdf', '2个集合: |A1 ∩ A2| = |S| − (|A1| + |A2|) + |A1 ∩ A2| 3个集合: |A1 ∩ A2 ∩ A3| = |S| − (|A1| + |A2| + |A3|) + (|A1 ∩ A2| + |A1 ∩ A3| + |A2 ∩ A3|) − |A1 ∩ A2 ∩ A3|'], ['disMath-chapt6.pdf', '有100名学生，其中47名选修了Java语言，35名选修了网络安 全，23名同时选修了这两门课，问有多少学生这两门课都没有选 修？ 解: 设A和B分别代表选修了Java语言和选修了网络安全课的学生 集合，则有 |A − B| = |A| − |A ∩ B| = 47 − 23 = 24 |B − A| = |B| − |A ∩ B| = 35 − 23 = 12 ∴ |A ∪ B| = 24 + 23 + 12 = 59 ∴ | ∼ (A ∪ B)| = 100 − 59 = 41'], ['disMath-chapt6.pdf', '设A = {{a}, {a, b}}，计算∪ ∪ A，∩ ∩ A和∩ ∪ A ∪ (∪ ∪ A − ∪ ∩ A). 解： ∪A = {a, b}，∩A = {a} ∪ ∪ A = a ∪ b，∩ ∩ A = a ∪ ∩ A = a，∩ ∪ A = a ∩ b ∩ ∪ A ∪ (∪ ∪ A − ∪ ∩ A) = (a ∩ b) ∪ ((a ∪ b) − a) = (a ∩ b) ∪ (b − a) = b'], ['disMath-chapt6.pdf', '设A = {0, 1, 2}, B = {2, 3}，则有： A ⊕ B = {0, 1} ∪ {3} = {0, 1, 3} A ⊕ B = {0, 1, 2, 3} − {2} = {0, 1, 3}'], ['disMath-chapt6.pdf', 'n元集的所有子集的个数为:C0 n + C1 n + C2 n + · · · + Cn n = 2n.'], ['disMath-chapt6.pdf', '求集合A = {a, b, c}的全部子集 0元子集，Ø,有C0 3 个. 1元子集，{a}, {b}, {c}，有C1 3 个. 2元子集，{a, b}, {a, c}, {b, c}，有C2 3 个. 3元子集，{a, b, c}，有C3 3 个.'], ['disMath-chapt6.pdf', 'C = {a, {a}, b, c, {{d}}, {d, e}}'], ['disMath-chapt6.pdf', '列举法，列出所有的元素，如A = {1, 2, 3, 4} 概括法，给出集合中元素的属性，如B = {x|x = 2k, k = 1, 2, · · · }'], ['disMath-chapt6.pdf', 'N: 自然数集(包括0). Z, Q, R, C分别代表整数集、有理数集、实数集和复数集.'], ['disMath-chapt6.pdf', '所有自然数构成的集合. 广工所有男生构成的集合. 所有英文单词构成的集合.'], ['disMath-chapt6.pdf', '集合运算的主要算律(部分) 分配律 A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C) A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C) 排中律: A∪ ∼ A = E 吸收律: A ∪ (A ∩ B) = A, A ∩ (A ∪ B) = A 德.摩根律 A − (B ∪ C) = (A − B) ∩ (A − C) A − (B ∩ C) = (A − B) ∪ (A − C) ∼ (B ∪ C) =∼ B∩ ∼ C ∼ (B ∪ C) =∼ B∩ ∼ C ∼ Ø = E, ∼ E = Ø'], ['disMath-chapt6.pdf', '(包含排斥原理) 设S为有穷集，P1, P2, · · · , Pn是n个性质，S中的任何元素x或者具有性 质Pi，或者不具有性质Pi，两种情况必居其一. 令Ai表示S中具有性 质Pi的元素构成的子集，则S中不具有性质P1, P2, · · · , Pn的元素个数是: |A1 ∩ A2 ∩ · · · An| = |S| − n ∑ i=1 |Ai| + ∑ 1≤i<j≤n |Ai ∩ Aj| − ∑ 1≤i<j<k≤n |Ai ∩ Aj ∩ Ak| + · · · + (−1)n|A1 ∩ A2 ∩ · · · ∩ An|'], ['disMath-chapt6.pdf', '广义交：设A为非空集合，A的所有元素的公共元素构成的集合称 作A的广义交，记作∩A，符号化为： ∩A = {x|∀z(z ∈ A → x ∈ z)}'], ['disMath-chapt6.pdf', '广义并：设A为集合，A的元素的元素构成的集合称作A的广义 并，记作∪A，符号化为： ∪A = {x|∃z(z ∈ A ∧ x ∈ z)}'], ['disMath-chapt6.pdf', '对称差：A ⊕ B = (A − B) ∪ (B − A) 对称差的另一种定义: A ⊕ B = (A − B) ∪ (B − A) = (A ∪ B) − (A ∩ B)'], ['disMath-chapt6.pdf', '并集: A ∪ B = {x|x ∈ A ∨ x ∈ B}. 交集: A ∩ B = {x|x ∈ A ∧ x ∈ B}. 相对补集(差): A − B = {x|x ∈ A ∧ x / ∈ B}. 绝对补集: ∼ A = E − A = {x|x ∈ E ∧ x / ∈ A}. 多个集合的并: n ⋃ i=1 Ai = A1 ∪ A2 ∪ · · · ∪ An 多个集合的交: n ⋂ i=1 Ai = A1 ∩ A2 ∩ · · · ∩ An 推广到无穷多个集合的并和交: ∞ ⋃ i=1 Ai, ∞ ⋂ i=1 Ai'], ['disMath-chapt6.pdf', '在一个具体问题中，如果所涉及的集合都是某个集合的子集，则称这 个集合为全全全集集集，记作E或U'], ['disMath-chapt6.pdf', '设A为集合，把A的全体子集构成的集合称作A的幂集，记作P(A)或2A. 记作P(A) = {x|x ⊆ A}'], ['disMath-chapt6.pdf', '不含任何元素的集合称作空空空集集集，记作Ø. 空集的形式化表示 为Ø = {x|x 6= x}'], ['disMath-chapt6.pdf', '设A, B为集合，如果B ⊆ A且B 6= A，则称B是A的真真真子子子集集集，记作B ⊂ A'], ['disMath-chapt6.pdf', '设A, B为集合，如果B中的每个元素都是A中的元素，则称B为A的子子子 集集集，记作B ⊆ A，也称A包含B或B被A包含'], ['disMath-chapt6.pdf', '把一些事物汇集到一起组 成一个整体就称作集集集合合合，而这些事物就是这个集合的元元元素素素或成成成员员员'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '这是注释的测试'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '揭示学科的领域性知识结构和学习者的认知过程'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '红色：所需技术'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '蓝色：专业名词'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '绿色：实体名词'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '无向图'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '权威资料'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '半 结构化数据'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '结构化数据'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '复杂关系'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '图谱可 视化技术'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '图谱存储技术'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '实体关系挖掘技术'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '实体识别技术'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '获取数据源，即导出保存知识论坛半结构化数据'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '核心实体进行提取'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'Neo4j 图数据库'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '构词模式提取 上下位关系'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '提取关联关系'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '实体关系抽取'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '知识图谱的存储'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '概率性关联规则'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '条件随机场 CRF'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'LSA 算法、SVD 算法、余弦 距离计算相似度'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '皮尔逊相关系数，术语文档矩阵'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'Open IE 系统、共现分析、文 本特征、幻灯片结构特征'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '幻灯片文本位置、文本特 征、语法树'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '多维尺度法、遗传算法'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'TF-IDF、VSM、相似度 计算'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '决策树分类器'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'TF-IDF'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '关系提取'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '实体识别'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '数据源'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'KB 话语探测 器'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '观点线索地图'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '知识论坛'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '知识建构'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'SSM 设计'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'Bootstrap'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '模型 LDA'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'Echarts'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', '知识实体'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'Neo4j'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'Word2vec'], ['知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf', 'TFIDF 算法'], ['zotero', 'MySQL-3.pdf'], ['zotero', 'MySQL-2.pdf'], ['zotero', 'MySQL-1.pdf'], ['zotero', '高等数学习题册下册.pdf'], ['zotero', '地理知识图谱下的建筑群空间分布模式推理'], ['zotero', '学业预警知识图谱的构建与应用'], ['zotero', '基于知识图谱理念的生物医学电子学在线课程建设初步探索'], ['zotero', '《人工智能应用导论》知识图谱构建与应用研究'], ['zotero', '基于知识图谱的海洋数值预报数据推荐算法'], ['zotero', '算法竞赛入门经典'], ['zotero', '时态知识图谱的推理研究综述'], ['zotero', '《山海经》知识图谱构建与应用研究'], ['zotero', '高校IT运维知识图谱构建及应用'], ['zotero', '老妓抄'], ['zotero', '基于知识图谱与深度学习的推荐算法的应用研究_吴建华.pdf'], ['zotero', '英语四级.pdf'], ['zotero', '算法导论(中文版)(现代计算机常用数据结构和算法).pdf'], ['zotero', 'disMath-chapt14-18.pdf'], ['zotero', 'disMath-chapt9-11.pdf'], ['zotero', 'disMath-chapt7-8.pdf'], ['zotero', 'disMath-chapt6.pdf'], ['zotero', '知识论坛的教育知识图谱构建与可视化系统实现_薛增灿.pdf']]

const rels_data = {
    'rels_check':rels_check,
    'rels_symptom':rels_symptom,
    'rels_acompany':rels_acompany,
    'rels_recommanddrug':rels_recommanddrug,
    'rels_commonddrug':rels_commonddrug,
    'rels_noteat':rels_noteat,
    'rels_doeat':rels_doeat,
    'rels_recommandeat':rels_recommandeat,
    'rels_drug_producer':rels_drug_producer,
    'rels_category': rels_category,
    'rels_department': rels_department,

    'rels_subject': rels_subject,

    'rels_creators': rels_creators,
    'rels_abstractNote': rels_abstractNote,
    'rels_publicationTitle': rels_publicationTitle,
    'rels_libraryCatalog': rels_libraryCatalog,
    'rels_date': rels_date,
    'rels_url': rels_url,
    'rels_language': rels_language,
    'rels_tags': rels_tags,

    'rels_desc': rels_desc,
    'rels_belong': rels_belong,
    'rels_zotero': rels_zotero
}
exports.getGraphNodes = (req, res) => {
  res.send(nodes_data)
}
exports.getGraphRels = (req, res) => {
  res.send(rels_data)
}